[{"artist": "N.W.A", "album": "The Best Of N.W.A: The Strength Of Street Knowledge", "title": "100 Miles and Runnin'", "lyrics": "[Intro: FBI + MC Ren]\nCatch those motherfuckers, catch them, catch them\nHey man, keep up keep up, this way, come on man, hurry up\nYou don't really think you're gonna get away, do you?\nWe haven't spotted them yet. But they're somewhere in the immediate vicinity\n\n[Verse 1: MC Ren]\nA 100 miles and runnin' -  MC Ren, I hold the gun and\nYou want me to kill a mutherfucker and it's done in\nSince I'm stereotyped to kill and destruct -\nIs one of the main reasons I don't give a fuck\nChances are usually not good\n'Cause I'm frisked with my hands on a hot hood\nAnd gettin' jacked by the you-know-who\nWhen in a black and white the capacity is two\nWe're not alone, we're three more brothers, I mean street-brothers\nNot wearing medallions, 'cause we're not stupid, mutherfuckers\nThey're out to take our heads for what we said in the past\nPoint blank, they can kiss my black ass\nI didn't stutter when I said \"Fuck Tha Police\"\n'Cause it's hard for a nigga to get peace\nNow it's broken and can't be fixed\n'Cause police and little black niggas don't mix so\nNow I'm creepin' through the fall\nRunnin' like a G, we'll see, I might have slayed y'all\nSo for now pack the gun and\nHold it in the air 'cause MC Ren has a 100 miles of runnin'\n\n[Interlude]\nInto this news. Four fugitives are on the run\nFBI sources tell us that the four are headed\n100 miles to their homebase, Compton\n\n[Break: Dr. Dre + Eazy-E]\nLend me a mutherfuckin' ear\nSo I can tell you why\n\n[Verse 2: Dr. Dre]\nRunnin' with my brothers, headed for the homebase\nWith a steady pace on the face that just reads race\nThe road ahead goes on and on\nThe shit is gettin' longer than the mutherfuckin' marathon\nRunnin' on but never runnin' out\nStayin' wired and if I get tired, I can still try out\nHitchhikin' if that's what it gotta do\nBut nobody's pickin' up a Nigga Witta Attitude\nConfused, yo but Dre's a nigga with nuthin' to lose\nOne of the few who's been accused and abused\nOf the crime of poisonin' young minds\nBut you don't know shit til you been in my shoes\nAnd Dre is back from the C-P-T\nDroppin' some shit that's D-O-P-E\nSo fuck the P-O-L-I-C-E!\nAnd any mutherfucker that disagrees\nStuck and runnin' hard, hauling ass\n'Cause I been a nigga known for havin' a notorious past\nMy mind was slick - my temper was too quick\nNow the FBI's all over my dick\n\n[Verse 3: Eazy-E]\nGot the stick and runnin' just to find the gun that started the clock\nThat's when the E jumped off the startin' block\nA 100 miles from home and, yo, it's a long stretch\nA little sprintin' mutherfucker that they won't catch\nYeah, back to Compton again\nYo, it's either that or the Federal pen\n'Cause niggas been runnin' since beginning of time\nTakin' a minute to tell you what's on my mutherfuckin' mind\nRunnin' like I just don't care\nCompton's 50 miles but, yo, I'mma get there\nArchin' my back and on a straight route\nJust like Carl Lewis I'm ballin' the fuck out\nFrom city to city I'm a menace as I pass by\nRippin' up shit just so you can remember I'm\nA straight up nigga that's done in, gunnin' and comin'\nStraight at yo ass, a 100 miles and runnin'\n\n[Interlude]\nThis one goes out to the four brothers from Compton\nYou're almost there, but the FBI has a little message for you:\nNowhere to run to, baby. Nowhere to hide\nGood luck brothers\n\n[Verse 4: MC Ren]\nRunnin' like a nigga I hate to lose\nShow me on the news but I hate to be abused\nI know it was a set-up - So now I'm gonna get up\nEven if the FBI wants me to shut up\nBut I've got 10 000 niggas strong\nThey got everybody singin' my \"Fuck Tha Police\" song\nAnd while they treat my group like dirt\nTheir whole fuckin' family is wearin' our T-shirts\nSo I'mma run 'til I can't run no more\n'Cause it's time for MC Ren to settle the score\nI got a urge to kick down doors\nAt my grave like a slave even if the Ren calls\n\n[Verse 5: Dr. Dre]\nClouds are dark and brothers are hidin'\nDick-tricklin' at the sunny mutherfucker's are ridin'\nStarted with five and, yo, one couldn't take it\nSo now there's four 'cause the fifth couldn't make it\nThe number's even - now I'm leavin'\nWe're never gettin' took by a bitch with a weave in\nHer and the troops are right behind me\nBut they're so fuckin' stupid, they'll never find me\n\n[Verse 6: Eazy-E]\nOne more mile to go through the dark streets\nRunnin' like a mutherfucker on my own two feet\nBut you know I never stumble or lag last\nI'm almost home so I better haul ass\nTearin' up everything in sight\nIt's a little crazy mutherfucker dodging the searchlight\nNow that chase, the shit, is done and\nFour mutherfuckers goin' crazy with\nA 100 miles of runnin'!\n\nStop! Stop! Stop! Stop! Surprise, niggas!", "year": "1990-08-14"}, {"artist": "N.W.A", "album": "100 Miles and Runnin' - Single", "title": "100 Miles and Runnin' (Clean)", "lyrics": "[Verse 1: MC Ren]\nA 100 miles and runnin' - MC Ren, I hold the gun and\nYou want me to deal with the situation and it's done in\nSince I'm stereotyped I'm going to take a stand\nAnd if you try to stop me, I don't give a damn\nChances are usually not good\n'Cause I'm frisked with my hands on a hot hood\nAnd gettin' jacked by the you-know-who\nWhen in a black and white the capacity is two\nWe're not alone, we're three more brothers, I mean street-brothers\nNot wearing medallions, 'cause we ain't going out like suckers\nThey're out to take our heads for what we said in the past\nAnd thats the reason why Ren is running fast\nI didn't stutter when I said \"Forget Tha Police\"\n'Cause it's hard for a brother to get peace\nNow it's broken and can't be fixed\n'Cause police and a kid from the ghetto don't mix so\nNow I'm creepin' through the fall\nRunnin' like a team, we'll see, I might have slayed y'all\nSo for now pack the gun and\nHold it in the air 'cause MC Ren has a 100 miles of runnin'\n\n[Interlude]\nInto this news. Four fugitives are on the run\nFBI sources tell us that the four are headed\n100 miles to their homebase, Compton\n\n[Break: Dr. Dre + Eazy-E]\nShut up and lend me an ear\nSo I can tell you why\n\n[Verse 2: Dr. Dre]\nRunnin' with my brothers, headed for the homebase\nWith a steady pace on the face that just we raced\nThe road ahead goes on and on\nIt even seems like its gettin' longer than a marathon\nRunnin' on but never runnin' out\nStayin' wired and if I get tired, I can still try out\nHitchhikin' if that's what it gotta do\nBut nobody's pickin' up a Brother Witta Attitude\nConfused, yo but Dre's never had nothin' to lose\nOne of the few who's been accused and abused\nOf the crime of poisonin' young minds\nBut you don't know nothin' til you been in my shoes\nAnd Dre is back from the C-P-T\nDroppin' some tracks that's D-O-P-E\nSo laid upon the P-O-L-I-C-E!\nAnd anybody else that disagrees\nStuck and runnin' hard, moving fast\n'Cause I been a brother known for havin' a notorious past\nMy mind was slick - my temper was too quick\nNow the FBI's all over my stick\n\n[Verse 3: Eazy-E]\nGot the stick and runnin' just to find the gun that started the clock\nThat's when the E jumped off the startin' block\nA 100 miles from home and, yo, it's a long stretch\nA little sprintin' young brother that they won't catch\nYeah, back to Compton again\nYo, it's either that or the Federal pen\n'Cause brothers been runnin' since beginning of time\nTakin' a minute just to tell you what's on my mind\nRunnin' like I just don't care\nCompton's 50 miles but, yo, I'mma get there\nArchin' my back and on a straight rough\nJust like Carl Lewis I'm ballin' the hell out\nFrom city to city I'm a menace as I pass by\nRippin' up things just so you can remember I'm\nA straight up brother that's done in, gunnin' and comin'\nStraight up homeboy, a 100 miles and runnin'\n\n[Interlude]\nThis one goes out to the four brothers from Compton\nYou're almost there, but the FBI has a little message for you:\nNowhere to run to, baby. Nowhere to hide\nGood luck brothers\n\n[Verse 4: MC Ren]\nRunning for my life I hate to lose\nShow me on the news but I hate to be abused\nI know it was a set-up - so now I'm gonna get up\nEven if the FBI wants me to shut up\nBut I've got 10 000 brothers strong\nAnd as long as I got \"Run fast from the police\" song\nThey treat my group like dirt\nWhile their whole damn family is wearin' our T-shirts\nSo I'mma run til I can't run no more\n'Cause it's time for MC Ren to settle the score\nI got a urge to kick down doors\nAt my grave like a slave even if the Ren calls\n\n[Verse 5: Dr. Dre]\nClouds are dark and brothers are hidin'\nAnd it's funny 'cause all these stupid suckers are riding\nWe started with five and, yo, one couldn't take it\nSo now there's four 'cause the fifth couldn't make it\nThe number's even - now I'm leavin'\nWe're never gettin' took by a woman with a weave in\nHer and the troops are right behind me\nBut they're so stupid, they'll never find me\n\n[Verse 6: Eazy-E]\nOne more mile to go through the dark streets\nRunnin' like a tired brother on my own two feet\nBut you know I never stumble or lag last\nI'm almost home so I better run fast\nTearin' up everything in sight\nIt's a little crazy young brother dodging the searchlight\nNow that chase, is stopped and done and\nFour young brothers goin' crazy with\nA 100 miles of runnin'!\n\nStop! Stop! Stop! Stop!", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "1-900-2-COMPTON (Interlude)", "lyrics": "[Police Officer]\nAlright motherfucka come on!\n\n[Warren G]\nGet yo' motherfuckin' hands off me motherfuckin' police officer\nHey, fuck you!\n\n[Police Officer]\nI ain't bullshiting!\n\n[Warren G]\nMan fuck that shit man, I'm tired of you motherfuckers fuckin wit me!\n\n[Police Officer]\nFuck you up!\n\n[Warren G]\nThat's why y'all always gettin' bust on, motherfucker, shit. Y'all always tweaking man!\n\n[Police Officer]\nJust get in the motherfuckin' cell and shut the fuck up!\n\n[Warren G]\nShit man, I'm tired of you motherfuckers fuckin' with me all the time man, I'm tired of this shit man. I'mma call my bitch, she gonna come get me up out this motherfucker, aye, what you smiling at in the corner nigga? Shut up and pass me a cigarette fool. Man I'm tellin' you my bitch gonna come get me up outta here!\n\n[Phone Ring]\n[The Girl] Hello?\nWarren: Hello\n[The Girl] Leroy?\n\n[Warren G]\nBitch this ain't no motherfuckin' Leroy, aye I'm in motherfuckin' jail, you better come get me up outta here, it's me baby wassup!?\n\n[The girl]\nFirst of all I ain't yo' bitch, Second of all I ain't commin' to get you out of\n\n[Warren G]\nAhh fuck that!\n\n[The Girl]\nMotherfuckin' nowhere, motherfucker!\n\n[Warren G]\nNah Fuck you\n\n[The Girl]\nFuck you!\n\n[Warren G]\nFuck you!\nAye, thi ye, you better come pick me up from this motherfucker, that's all I know. Aye aye what you talkin' bout phone check nigga, you better wait your turn foo. Aye come get me up outta here baby, that's on the real real. Aye, if you don't i'll tell my other bitch to come get me, fuck it, I'll just drop you, fuck it!\n\n[Music/Parliament- Wants To Get Fucked Up]\n\nYo' wassup niggas and niggettes. If you ever have a problem like this don't call that broke ass nigga you got, and don't call that sorry bitch that don't give a fuck about you anyways. What you need to do is call 1-900-2-Compton (well all right!)\n1-900-2-Compton, that's 1-900-2-Compton. This show was sponsored by the niggas that don't give a fuck phone line!", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "3 The Hard Way", "lyrics": "[Intro: The D.O.C. & Fresh K]\nHere's a mix to make you move, smooth enough to soothe\nSlow and lower you can go inside a bassed up groove (So funk it!)\nIt's gotta be, ain't no need to discuss it\n(Yo Doc!) I finna kick this shit, alright! (Alright, then bust it!)\n\n[Verse 1: The D.O.C.]\nRhymes created by the Doc, most definitely down!\nI could be bitten by this brother with some bad ass brown\nIt ain't no joke, he needs some scope\nCause his breath is (cold!) dope\nAs he talks I can smell it, and I'm seeing the smoke\nThat's the bad breath bandit, you know what's in store\nStay away cause they breath will knock you (to the floor!)\nThat boy is (rough!) de soda (tough!) I don't understand\nTests his breath inside his palm, and burned his hand!\nHe's a tucks destroyer, a Listerine killer\nA cavity employer, a yuck-mouth filler\n(Say man, you bullshit!) no, that's a fact Fresh K\nI wish Velamints could take his breath away\nBut he's.. always in effect, smelling like dead vermin\nHonking the bitches with his firewalls burning\nWinch his witch as a curl, just as funky as well\nI mean he has a little woman that can match his smell (Yes!)\nHe has a girlfriend, this is not pretend\nShe uses deodorant that's made for men\n(Scratch and sniff wallpaper all over the house)\nAww shit! (Yeah boy, that's what I'm talking about)\nThey need ten bars of soap, three boxes of Tide\nTo make them presentable to go outside\nNow my story is true, and my opinion candid\nBut that is my tale of the bad breath bandit\n\n[Interlude]\n[The D.O.C] But you know, that ain't even half of the shit\n[Fresh K:-] Man, what's up?\n[The D.O.C] This bitch who stay around the way, you know her K!\n[Fresh K:-] Yeah?\n[The D.O.C] Y'all want to talk about her?\n[Fresh K:-] Bust it!\n[Dr. Rock:] Oh kick her ass, man\n\n[Verse 2: The D.O.C.]\nLet's talk about girl who's a bonafide witch!\nName is Tammy, better known as bitch!\nThe boys in the hood all treat her like liquor\nQuick is the way they pass her around and then stick her\nI'm not saying she minds, she's a first class skeezer\nAlways on the jock, but only if he's uhh..\nMan with the money and the looks to show\n(So you saying she's a witch?) yeah Tammy's a material whore\nYou're getting laid, if you can rock a cross-fader\nYou got the bank, to make the bitch who'll get paid\nTagging Tammy's a process like when you use a computer\nUse her and do her like they did in the old days (Shoot her!)\nA whore and she knows it, yeah the knowledge is there\nSo they say that she's slutty and she tell them she don't care\nBut y'all I'm keeping my clear, even though she is pretty\n(Cause we only use Tammy for a guest to the city) right on!\n\n[Interlude]\n[The D.O.C] But bust this, Tammy ain't the only fucked-up freak in the city\n[Dr. Rock] Well who else, man?\n[The D.O.C] Aww, come on Rock, you know her now, You know her\n[Dr. Rock] Seabiscuit breath, right?\n[The D.O.C] Yeah, that's her\n[Dr. Rock] Yo! Go on! Bust it homes!\n\n[Verse 3: The D.O.C.]\nYou stand around the bitch and your nose turns white\nYou ever thought about what Big Bird's shit smells like?\nWell, you take that aroma, multiply it times two\nAnd you think about Sue (Sour-smelling Sue!)\nShe's a girl that has the power to kill a fresh flower\nRock smelled the whore and said (Damn that bitch is sour!)\nNow, I don't judge, I mean that's not what I'm thinking\nPeople do what they want, and I guess she like stinking\nBut whatever the deal, I think someone should call Guiness\nCause this is kicking a scent that fucks up K's tennis shoes\nAnd a dress, dress it fresh to impress\nShe really ought to be embarrassed because that girl is a mess\nIf you ever see her, you'll duck and cover\nShe looks like your sister but smells like your brother\nAnd since they tell me Trey, honestly phrase:\nI let her know that she reminded me of the Gunsmoke days\nBut it ain't no (thing) if she stink she'll (sing)\nBut to me it's like she needs a little (Irish Spring)\nYou ought to know what I'm saying, I hope I made myself clear\nAbout the three ass whores, but Troll I'm out of here\n\n[Outro: The D.O.C.]\nYo yo yo, these three people make me so sick that I gotta story 1988 on it\nTammy your momma ain't got no legs be talking about\nI ain't gonna stand for this.. Ha ha ha ha!\n\n[Dr. Rock]\nBoy you sick man! You sick man! Yeah yeah\n\n[Fresh K]\nYo man! I got a story from 1988, check it out\nSue, you got so much butter on your teeth\nThat when you brush your teeth you have to use a butter knife!\nHa ha ha ha!\n\n[Dr. Rock]\nGet ready for the king, here I come, now check this out\nSour smelling Sue got so much dirt in her ear\nThat she can grow potatoes, Ha ha ha ha!", "year": "1987-11-06"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "8 Ball", "lyrics": "[Intro - samples]\n(Kick that shit)\n(Cold kicking ass)\nCold kicking ass\nCold kicking ass\n(Funky fresh Eazy-E)\n(Pull up a chair and I'mma tear shit up)\n\n[Verse 1]\nI don't drink brass monkey, like the beat funky\nNickname Eazy-E, yo' 8 ball junkie\nBass drum kicking to show my shit\nRapper holdin' my dick, boy, I don't quit\nAnd if ain't rap, then you know it's crap\nCrowd rocking sucka stomper from around the way\nI got a six-shooter, yo, mean I'm brave\nE rolling out, to find the Boyz\nTo kick dust and cuss, crank up some noise\nPolice on my tail, I d'ont like jail\n40 ounce in my lap and and it's cold as hell\nHook a right turn and let the boys go past\nThen I say to myself, they can kiss my ass\nHip to get drunk got the eight in my lips\nPut in the old tape Marvin Gaye's greatest hits\nTurn the shit up had the bass cold whomping\nCruising through the Eastside, South of Compton\nSee a big ass, and I say word\nI took a look at her face, and the bitch was to the curb\nBut she was on my tip for the title I'm holding\nEazy-E's getting busy got the 8-ball rolling\n\n[Hook]\nI, was...cold kicking ass\nI, was...raised in L.A\nI, was...cruising down the street in my six-four\nToo much posse\n\n[Verse 2]\nRiding on Slausson, looking for Crenshaw\nTurned down the sound, to ditch the law\nStopped at a light and  had a fit\nCause a Mexican almost wrecked my shit\nFlipped his ass off put it to the floor\nBottle was empty so I went to the store\nNigga on tip cause I was drunk\nSee a sissy ass punk, had to go in my trunk\nReached inside cause it's like that\nCame back out with a silver gat\nFired at the punk and it was all because\nI had to show the nigga what time it was\nPulled out the jammy and like a mirage\nA sissy like that got out of Dodge\nSucka on me cause the title I'm holding\nEazy-E's fucked up and got the 8 Ball rolling\nFuck it up, y'all\nFuck it up, y'all\nFuck it up, y'all\nFuck it up, y'all\nFuck it up, y'all\nFuck it up, y'all\nYeah\n\n[Verse 3]\nOlde English 800, because that's my brand\nTake it in a bottle, forty, quart or can\nDrink it like a madman, yes I do\nFuck the police and a 502\nStepped in the party, I was drunk as hell\nThree bitches already said, \" Eric yo' breath smells! \"\n40 ounce in hand that's what I got\nYo man you see Eazy hurlin in the parkin lot\nStepped on your foot cold dissed your hoe\nAsked her to dance and she said, hell no\nCalled her a bitch because that's the rule\nBoyz-n-the hood trying to keep me cool\nTell my homeboy you wanna kick my butt\nI walked in your face and we get em up\nI started dropping the dogs, and watch you fold\nJust dumb full of cum got knocked out cold\n\"Make you look sick you snotty nosed prick!\nNow your fly bitches all over his dick!\"\nPunk got dropped cause the title I'm holding\nEazy-E's fucked up and got the 8 ball rolling\n\n[Verse 4]\nPass the brew Ren while I tear shit up\nAnd y'all listen up close to roll call\nEazy-E's in the place I got money and juice\nRendezvous with me and we make the deuce\nDre makes the beats so funk funk funky\nDo the Olde 8, forget the brass monkey\nIce Cube writes the rhymes, that I say\nHail to the niggas from C.I.A\nKrazy D is down and in effect\nWe make hardcore jams, so fuck respect\nMake a toast all you punk to the title I'm holding\nEazy-E's breaking out and got the 8-ball rolling\nMan I'm outta here\nYo Eazy, you forgot to tell em what city you chill in\nIn the city (city of Compton)\nIn the city (city of Compton)\nCity City City of Compton\nCity City City of Compton\nCity City City of Compton\nCity City City of Compton\nCity City City of Compton", "year": "1987-08-13"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "8 Ball (Remix)", "lyrics": "\"Kick that shit!\"\n{*scratched*} \"City of Compton!\"\n{*scratched*} \"City of Compton!\" {*echoes*}\n\n\"Cold kickin ass\" {*scratch*} \"cold kickin ass\" {*scratch*}\n\"Cold kickin ass\" {*scratch*} \"Kick that shit!\"\n\n\"Pull up a chair...\" {*echoes*}\n\n[Verse One: Eazy-E]\nI don't drink brass monkey, like the beat funky\nNickname Eazy-E, yo' 8 ball junkie\nBass drum kickin', to show my shit\nRappin' holdin' my dick, boy, I don't quit\nCrowd rockin' motherfucker from around the way\nI got a six-shooter, yo' mean hombre'\nRollin' through the hood, to find the boys\nTo kick dust and cuss, crank up some noise\nPolice on my drawers, I have to pause\n40 ounce in my lap and it's freezin' my balls\nI hook a right turn and let the boys go past\nThen I say to myself, \"They can kiss my ass!\"\nHip to get drunk, got the 8 in my lips\nPut in the old tape Marvin Gaye's greatest hits\nTurn the shit up, had the bass cold whompin'\nCruisin' through the Eastside, south of Compton\nSee a big ass, and I say word\nI took a look at the face, and the bitch was to the curb\nHoes on my tip for the title I'm holdin'\nEazy-E's fucked up and got the 8 ball rollin'\n\nI, was.. \"Cold kickin ass\"\nI, was.. \"Raised in L.A.\"\nI, was.. \"Cruisin' down the street in my six-fo'\"\n\"Too, much, posse!\"\n\n[Verse Two: Eazy-E]\nRidin' on Slauson lookin' for Crenshaw\nTurned down the sound, to ditch the law\nStopped at a light and had a fit\n'Cause a Mexican almost wrecked my shit\nFlipped his ass off, put it to the floor\nBottle was empty so I went to the store\nNigga on tilt 'cause I was drunk\nSee a sissy-ass punk, had to go in my trunk\nReached inside 'cause it's like that\nCame back out with a silver gat\nFired at the punk and it was all because\nI had to show the nigga what time it was\nPulled out the jammy and like a mirage\nA sissy like that got out of Dodge\nSucka on me 'cause the title I'm holdin'\nEazy-E's fucked up and got the 8 ball rollin'\n\n\"Fuck it up y'all! Fuck it up y'all! Fuck it up y'all!\"\n\"And we puttin' it on wax\"\n\"Fuck it up y'all! Fuck it up y'all! Fuck it up y'all!\"\n\"YEAH!!!\" *guitar riff*\n\n[Verse Three: Eazy-E]\nOlde English 800 'cause that's my brand\nTake it in a bottle, 40, quart, or can\nDrink it like a madman, yes I do\nFuck the police and a 5-O, too\nStepped in the party, I was drunk as hell\nThree bitches already said, \"Eric yo' breath smells!\"\n40 ounce in hand, that's what I got\n\"Yo man you see Eazy hurling in the parkin lot?\"\nStepped on your foot, cold dissed yo' ho\nAsked her to dance and she said (\"Hell no!\")\nCalled her a bitch 'cause that's the rule\n(\"Bitch, who you callin a bitch?!\")\nBoys in the hood tryin' to keep me cool\nYou tell my homeboy you wanna kick my butt\nI walked in your face and we get 'em up\nI start droppin' the dogs, and watch you fold\nJust dumb, full of cum, got knocked out cold\n\"Made you look sick you snotty-nosed prick!\nNow your fly bitch is all over his dick!\"\nPunk got dropped 'cause the title I'm holdin'\nEazy-E's fucked up and got the 8 ball rollin'\n\n\"Stomp a mudhole in your ass!\"\n\"Stomp a mudhole in your ass, BITCH!\"\n\n[Verse Four: Eazy-E]\nPass the brew motherfucker while I tear shit up\nAnd y'all listen up close to roll call\nEazy-E's in the place, I got money and juice\nRon-De-Vu with me and we make the deuce\nDre makes the beats so goddamn funky\nDo the Olde 8, fuck the brass monkey\nIce Cube writes the rhymes that I say\nHail to the niggas from C.I.A\nKrazy D is down and in effect\nWe make hardcore jams, so fuck respect\nMake a toast punky-punk to the title I'm holdin'\nEazy-E's fucked up and got the 8 ball rollin'\n\n{*scratched*} \"City of Compton!\"\n{*scratched*} \"City of Compton!\" {*echoes*}\n\n{*scratched*} \"City of Compton!\" {*scratched to end*}", "year": "2008-07-25"}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "8 Ball (Remix) (Edited)", "lyrics": "[Intro - samples]\nKick that x5\nCold kicking ow\nKick that\nFunky fresh Eazy-E\nKick that\nCold kicking ow\nPull up a chair and I'ma tear it up\n\n[Verse 1: Eazy-E]\nI don't drink brass monkey, like the beat funky\nNickname Eazy-E, yo 8 ball junkie\nBass drum kicking and a snag I nag\nAnd if ain't rap, then you know it's crap\nCrowd rocking sucker stomper from around the way\nI got a six-shooter, yo, mean hombre\nE rolling out, to find the Boyz\nTo kick dust and cuss, crank up some noise\nPolice on my tail, I don’t like jail\n40 ounce in my lap and it's cold as hell\nHook a right turn and let the dim go up\nThen I say to myself, they can kiss my butt\nHip to get drunk got the eight in my lips\nPut in the old tape Marvin Gaye's greatest hits\nRolling so hard had the bass cold whomping\nCruising through the Eastside, South of Compton\nSee a big butt, and I say word\nI took a look at her face, and the girl was to the curb\nBut she was on my tip for the title I'm holding\nEazy-E's getting busy got the 8 ball rolling\n\n[Hook: Samples]\nI, was...cold kicking ass\nI, was...raised in L.A\nI, was...cruising down the street in my six-four\nToo much posse\n\n[Verse 2: Eazy-E]\nRiding on Slausson, looking for Crenshaw\nTurned down the sound, to ditch the law\nStopped at a light and wouldn't you now\nA Cadillac almost wrecked the six-fo'\nFlipped him off, cruise by the mall\nWent to the store for some Olde 8 ball\nActing real ill cause I was drunk\nSee a sucker punk, had to go in my trunk\nReached inside cause it's like that\nCame back out with a silver gat\nPointed at the fool, and it was all because\nI had to show the boy what time it was\nWhen I turned around it was like a mirage\nKnucklehead like that got out of dodge\nSuckers be illing cause the title I'm holding\nEazy-E's in affect and got the 8 ball rolling\n\n[Verse 3: Eazy-E]\nOlde English 800, cause that's my brand\nTake it in a bottle, forty, quart or can\nDrink it like a madman, yes I do\nForget the police and a 5-0-2\nStepped in the party, I was drunk as hell\nThree girls already said,\" Eric yo' breath smells! \"\n8 ball in hand, that's what I got\n\"Yo man, you see Eazy hurlin' in the parkin' lot?\"\nPunked your lady, stepped on her toe\nAsked her to dance and she said, hell no\nCalled her a skizzy because that's the rule\nBoyz-n-the hood trying to keep me cool\nYou tell my homeboys you wanna kick my butt\nI walked in your face and we get 'em up\nI started dropping the dogs, and watch you fold\nJust dumb stupid bum, got knocked out cold\n\"Made you look sick, you snotty nosed prick\nNow your fly ***** is all over his ****\"\nFool got dropped cause the title I'm holding\nEazy-E's hardcore and got the 8 ball rolling\n\n[Verse 4: Eazy-E]\nYo pass the brew Ren while I tear shit up\nAnd y'all listen up close to roll call\nEazy-E's in the place I got money and juice\nRendezvous with me and we make the deuce\nDre makes the beats so funk funk funky\nDo the Olde 8, forget the brass monkey\nIce Cube writes the rhymes, that I say\nHail to the homies from C.I.A\nKrazy D is down and in effect\nWe make hardcore jams, so give us respect\nMake a toast stupid punk to the title I'm holding\nEazy-E's breaking out and got the 8 ball rolling\n\n[Outro: Eazy, (MC Ren), ]\nMan I'm outta here\n(Yo Eazy, you forgot to tell 'em what city you chill in)\n{​​​In the city (Scratching) City of Compton}​​​\n{​​​In the city (Scratching) City of Compton}​​​\n{​​​City, City, City of Compton (Repeat x5)}​​​", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "A Bitch Iz a Bitch", "lyrics": "[Narrator]\nLet's describe a certain female\nA female with a disease of character and attitude\nIf you will a snob\nHowever in the view of NWA...\n\n[Verse 1: Ice Cube]\nA bitch is a bitch\nSo if I'm poor or rich\nI talk in the exact same pitch\nNow the title bitch don't apply to all women\nBut all women have a little bitch in 'em\nIt's like a disease that plagues their character\nTaking the women of America\nAnd it starts with the letter B\nIt makes a girl like that think she better than me (bitch)\nSee, some get mad and some just bear it\nBut, yo, if the shoe fits wear it\nIt makes 'em go deaf in the ear that's why\nWhen you say 'hi' she won't say 'hi'\nAre you the kind that think you're too damn fly?\nBitch eat shit and die\nIce Cube coming at you at a crazy pitch\n(Why?) I think a bitch is a bitch\n\n[Bitch]\nWho the fuck you think you calling a bitch you little sorry motherfucker\nI don't know who the fuck you think you talking to\nLet me tell you one motherfucking thing, I'm not no-\n\"Bitch, shut the fuck up\"\n\n[Verse 2: Ice Cube]\nYo, you can tell a girl that's out for the money\nShe look good and the bitch walk funny\nShe ain't no dummy, she's rather conniving\nYo bitch, fuck what I'm driving\nSee a young nigga that's striving\nYou're through without a BMW\nThat's why a bitch is a bitch I guess\nOr either P-M-S\nHere, test the girl that's kinda snobby\nAnd I bet you dissing niggas is her hobby\nAnd after she finished the test\nGrade today of B-I-T-C-H\nAnd watch her get mad 'cause she know it's true (she know it)\nBut a nigga like me'll say \"fuck you\"\nDo like Ice Cube, slam her ass in a ditch (word) (slam her ass)\n'Cause a bitch is a bitch\n\n[Bitch/Ice Cube]\n\"Why I gotta be a bitch?\"\nI ain't call you no bitch, if you listen to the goddamn song it'd tell you what a bitch is...\n\"Fuck the song 'cause I'm not no motherfucking bitch\"\nI didn't say you was a bitch, if you stop acting like a goddamn bitch\n\"Fuck you, little punk-ass little nigga\"\nFuck you, bitch! You sloppy-ass, scandalous-ass ho!\n\"Fuck you! Who the fuck you think you are?\"\nFuck you! Suck my dick, bitch! You scandalous-ass, doo-doo dog breath, stinking, ugly...\n\n[Verse 3: Ice Cube]\nI once knew a bitch who got slapped\n'Cause she played me like she was all that\nA bitch can be your best friend talking behind your back (yeah?)\nAbout who's fucking who and who's getting fat\nLook at yourself for me (look, bitch)\nNow do you fall in this category?\nOr you the kind that won't blink\n'Cause you don't think your shit stink\nLucky I haven't had a drink\n'Cause I'd down your ass\nThen I'd clown your ass\n'Cause the niggas I hang with ain't rich\nWe'll all say \"Fuck you bitch!\" (word)\nNow what can I do with a ho like you\nBend your ass over and then I'm through (get the fuck out)\n'Cause you see Ice Cube ain't taking no shit\n(Why?) 'Cause I think a bitch is a bitch\n\n[Narrator]\nThere you have it, the description of a bitch\nNow ask yourself are they talking about you?\nAre you that funky, dirty, money-hungry, scandalous, stuck-up, hair piece contact wearing bitch?\nYep, you probably are\n\nBitch!", "year": "1989-11-13"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Alwayz Into Somethin", "lyrics": "[Intro: MC Ren]\nNinteen-ninety-mothafucking-one\nN.W.A back in this mothafucker, yo\nTakin' out all you commercialized-ass niggas\nAnd we're on this laid back track\nAnd we're doin' this one kinda smooth\nSo whatcha gonna do, Dre? - Kick it!\n\n[Verse 1: Dr. Dre]\nAnd so on, let the shit flow on\nBecause I need somethin' to go off on\nThe mothafuckin' D-R-E servin' a death wish\nSo I'mma hit you like this\nEarly in the morning, hop into the B-en-z\nI got 44 ways of gettin' paid\nSittin' in my lap as I roll off the Compton blocks\nTo scoop up Ren, I heard shots\n1, 2, 3, then I seen a nigga\nHoppin' the fence and it was Ren on the mothafuckin' trigger\nHe got in the Benz and said\n\"Dre, I was speakin' to yo' bitch O'Shea”\nAnd as we roll on, I seen the patroller creep\nSo we got ghost before they peeped\nMe and Ren in a black CE, yo\nBumpin' some funky shit by the D.O.C\nI gotta get paid, paid in a hurry, see\nI got a habit if I'm not paid thoroughly\nI start takin', makin' sure my shit is steady bumpin'\nA nigga always into somethin'\n\n[Interlude: Admiral Dancehall]\nBa-ba-ba-ba! Fuck the mothafuckin' police cause they push that black man down and they kick him in his mothafuckin' balls. Goddamn police, fuck them! Come down, MC Ren\n\n[Verse 2: MC Ren]\nI heard a dope beat, somebody told me that Buck did it\nBut if Dre didn't do it I can't fuck with it\nN.W.A is like a mix a fix a trix\nReal niggas with big dicks\nYou're takin' a chance when you think that\nTalkin' under your breath won't lead to young death\nFuckin' up shit, ain’t shit but a killin'\nFor a nigga labeled as bein' a mothafuckin' villain\nBut you don't know me, a record can't tell ya\nHow so many prayed I'd be a mothafuckin' failure\nReal niggas gotta have top rankin'\nI hooked up with three more niggas and started makin'\nFunky-ass shit for your system\nMight sound nice so it makes you wanna listen to a\nSample of a ruthless organization\nBut you don't want a confrontation\nReal niggas don't play\nYella, Eazy, me, and the nigga nigga Dre\nYo, always makin' sure that my shit is steady bumpin'\nA nigga always into somethin'\n\n[Interlude: Admiral Dancehall]\nBoom-boom! Look at that bitch walking down the mothafuckin' street\nNow she know the Admiral wanna hold my dick in\nBecause that bitch’s booty is so na-na-na-na-na-na-nasty\n\n[Bridge: Dr. Dre]\nYeah, the world's most dangerous group\nDefinitely in this mothafucka\nSendin' a shout-out to all the bitches out there\nYo, you can get the pick up to suck a dick up 'til you hiccup\nYou know what I'm sayin'\n\n[Verse 3: Dr. Dre]\nYo, cause I'm a nigga for life\nAnd I really don't give a fuck\nI'm goin' for mine, every time\nI see a fuckin' softy, punk strong as coffee\nA nigga like that best to back up off me\nYo, cause these are the days and the times of the real niggas\nFalse niggas, end up as tossed niggas\nAnd that's on the real, cause I'm a nigga that kills\nAgain and again, so tell 'em what's up Ren\n\n[Verse 4: MC Ren]\nIf I'm not into nothin', I don't feel right\nSo I grab the nine and the clip and go and murder mothafuckas at night\nBecause I'm startin' to fiend, from sittin' in a cell\nWhere the crime was too tragic I couldn't make bail\nSo now they gotta hold me\nAnd listen to rehabilitation over and over, sayin' they told me\nBut I don't give a fuck cuz I know my shit is pumpin'\nA nigga always into somethin'\n\n[Outro: Admiral Dancehall]\n1991 and N.W.A get the job done\nAdmiral Dancehall gonna tell a story 'bout a girl that's quick fi lick me dick, it goes something like this....\nDa girl quick fi lickin' me dick, da girl quick fi lickin' me dick\nDa girl quick fi lickin' me dick, she got a dirty habit\nDi gyal fi wicked ah wiley\nGyal fi wicked ah wiley\nWicked ah wicked ah wicked\nAh gyal fi wicked ah wicked\nBecause the Admiral Dance\nI come and announce\nMy name is Admiral D. y’all\nRastafari had to get up on sound ja\nDoctor Dre, a he mon tha masta\nMC Ren even him come kinda fasta\nHere come Yella wit tha wickedy wickedy wax\nWickedy wickedy wax\nW-wickedy wickedy scratch-a\nThat’s why the Admiral\nMe lyrics dem ah taught\nEveryone-a\nNWA is in tha house\nIs in tha house\nIs in tha house-a\nA listen up cu' we in tha house\nCould ya\nUp up\nListen up up\nUh, up up\nJust listen up up\nBecause…\nRem? Dance every lady love me\nCould ya, every lady come and-a run gets me\nBecause me singin' on the NWA album\nThat’s why me singin' up on the NWA album, gal", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "Alwayz Into Somethin' [Edited]", "lyrics": "[Intro: MC Ren]\nThe year is 1991, N.W.A back on the streets yo\nTaking out all you commercialized suckers\nAnd we're on this laid back track\nAnd we're doin' this one kinda smooth\nSo whatcha gonna do, Dre? - Kick it!\n\n[Verse 1: Dr. Dre]\nAnd so on, let the beat flow on\nBecause I need something to go off on\nThe one and only D-R-E servin' a death wish\nSo I'mma hit you like this\nEarly in the morning, hop into the B-en-z\nI got 44 ways of getting paid\nSitting in my lap as I roll off the Compton blocks\nTo scoop up Ren, I heard shots\n1-2-3, then I seen Ren\nHopping the fence and with the .45 inside his hand\nHe ran to the Benz, got in and said\n\"Dre, I was speaking to your girl O'Shea\"\nAnd as we roll on, I seen the patroller creep\nSo we got ghost before they peeped\nMe and Ren in a black CE, yo\nBumping some funky tracks by the D.O.C\nI gotta get paid, paid in a hurry, see\nI got a habit if I'm not paid thoroughly\nI start takin', makin' sure the money is steady coming\nBecause I'm always into something\n\n[Interlude: Admiral Dancehall]\n\n[Verse 2: MC Ren]\nI heard a dope beat, somebody told me to go through it\nBut if Dre didn't do it I can't flow to it\nN.W.A is like a mix of hard time and hard rhymes\nIn the same lines\nYou're taking a chance when you think that\nTalking under your breath won't lead to young death\nTaking a life, ain’t nothing but a killing\nFor a brother labeled as being a young black villain\nBut you don't know me, a record can't tell ya\nHow so many prayed that I be just another failure\nReal G's ain't about faking but taking\nI hooked up with N.W.A and started making\nFunky hyped lyrics for your system\nMight sound nice so it makes you wanna listen to a\nSample of a ruthless organization\nBut you don't want a confrontation\nReal G's don't play\nYella, Eazy, me and my homeboy Dre\nYo, always making sure that my beats is steady bumping\nBecause I'm always into something\n\n[Interlude: Admiral Dancehall]\n\n[Verse 3: Dr. Dre]\nYo, because I'm in it for life\nAnd in the beginning I was stacking\nNow everyone wanna jack-in\nWatching a softy, punk strong as coffee\nA brother like that best to back up off me\nYo, cause these are the days and the times of the real G\nYou cross me, you getting tossed see\nAnd that's on the real, cause I'm know to get ill\nAgain and again, so tell them what's up Ren\n\n[Verse 4: MC Ren]\nIf I'm not into nothing, I don't feel right\nSo I get my boys and we roll yo, and start some wrecking at night\nBecause I can never conceive myself from sittin' in a cell\nWhere the crime was too tragic I couldn't make bail\nSo now they gotta hold me\nAnd listen to rehabilitation over and over, sayin' they told me\nBut I don't really care, cause I know my music is bumping\nNow Ren is always into something", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Appetite for Destruction", "lyrics": "[Verse 1: Dr. Dre]\nI got a taste for waste and a taste and a blood\nMurder I heard her when she screamed the \"Drop!\"\n'Cause her son caught the slug\nRelate this to no choice\nAnd listen to this straight-up man before they ban the voice\nWhile I rhyme to the rhythm of a pop\nRemember the first nigga that runs is the first to get shot\nWhoever said that what I say and portray is negativity\nNeed to come kick it in the city with me\nAnd find the black and crack de fact\nAnd take that shit back\n'Cause they don't wanna fuck with that\nThere's too many niggas they're tryin' to calm\nIf mothafuckaz could get it, nobody would've fuck with it\nAppetite for destruction\nFor him to get a bit more shit he gotta commit\nMurder in the first degree and manslaughter\nTakin' the life of his wife and young daughter\nA whole city of bitches that look sucked up\nAnd the niggas is killin', it's straight fucked up\nWhoever sayin' what I'm sayin is for greed\nThen I ain't even what they're tryin' to feed\nMy appetite for destruction\n\n\"You guys know who I'm talkin' to\"\n\n[Verse 2: MC Ren]\nThe appetite is tremendous, so I'm gonna spin this\nDrop up some violence because they ask me to end this\nSome trouble that I cought 'cause I was noisy\nA nigga tried to take advantage because of the kamikaze\nHe took a swing for my head, thought I was faded\nStart runnin' for the door but the fucker never made it\nThe sound of the 9 went bang\nAnd all over the wall was his mothafuckin' brain\n'Cause I'm a nigga you can't sleep on\nSo set the alarm, 'cause I hit like a mothafuckin' bomb\nI do damage with the 9 in my hand\nBut the average nigga that don’t know me don’t understand\nI'm from the streets, so therefore\nYou know I don't care for a sucker that ain't down\nWith the real niggas, the niggas, the niggas\nYo, and after when the shit gotta go ain't even sober\nAny time that the 9 wanna leave\nI got a .38 hidden up the sleeve\nAnd it's ready to go to war 'cause that's what it's here for\nI shoot down a million niggas and shoot one more\nAnd that's the million and one, they couldn't hang with the appetite, 'cause they wasn't rappin' right\nSo I had to destroy whoever was standin' in my presence\nFor fuckin' up the essence – appetite for destruction\n\n[Interlude]\n\"Cops put a hurtin' on yo' ass, man\nYou know, they really degrade you\nWhite folks don't believe that shit\nThey don't believe that cops degrade you\n[Imitating white person] Oh come on, those people, those people are resisting arrest.\"\n\n[Verse 3: Eazy-E]\nCheck it out, y'all, in the house, y'all\nSo I can show and flow and let the people know\nSo won't you ease on down to the yellow brick road\nTo Compton, but first let me tell you somethin'\nI possess the 10 commandments of the hip-hop thugsta\nKnown as the thief and murderer\nFirst one – honor thy nigga with an attitude\nGotta get respect or break your mothafuckin' neck\nSecond one – always gotta fuck out of wedlock\nI like it when the pussy goes snap, crackle and pop\nNumber three – I'm a gangsta fanatic\nI smoke any fools tryna 'cause some static\nNumber four – here's what's in store\nA crazy-ass nigga that remains hardcore\nFifth one – my kill has just begun\nI pull out my gun, that'll keep me on the run\nStep six – hmmm, it's kinda tricky\nCan't forget that I'm mothafuckin' chicken-shit\nTo the ones who tries to play the E\nBy the time you get to seven, you'll be six feet deep\nNumber eight – make no mistake\nMove real sneaky and you're bound to catch your prey\nNinth one – I gotta be raw\nFuck any brainwashin' man-made law!\nLast but not least, I must be real\nNumber ten – is my appetite to ki–", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Approach to Danger", "lyrics": "[Intro: Eazy-E]\nWhat you want, is an unexpected approach\nThat may delay a suspect's awareness, of your presence\nUntil you have a chance to assess\nThe situation, you are confronted\nApproach to danger... don't move\n(It's hard to predict what would happen next)\n(Oh shit, he has a gun!) Drop the gun\nYou could've prevented a tragedy\n\n[Verse 1: MC Ren]\nYou can approach, but the danger light is blinkin\nA self-desctruct button is activated when I'm thinkin\nThis is a tribulation, the weak is judged\nThe prophecy was fulfilled, cause I never budge\nI took up the tools, crucifixion was the extreme\nThey're seein doubles of me, but it wasn't a dream\nOne vision was of life, the other was death\nAnd life didn't give a fuck if death took your last breath\nSo you burn in my pit that I call hell\nWhere you got sent, because your shit don't sell\nMy twenty-twenty was blurry from the smoke\nOf the niggas that I burned and tormented but I didn't choke\nI started doing them, I kept on doing them, two of them\nShoot them up until that nigga Ren was through with them\nAnd my presence to the suckers was of a stranger\nBut fuck it, they can approach to the danger\n\n[Interlude: Eazy-E]\nIf you can be seen, you can be hit\nIf you can be hit, you can be killed\n(He's over there! Shoot him!)\n\n[Verse 2: Dr. Dre]\nFatal approach to danger, just to remain a strangler\nOut run, the shot of a gun when the game's up\nMurder in the first degree, but it's worse to be\nA dead motherfucker or a nigga in custody\nWith everybody thinkin of death\nI kept workin, to be one of the last niggas left\nSo many people lookin for hope, they broke\nWithout checkin the fingerprints on a motherfucker's throat\nA heart of steel can reveal the real nigga in me\nSo figure to see, the D-E-A-D\nBodies like a nigga straight walkin in a cemetary\nSo it's very necessary to carry\nAmmunition for niggas wishin but they better take caution\nBefore Dre goes off\nAnd starts killin motherfuckers just in order to change the\nAnger for the real nigga when I approach to danger\n\n[Interlude]\nApproach the motherfuckin danger\n(\"Come back to hell and see me some time!\")\n(\"This is it y'all\")\n\n[Verse 3: Eazy-E]\nFinal approach to danger, death, destruction around every corner\nAnother dead body and you wanna keep runnin\nBut even the rain turns black\nAll you can do is stay alert and try to stay out of the searchlight\nNo prison, nobody makes bail\nEverybody gotta go but see it ain't no jail\nThink about death, takin your last breath\nHeart beatin like a motherfucker like it ain't no time left\nWith so many ways to stay up, I gotta get mine\nEven though they wanna make a crime, yo\nOf bein real, a federal letter in the beginnin\nBecause of the release of \"Fuck the Police\"\nFuck it I approach the danger\nCause I don't give a fuck if somebody gotta get fucked up\nSo you might as well kiss your ass goodbye\nCause in the long run (\"we all die\")", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "Approach to Danger [Edited]", "lyrics": "What you want is an unexpected approach\nThat may delay a suspect's awareness of your presence\nUntil you have a chance to assess\nThe situation you are confronted\nApproach to danger, don't move\nIt's hard to predict what would happen next\nOh s***, he has a gun, drop the gun\nYou could've prevented a tragedy\nYou can approach but the danger light is blinkin'\nA self-destruct button is activated when I'm thinkin'\nThis is a tribulation, the weak is judged\nThe prophecy was fulfilled 'cause I never budge\nI took up the tools, crucifixion was the extreme\nThey're seein' doubles of me, but it wasn't a dream\nOne vision was of life, the other was death\nAnd life didn't give a *** if death took your last breath\nSo you burn in my pit that I call 'Hell'\nWhere you got sent because your *** don't sell\nMy 20/20 was blurry from the smoke\nOf the *** that I burned and tormented but I didn't choke\nI started doin' 'em, I kept on doin' 'em\nTwo of 'em, shoot 'em up 'til that *** Ren was through with 'em\nAnd my presence to the suckers was of a stranger\nBut *** it, they can approach to the danger\nIf you can be seen, you can be hit\nIf you can be hit, you can be killed\nHe's on the line, shoot him\nFatal approach to danger, just to remain a strangler\nOut run the shot of a gun when the game's up\nMurder in the first degree but it's worse to be\nA dead motherf*** or a *** in custody\nWith everybody thinkin' of death\nI kept workin' to be one of the last n*** left\nSo many people lookin' for hope, they broke\nWithout checkin' the fingerprints on a motherf*** throat\nA heart of steel can reveal the real *** in me\nSo figure to see the D E A D\nBodies like a *** straight walkin' in a cemetery\nSo it's very necessary to carry\nAmmunition for *** wishin' but they better take caution\nBefore Dre goes off\nAnd starts killin' motherf*** just in order to change the\nAnger for the real *** when I approach to danger\nApproach the motherf*** danger\nCome back to hell and see me some time\nThis is it, y'all\nFinal approach to danger, death, destruction around every corner\nAnother dead body and you wanna keep runnin'\nBut even the day turns black\nAll you can do is stay alert and try to stay out of the searchlight\nNo prison, nobody makes bail\nEverybody gotta go but see it ain't no jail\nThink about death, takin' your last breath\nHeart beatin' like a motherf***, like it ain't no time left\nWith so many ways to stay up, I gotta get mine\nEven though they wanna make a crime, yo\nOf bein' real, a federal letter in the beginnin'\nBecause of the release of 'F*** Tha Police'\n*** it I approach the danger\n'Cause I don't give a *** if somebody gotta get *** up\nSo you might as well kiss your ass goodbye\n'Cause in the long run, we all die", "year": null}, {"artist": "N.W.A", "album": null, "title": "Arrested", "lyrics": "Police:Ok niggas you got one call\n\nEasy-E:ain't that a bitch you fat mother f**ker let me call my home boy and get\nUs out 7,3,9,6,6 god damn i hope this nigga at home.Hello EZE:hey whats up\nMan?Whats up homie? EZE:aww man this mother f**kers got us down here in this\nGod damn jail man.Man: No Shit.EZE:Hell yeah man we was like rollin and shit we\nWas lookin for some bitches so we pulled up on like 4 fine hoes and you know i\nKnow i didn't know the mother f**kin bitches was prostotutes man and they was\nPolice ain't that a bitch.Man: Hey man where was you'll at?EZE:Man we was on\nHollywood, in da Hollywood man lookin at some bitches, bitches was bad then a\nMother f**ker man, man dont tell my woman man cause i dont want her to know\nWhat the f**ks goin on you know and f**k up for me man cause you know you know\nAll the pussy i get anyway.Man:Yeah word man.Man:Who was you wit man?EZE:Man i\nWas wit Yellow,Ren,Dre you know man.Man:man all them nigga wit you.EZE:Yeah you\nKnow.Man:man ain't that a bitch.EZE:Niggas trin to get they thing wet you know\nWhat i'm sayin.Man:Yeah.EZE:Man f**k it I'll just let you talk to Ren he can\nTell you a little bit better then i can shit hold on.....", "year": null}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Arrested (Insert)", "lyrics": "(*Cell Block Opened*)\n\n[Intro: DJ Yella as a Security Guard]\nOKEY NIGGAZ, YOU GOT ONE CALL!!\n\n[Eazy-E]\nAin't that a bitch? - you fat motherfucker\nLet me call my home boy to get us out\n7-3-2-9-6-3 Goddamn, nigga at home\n(*Landline phone beep*) (*Phone picked up*)\n\n[Laylaw] Hello!\n[Eazy-E] Aiy, what's up, man?\n[Laylaw] What's up, homie?\n[Eazy-E] Aww man, these motherfuckers got us down in this goddman jail, man\n[Laylaw] NO SHIT!!\n\n[Eazy-E]\nHell yeah, we were like, rolling and shit, man\nWe was looking for some bitches\nSo they pulled up on like four fine whores, man\nAnd you know, I didn't know the motherfucking bitches were prostitutes, man\nAnd they just caught me, ain't that a bitch?\n\n[Laylaw] Nigga, where was y'all at?\n\n[Eazy-E]\nWe was in Hollywood, we're in Hollywood, man\nLooking out for some bitches, bitches was bad than a motherfucker\nMan, don't tell my woman that, man\nCause I wanna know what the fuck is going on, you know, I'm fucked up, man\nFor me, I ain't supposed to be riding with my bitches\nYou know, pussies that I had..\n\n[Laylaw] Yeah word, whose you with, man?\n[Eazy-E] I'm here with Yella, Ren, Dre, you know, man..\n[Laylaw] Aww man, all them niggas with you?\n[Eazy-E] Yeah.. nig..\n[Laylaw] Aww man, no thing?\n[Eazy-E] Niggas are trying to get that thing, man, you know what I'm saying?\n[Laylaw] Yeah\n\n[Eazy-E]\nAnd fuck it, I'ma just let you talk to Ren, man\nHe can tell you a little better than I can and shit\n\n[Laylaw] Alright\n[Eazy-E] Hold on!!", "year": "1996-07-02"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Automobile", "lyrics": "[Intro: Eazy-E]\nYo Dre man, I take this bitch out to the movies and shit\nMan we're kissin' and grindin' and shit\nSo we hop in the back seat\nYou know man, this bitch rubbin' all over my dick\nAnd frontin' like she's gonna give me the pussy, man\nAnd the bitch said 3 words, man: \"Stop\", \"No\", and \"Don't\"\nI said biiiiiitch\n\n[Verse 1: Eazy-E]\nYou don't have to front on me dear\nSo why don't you just give that pussy here?\nIf you'd be good to me\nOhh I'll be good to you\nAnd we'll both ride home in my automobile\n\n[Verse 2: Dr. Dre]\nAll that I want is a little puss'\nAll that I want is just a little head\nIf you'd be good to me\nOhh I'll be good to you\nAnd we'll both ride home in my automobile\n\n[Verse 3: Eazy-E]\nYou don't have to front on me bitch\nDon't be afraid - it's only a dick\nGive up the pussy soon\nAll I want is a little womb\nOr get your groupie ass out my hotel room\nOr get your groupie ass out my hotel room\n\n[Verse 4: Dr. Dre]\nAll I want is the pussy\nAll I want is the pussy\nAll I want is the pussy\nAll I want is the pussy\nIf you'd be good to me\nOhh I'll be good to you\nAnd we'll both ride home in my automobile\nWe'll both ride home in my automobile", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "Blax", "lyrics": "i like blax", "year": null}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Bonus Beats", "lyrics": "[Instrumental Beats Only]", "year": "1989-03-27"}, {"artist": "N.W.A", "album": null, "title": "Boyz-N-The-Hood (remix)", "lyrics": "Cruisin' down the street in my 6-4\nJockin' the bitches, slappin' the hoes\nWent to the park to get the scoop\nKnuckleheads out there cold shootin' some hoops\nA car pulls up, who can it be?\nA fresh El Camino rollin' Kilo G\nHe rolls down his window and he started to say\nIt's all about makin' that GTA\n'Coz the boyz-n-the-hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy 'coz I ain't sayin' shit\n[Beats]\nDonald B in the place to give me the pace\nHe said, My man JD is on freebase\nThe boy JD was a friend of mine\n'Til I caught him in my car tryin' to steal my Alpine\nChased him up the street to call a truce\nThe silly cluck head pulls out a deuce-deuce\nLittle did he know I had a loaded 12 gauge\nOne sucker dead, L.A. Times, front page\n'Coz the boyz-n-the-hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy 'coz I ain't sayin' shit\nBored as hell and I wanna get ill\nSo I went to a place where my homeboys chill\nThe fellows out there, makin' that dollar\nI pulled up in my 6-4 Impala\nThey greet me with a 40 and I started drinkin'\nAnd from the 8-ball, my breath start stinkin'\nLove to get my girl, to rock that body\nBefore I left, I hit the Bacardi\nWent to her house to get her out of the pad\nDumb h*** says somethin' that made me mad\nShe said somethin' that I couldn't believe\nSo I grabbed the stupid *** by her nappy ass weave\nShe started talkin *** wouldn't you know?\nReached back like a pimp and slapped the h***\nHer father jumped out and he started to shout\nSo I threw a right-cross, cold knocked him out\n'Coz the boyz-n-the-hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy 'coz I ain't sayin' ***\nI'm rollin' hard now, I'm under control\nThen wrapped my 6-4 'round the telephone poll\nI looked at my car and I said, \"Oh brother\nI throw it in the gutter and go buy another\nWalkin' home, I see the G ride\nNow Kat is drivin', Kilo on the side\nAs they busted a u, they got pulled over\nAn undercover cop in a dark green Nova\nKat got beaten for resistin' arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doin' the crime\nFourth offense on the boy, he'll do some time\n'Coz the boyz-n-the-hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy 'coz I ain't sayin' ***\nI went to get them out but there was no bail\nThe fellaz start to riot in the County Jail\nTwo days later in Municipal Court\nKilo G on trial, cold cut a fart\nDisruption of a court said the judge\nOn a six-year sentence, my man didn't budge\nBailiff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out fire, then came Suzy\nThe *** came in with a sub-machine Uzi\nPolice shot the girl but didn't hurt her\nBoth up state for attempted murder\n'Coz the boyz-n-the-hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy 'coz I ain't sayin' ***", "year": null}, {"artist": "N.W.A", "album": null, "title": "Break Out (Insert)", "lyrics": "Yo, What's happening, what's happening\nDiz iz Dr. Dre from the worlds most dangerous group\nHold up man let me talk to Yella\nYella come hear man\nYeah man eh eh Mark\nMan you should get out of thiz motherf**ker\nI'm gonna work on that right now!\nF**k that today motherf**ker\nBla bla\nAight I'm out of this G", "year": null}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Cash Money (Insert)", "lyrics": "[Dr. Dre]\nYou know what I'm saying you know what I'm saying\nAll you people listening thank you for all your money\nHahahah we really appreciate it, its going to a very useful cause\nThe help Dre get a brand new Testorossa Ferrari Fund. Hahahaha", "year": "1996-01-01"}, {"artist": "N.W.A", "album": "The Best Of N.W.A: The Strength Of Street Knowledge", "title": "Chin Check", "lyrics": "[Ice Cube]\nWhat the fuck's up, Dre?\n\n[Dr. Dre]\nYou tell me, you talk to Ren\n\n[MC Ren]\nI'm right here nigga\nRelease the hound\n\n[Snoop Dogg]\nBow wow wow\n\n[Verse 1: Ice Cube]\nI'm a nigga wit an attitude thanks to y'all\nAnd I don't give a fuck I keep it gangsta y'all\nI'mma ride for my side in the C.P.T\nGod bless the memory of Eazy-E\nIf it wasn't for me where the fuck you'd be\nRapping like the Treacherous Three, fucking cowards\nI'd have seen Dre rocking parties for hours\nAnd I'd have seen Ren fucking bitches from Howard\nAnd I'd have seen Snoop give away Eddie Bauer's\nSo fuck Jerry Heller and the white superpowers\n\n[Verse 2: MC Ren]\nThis the shit niggas kill for\nThey hear the villain niggas spitting with them nigga flows\nFuck you hoes, fuck you bitch-ass niggas too\nGot something for you broke\nThese niggas wearing skirts like the pope\nWho them niggas that you love to get\nWho them niggas that you fuckin' with\nLove to yell to yell that we the shit\nThe saga continues with the world's most dangerous group\nFour deep in the coup\n\n[Refrain]\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\n\n[Verse 2: Dr. Dre]\nA pencil, a pen, or a Glock\nI'm the original, subliminal, subterranean\nTitanium, criminal minded, swift\nD-R-E with that fuck a bitch shit\nA couple of notes and get you hog-tied in rope\nDope like tons of coke, cut-throat\nYou don't want the pistols to whistle\nCandy paint Impala\nI make hoes pop collars\n\n[Verse 4: Snoop Dogg]\nGod damn hoes, here we go again\nFucking with Ren, playing to win\nHe got the Coke and Hen - I got the juice and gin\nSame shit you was fucking with way back then\nWe keep it cracking from the acting to the jacking\nG'ed up C'ed up motherfucker blaze the weed up\nWe all on deck fool so put your heat up\nI stay on deck so me don't get wet\n\n[Ice Cube]\nLook my nigga, we can scatter like buckshots\nLet's get together, make a record, why the fuck not\n\n[MC Ren]\nWhy the fuck not\n\n[Dr. Dre]\nWhy the fuck not\n\n[Snoop Dogg]\nWhy the fuck not\n\n[Ice Cube]\nCause I'm tight as the night\nI had to wipe activator off the mic, in 1985\n\n[Snoop Dogg]\nReal niggas, biatch, you know, ha hah\n\n[Ice Cube]\nWe cause tragedy, erratically\nSystematically in your house without a key\nHow fucked up that'd be\nGat'll be near your anatomy, my form of flattery\n\n[Dr. Dre]\nAssault and battery, cause we coming with that street mentality\nStraight west coast rider academy\nConcrete nigga, that's my reality\n\n[Snoop Dogg]\nWe tend to bust on niggas that get mad at me\n\n[Dr. Dre]\nWas it a bitch in the mix\n\n[Snoop Dogg]\nWell it had to be\n\n[Dr. Dre]\nLying tricks told them dicks I had a key\nHoes make the world harder than it have to be\n\n[Refrain]\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma muthafuckin nigga til I diz-ie", "year": "1999-08-23"}, {"artist": "N.W.A", "album": null, "title": "Chin Check (Extended Version)", "lyrics": "[911 dispatch] 911, what are you reporting\n[Woman] hello 911, help me, help me\n[911 dispatch] what is your emergency\n[Woman] there's someone in my house, there's some men in my house\n[911 dispatch] can you please verify your address for me\n[Woman] 151 Shenedoah, Shenendoah\n[911 dispatch] ma'am where inside the house are you\n[Woman] (oh my god)\n[911 dispatch] ma'am where inside the house are you\n[Woman] in my room, they're in my room\n[911 dispatch] ma'am calm down, deputies are on the way\nIs the door locked\n[Woman] (shriek)\n(Shotgun shell chambered, followed by gunshot)\n[911 dispatch] ma'am?\n\n[2x] N N, dup dup, dup double u, a a, a a\n\n[Ice Cube]\n(N N, dup dup, dup double u, a a, a a) What the fuck's up Dre\n[Dr Dre]\nYou tell me, you talk to Ren\n[MC Ren]\nIm right here nigga\n(N N, dup dup, dup double u, a a, a a) Release the hound\n[Snoop Dogg]\nBow wow wow\nWha wha wha what what what, what\n\n[Ice Cube]\nI'm a Nigga Wit an Attitude thanks to y'all\nAnd I don't give a fuck I keep it gangsta y'all\nI'mma ride for my side in the C.P.T\nGod bless the memory of Eazy-E\nIf it wadn't for me where the fuck you'd be?\nRappin like the Treacherous Three, fuckin cowards\nI'd have seen Dre rockin parties for hours\nAnd I'd have seen Ren fuckin bitches from Howard\nAnd I'd have seen Snoop give away Eddie Bauer's\nSo fuck Jerry Heller and the white superpowers\n\n[MC Ren]\nThis the shit niggas kill for\nThey hear the Villain niggas spittin' with them nigga flows\nFuck you hoes, fuck you bitch ass niggas too\nGot something for your throat\nThese niggas wearin' skirts like the pope\nWho them niggas that you love to get (us)\nWho them niggas that you fuckin' wit' (us)\nThey be screaming we the shit (what)\nThe saga continues, with the worlds most dangerous group\nFour deep in the coupé\n(It's the Villain)\n\n[Hook]\nI'mma smoke where I wanna smoke (fuck that)\nI'mma choke who I wanna choke (fuck that)\nI'mma ride where I wanna ride (fuck that)\nCause I'mma nigga 4 life, so I'mma nigga til I diz-ie\n(N N, dup dup, dup double u, a a, a a)\nI'mma smoke where I wanna smoke (fuck that)\nI'mma choke who I wanna choke (fuck that)\n(N N, dup dup, dup double u, a a, a a)\nI'mma ride where I wanna ride (fuck that)\nCause I'mma nigga 4 life, so I'mma motherfuckin nigga til I diz-ie\n\n[Dr Dre]\nA pencil, a pen, or a Glock\nIm the original, subliminal, subterranium\nTitianium, criminal minded, swift\nD-R-E with that fuck a bitch shit (fuck a biatch)\nA couple o' notes and get you hog-tied in rope\nDope like tons of coke, cutthroat\nYou don't want the pistols to whistle\nCandy paint Impala\nI make hoes pop collars\n\n[Snoop Dogg]\nGod damn hoes, here we go again\nFuckin with Ren, playin' to win\n(he got the) coke in hand, (I got the) juice and gin\nSame shit you was fuckin wit way back then\nWe keep it crackin' from the actin to the jackin\nG'ed up C'ed up motherfucker blaze the weed up\nWe all on deck fool so put your heat up\nI stay on deck so me don't get wet\n\n[Ice Cube]\nLook my nigga, we can scatter like buckshots\nLet's get together, make a record, why the fuck not?\n[MC Ren] Why the fuck not?\n[Dr Dre] Why the fuck not?\n[Snoop Dogg] Why the fuck not?\n[Ice Cube] Cause I'm tight as the night\nI had to wipe activator off the mic, in 1985\n\n[Snoop Dogg]\n(N N, dup dup, dup double u, a a, a a)\nReal niggas, biatch, you know, ha hah\n\n[Ice Cube]\nWe cause tragedy, erratically\nSystematically, in your house without a key\nHow fucked up that'd be\nGat'll be near your anatomy, my form of flattery\n\n[Dr Dre]\nAssault and battery, cus we coming with that street mentality\nStraight west coast rider academy\nConcrete nigga, that's my reality\n[Snoop Dogg] We tend to bus' on niggas that get mad at me\n[Dr Dre] Was it a bitch in the mix\n[Snoop Dogg] Well it had to be\n\n[Dr Dre]\nLying tricks told them dicks I had a key\nHoes make the world harder than it have to be\n(Yea thats right)\n\n[Hook]", "year": null}, {"artist": "N.W.A", "album": null, "title": "Compton's n the house - live;", "lyrics": "Ah yeah, right about now Compton's in de mothafuckin' house [yeah do it do it]\nNWA's in full effect\nHey yo yella boy, kick me that funky-ass beat\nYeah, who's in de mothafuckin' house?\nCompton's in the mothafuckin' house!\nYeah, Compton's definetly in the house\nHey yo Ren, what we're gonna do?\n\n[MC Ren]\n\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people\nPeople From everywhere watching the show\nPaying top dolars because they know\nWhen we're on the stage, we're in a mothafuckin' range\nSo Dre, why don't you get the 12 guage [yeah]\nAnd show 'em how Eazy-Duz-It\nSo if you punks wanna make somethin' of it\nStep up, run up, get up, what's up sucker\nYou want some of this?\nThen you're a stupid mothafucka!\nKickin' - like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin' - a beat that's hittin'\nAnd if you listen then you know we're not bullshittin'\nDope - like a pound or a key\nSo shut de fuck up and listen to me\nI make a killin\nI got money to the ceiling [why's that?]\n'cause I'm a mothafuckin' ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Dr. Dre]\n\nNow my name iz Dre - de mothafuckin' doctor\nRippin' shit up [oh yeah] and here to rock ya\nWith some help from my homeboy E\nThe criminal of the ruthless posse\nFuckin' it up [word up] iz what we do\nThe reputation of the NWA crew\nGettin' busy because we're cold stampin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\n\nSpeakin' of Compton, it's makin' me sick [why?]\nEverybody'z talkin' that crazy shit\nSayin' they were raised in the CPT [aha]\nJust as I was, they try to be like me\nPoppin' that shit, get the fuck out my face\nKnowin' that they never even seen the place\nClaimin' my city is my city they claim\nMothafuckaz we're about to put some salt in your game ..\n\nYeah I'm tired of these mothafuckerz runnin' around town, talkin' about\nThey're from Compton and shit, tryin' to get on the bandwagon ..\nYeah Dre, I know what you're sayin' man, but let's tell 'em who we're\nTalkin' about ..\n\nWHAT DO YOU CALL A CREW THAT CAN RAP LIKE THAT ...?\nYo NWA call 'em mothafuckaz wack..\n[yeah you know what time it iz, listen to why we call 'em wack]\n\nThey got a wacky wack record wit a wacky wack crew\nYo what about the lyrics?\nThat shit's wacky wack too\nWith a fucked up style and a fucked up show\nHey yo Ren, what about the scratchin', is it def?\nFuck no!\n\nThe mothafuckin' record is so mothafuckin' wack\nThe mothafuckin' cracka jack needs to step the fuck back ...\n\nDo you want some of this?\nHell no ..\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy .. my boy .. my boy Ice Cube\nYo we got my homeboy Eazy E in de house\nWon't you tell 'em what your name iz?\n\n[MC Ren]\n\nMC Ren is the mothafuckin' Coroner\nI'm gettin' rid of mothafuckaz as if they was a foreigner\nShow no greed to pretend when I sin\nI punch you can block it but I'm a still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black it's much worse\nThen a beat from Tyson 'cause Ren is not nice and\nYour ass is better off just rollin' a dice and\nFindin' you a number for luck\n'cause you all need it when you see I don't give a fuck\nMy identity, and the shit is gettin' shown\nWithout a video I'm still gettin' on\nI'm at a show then my picture is takin'\nOne click of the flash and punk niggas are breakin'\nTo the door, tryin' to join my fan club\nLipstickin' over one of my dubs\nAnd it's the minimal scratch for the moment\nUntil I fuck up the so called opponet\nThat's standing in the zone of the twilight\nSayin' how in de fuck did he get mixed up in my fight\nIt was'nt a mistake, it was a set-up\nSo until I'm finished poppin' my lyrics you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you rollin' up shit quick\nWith a nigga like Ren about the hit\nNow lemme hear you mothafuckaz talk some more shit\nI'm a bust your ass in your mouth\nYo, unless you're sayin' \"Compton's in de house\"\n\n[Dr. Dre]\n\nWho realy cares - about a sucker on a take off\nBust de move, we can have a shake n' bake-off\nMe and you can go 'cause I don't care yo\nRap fight or guerilla warfare\nWe can rumble, 'cause when my lungs go in and out\nI kick rhymes in a bundle to win about\nOr scarier scaffle\nI just muffle the opposition, there's no competition\nLet 'em know that Dre is gettin' stronger\nCompton's in de house but now it's some' longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\n'cause Dre is the mothafuckin' doctor\nAnd if me and Ren's on the mike it's like propaganda, no doubt\n\"Boy you should've known by now\" ..\n\nCompton's in the house\nYeah, it's time to put Compton on de map, don't ever think you can get it on\nYou stupid mothafuckaz!\n\nCompton's in the house ..", "year": null}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Compton's N the House (Live Mix)", "lyrics": "* Originally Performed on N.W.A's concert at Anahiem, California 1988\n\n[Opening Skit: MC Ren Speaking through 3\" Glass and the 2 ways Phone]\n[MC Ren] Yo, what's up nigga?\n[Train]  What's up G?\n[MC Ren] Yo man, I'm in this motherfuckin' kick it, tired of all this shit, man\nI was lookin' for some bitches, nigga has gone to jail, you know what I'm sayin?\n[Train]  Yeah man, just tell me what's up?\n[MC Ren] Cause nigga I ain't.. I ain't with no bitch, no ride\nYou know what I'm sayin?\nNiggas said come on Ren, uhh, just let's go try to get some whores\nAnd this kind of shit, I'm like; Alight, let's go\nProbably, tried to talk to these bitches\nThese motherfucking Police bitches, you know what I'm sayin?\n[Train]  Y'all shouldn't have been fuckin' up down there, no way man\n[MC Ren] I gotta get.. I told the motherfuckers not even to go around that way\nNot down that street, you know what I'm sayin?\nI told niggas to go down here, down here in Corson and Compton\nThese niggas wanna go way up in Hollywood\n\n(*Beats started*)\n\n[MC Ren]  When we're on the stage, we're in a motherfuckin' rage, so Dre\n[Dr. Dre] What up?\n[MC Ren]  Why don't you get the 12 guage?\n[Dr. Dre] Aww, yeah\n\n[MC Ren]\nAnd show them how Eazy-Duz-It\nSo if you punks wanna lay somethin' of it\nStep up, run up, get up, what's up sucker?\nYou want some of this?\nThen you're a stupid motherfucker\nKickin, like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin, a beat that's hittin' \"that's what?\"\nAnd if you listen then you'll know we're not bullshittin'\nDope, like a pound or a Key, yeah\nSo shut the fuck up and listen to me\nI make the killin'\nI got fatter shit to the ceilin, why's that?\nCause I'm the mothafuckin' Ruthless Villain\nMC Ren, stompin' any fool in my way\nWith some help from my homeboy Dre\n\n[Dr. Dre]\nWell, check this out\nNow my name is Dre, uha, the mothafuckin' doctor\nYo, rippin' shit up, awww yeah, and here to rock you\nWith some help from my homeboy E\nThe criminal of the Ruthless Posse\nCold funkin' it up \"word up\" is what we do\nThe reputation of the N.W.A. crew\nGettin' busy, because we're cold stompin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\nNow, all the ladies, all the ladies\nAll the ladies if you're good to go\nCome on, say Aaooowww                  \"Aaooowww\"\n\n[Break]\n[Dr. Dre] Ayyio Ren, won't tell them what the fuck you are, home boy\n[MC Ren]  Ruthless Villain superstar\n[Dr. Dre] Yo, I don't think they heard you, won't tell them what you are\n\n[MC Ren]\nI'm a Ruthless gangster, definition Villain\nLeave your shit unlocked and he's stealin'\nSo call the police cause that's all you could do \"but what?\"\nHe'll get away without leavin' a clue  \"yeah\"\nKeepin' shit in control like the neighboorhood chief\nBut, referred to as a walkin' thief\nThey say he's a bad influence for the kids, home boy\n\n[Dr. Dre] Why the fuck they're blamin' him?\n[MC Ren]  Cause he's the one that they jock\n[Dr. Dre] Cause he's the... (*explosion*)", "year": null}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Compton's N the House (Remix)", "lyrics": "[Intro: Dr. Dre + MC Ren]\nYeah, right about now Compton's in the mothafucking house Yeah do it, do it, do it\nN.W.A's in full effect\nHey yo Yella boy, kick me that funky-ass beat\nPump it up, pump it up\nYeah, who's in the mothafucking house right now?\nPump that shit up\nYeah, Compton's definetly in the house\nHey yo Ren, what we're gonna do?\n\n[Verse 1: MC Ren & Dr. Dre + Eazy-E]\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people, people\nFrom everywhere watching the show\nPaying top dolars because they know\nWhen we're on the stage, we're in a mothafuckin' range\n[R] So Dre\n[D] What up?\n[R] Why don't you get the 12 guage\nAnd show 'em how Eazy-Duz-It\nSo if you punks wanna make somethin' of it\nStep up, run up, get up, what's up sucker\nYou want some of this?\nThen you're a stupid mothafucka\nKickin' - like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin' - a beat that's hittin'\nAnd if you listen then you know we're not bullshittin'\n\n[Verse 2: MC Ren]\nDope - like a pound or a key\nSo shut the fuck up and listen to me\nI make a killin'\nI got money to the ceilin' (why's that?)\nCuz I'm a mothafuckin' ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Verse 3: Dr. Dre + MC Ren]\nNow my name is Dre - de mothafuckin' doctor\nRippin' shit up, oh yeah, and here to rock ya\nWith some help from my homeboy E\nThe criminal of the ruthless posse\nFuckin' it up, word up, is what we do\nThe reputation of the NWA crew\nGettin' busy because we're cold stompin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\n\n[Verse 4: MC Ren & Dr. Dre]\n[R] Speaking of Compton, it's making me sick (why?)\nEverybody's talking that crazy shit\n[D] Saying they were raised in the CPT (aha)\nJust as I was, they try to be like me\n[R & D] Popping that shit, get the fuck out my face\nKnowing that they never even seen the place\nClaiming my city is my city they claim\nMuthafucka we're about to put some salt in your game\n\n[Break: Dr. Dre + MC Ren]\nYeah I'm tired of these mothafuckers running around town Talking about they're from Compton and shit\nTrying to get on the bandwagon ..\nYeah Dre, I know what you're saying man\nBut let's tell them who we're talking about\n\n[Verse 6: Dr. Dre & MC Ren]\nWhat do you call a crew that can rap like that?\n[R] Yo N.W.A call them muthafuckers wack\n[D] Yeah you know what time it is, listen to why we call them wack\nThey got a wacky wack record with a wacky wack crew\n[R] Yo what about the lyrics?\n[D] That shit's wacky wack too\n[R] With a fucked up style and a fucked up show\n[D] Hey yo Ren, what about the scratching, is it def?\n[R] Fuck no!\nThe mothafucking record is so mothafucking wack\nThe mothafucking cracka jack needs to step the fuck back\n\n[Break: Dr. Dre + MC Ren]\nDo you want some of this? Hell no\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy, my boy, my boy Ice Cube\nYo we got my homeboy Eazy E in the house\nWon't you tell 'em what your name is?\n\n[Verse 7: MC Ren]\nMC Ren is the mothafucking coroner\nI'm getting rid of mothafuckas as if they was a foreigner\nShow no grief to pretend when I sin\nI punch you can block it but I'm a still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black it's much worse\nThan a beat from Tyson cause Ren is not nice and\nYour ass is better off just rolling a dice and\nFinding you a number for luck\nCause you all need it when you see I don't give a fuck\nMy identity, and the shit is getting shown\nWithout a video I'm still getting on\nI'm at a show then my picture is taken\nOne click of the flash and punk niggas are breakin'\nTo the door, tryin' to join my fan club\nLip-syncin' over one of my dubs\nThe instrumental will scratch for the moment\nUntil I fuck up the so called opponent\nThat's standing in the zone of the twilight\nSaying how in the fuck did he get mixed up in my fight\nIt wasn't a mistake, it was a set-up\nSo until I'm finished poppin' my lyrics you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you rollin' up shit creek\nWith a nigga like Ren about the hit\nNow let me hear you mothafuckas talk some more shit\nI'm a bust your ass in your mouth\nYo, unless you're saying, \"Compton's in the house\"\n\n[Verse 8: Dr. Dre + Eazy-E]\nWho realy cares - about a sucker on a take off\nBust a move, we can have a shake and bake-off\nMe and you can go cause I don't care yo\nRap fight or guerilla warfare\nWe can rumble, cause when my lungs go in and out\nI kick rhymes in a bundle to win a bout\nOr scurry or scuffle\nI just muffle the opposition, there's no competition\nLet them know that Dre is getting stronger\nCompton's in the house but now it's some' longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\nCause Dre is the mothafucking doctor\nAnd if me and Ren's on the mic, it's like propaganda no doubt\nBoy you should've known by now\n\n[Outro: Dr. Dre]\nYeah, it's time to put Compton on the map\nDon't ever think you can get it on, you stupid mothafuckas!", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Eazy-Duz-It - Single", "title": "Compton's N The House (Single Version)", "lyrics": "[Intro: Dr. Dre + MC Ren]\nYeah, right about now Compton's in the mothafucking house Yeah do it, do it, do it\nN.W.A's in full effect\nHey yo Yella boy, kick me that funky-ass beat\nPump it up, pump it up\nYeah, who's in the mothafucking house right now?\nPump that shit up\nYeah, Compton's definetly in the house\nHey yo Ren, what we're gonna do?\n\n[Verse 1: MC Ren & Dr. Dre + Eazy-E]\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people, people\nFrom everywhere watching the show\nPaying top dollars because they know\nWhen we're on the stage, we're in a mothafucking range\n[R] So Dre\n[D] What up?\n[R] Why don't you get the 12 guage (yeah)\nAnd show them how Eazy-Duz-It\nSo if you punks wanna make something of it\nStep up, run up, get up, what's up suckers\nYou want some of this?\nThen you're a stupid mothafucker\nKicking, like the kick from a kickdrum\nYella boy on the drum getting dumb\nProgramming - a beat that's hitting\nAnd if you listen then you know we're not bullshitting\n\n[Verse 2: MC Ren]\nDope - like a pound or a key (yeah)\nSo shut the fuck up and listen to me\nI make a killing - I got money to the ceiling (why's that?)\nCause I'm a mothafucking ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Verse 3: Dr. Dre]\nNow my name is Dre - the mothafucking doctor\nRipping shit up (oh yeah) and here to rock ya\nWith some help from my homeboy E\nThe criminal of the ruthless posse\nFucking it up (word up) is what we do\nThe reputation of the N.W.A crew\nGetting busy because we're cold stomping\nAnd we're born and raised\n(And we're born and raised)\nAnd we're born and raised in Compton\n\n[Verse 4: MC Ren & Dr. Dre]\n[R] Speaking of Compton, it's making me sick (why?)\nEverybody's talking that crazy shit\n[D] Saying they were raised in the CPT\nJust as I was, they try to be like me\n[R & D] Popping that shit, get the fuck out my face\nKnowing that they never even seen the place\nClaiming my city is my city they claim\nMuthafucka we're about to put some salt in your game\n\n[Break: Dr. Dre (MC Ren)]\nYeah I'm tired of these mothafuckers running around town Talking about they're from Compton and shit\nTrying to get on the bandwagon\n(Yeah Dre, I know what you're saying man, but let's tell them who we're talking about)\n\n[Verse 6: Dr. Dre & MC Ren]\nWhat do you call a crew that can rap like that?\n[R] Yo N.W.A call them muthafuckers wack\n[D] Yeah you know what time it is, listen to why we call them wack\nThey got a wacky wack record with a wacky wack crew\n[R] Yo what about the lyrics?\n[D] That shit's wacky wack too\n[R] With a fucked up style and a fucked up show\n[D] Hey yo Ren, what about the scratching, is it def?\n[R] Fuck no!\nThe mothafucking record is so mothafucking wack\nThe mothafucking cracka jack needs to step the fuck back\n\n[Break: Dr. Dre (MC Ren)]\nDo you want some of this? Hell no\nDre the mothafuckin' doctor\n(Well for the record it's Ren and for the street it's Villain)\nDre the mothafuckin' doctor\n(Well for the record it's Ren and for the street it's Villain)\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy, my boy, my boy Ice Cube\n(Yo we got my homeboy Eazy E in the house)\nWon't you tell 'em what your name is?\n\n[Verse 7: MC Ren]\nMC Ren is the mothafucking coroner\nI'm getting rid of mothafucker as if they was a foreigner\nShow no grief to pretend when I sin\nA punch you can block it but I'm a still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black it's much worse\nThan a beat from Tyson, cause Ren is not nice and\nYour ass is better off just rollin' a dice and\nFinding you a number for luck\nCause you'll need it when you see I don't give a fuck\nMy identity, and the shit is getting shown\nWithout a video I'm still getting on\nI'm at a show then my picture is taking\nOne click of the flash and punk niggas are breaking\nTo the door, trying to join my fan club\nLip-syncing over one of my dubs\nThe instrumental will scratch for the moment\nUntil I fuck up the so called opponent\nThat's standing in the zone of the twilight\nSaying how in the fuck did he get mixed up in my fight\nIt wasn't a mistake, it was a set-up\nSo until I'm finished popping my lyrics you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you rolling up shit creek\nWith a nigga like Ren about the hit\nNow let me hear you mothafuckers talk some more shit\nI'm a bust your ass in your mouth\nYo, unless you're saying - \"Compton's in the house\"\n\n[Verse 8: Dr. Dre]\nWho realy cares - about a sucker on a take off\nBust a move, we can have a shake n' bake-off\nMe and you can go cause I don't care yo\nRap fight or guerilla warfare\nWe can rumble, cause when my lungs go in and out\nI kick rhymes in a bundle to win a bout\nOr scurry or scuffle\nI just muffle the opposition, there's no competition\nLet them know that Dre is getting stronger\nCompton's in the house but now it's some longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\nCause Dre is the mothafuckin' doctor\nAnd if me and Ren's on the mike it's like propaganda, no doubt\n(Boy you should've known by now) - Compton's in the house\n\n[Outro: Dr. Dre]\nYeah, it's time to put Compton on the map\nDon't ever think you can get it on, you stupid mothafuckas!", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Don't Drink That Wine", "lyrics": "[Intro: The D.O.C. as Reporter]\nYo! Bitch, don't you know I'll beat your mother'...\nOh, oh! you\n'Ey, what's happenin' everybody?\nIt's your mayn nigga behind the mothafuckin' trigga, Willy Johnston!\nAnd I'm in front of the liquor store with all the bitches, thieves and dopeheads\nAnd I got my man Edmond Woodrow Jones\nAaand the Johntson Sisters (no relation)\nSo then put little something together,.. to tell y'all... what's really goin' on!\nMia put this shit on! [whisperin']\n\n[Bridge: Choir singin']\nOooooooooooooohhhhhhhhhhhhhhh! (Oooooooooooooohhhhhhhhhhhhhhh!)\nOooooooooooooohhhhhhhhhhhhhhh! (Oooooooooooooohhhhhhhhhhhhhhh!)\nOooooooooooooohhhhhhhhhhhhhhh...\nDu-dum, dum-dum!\n\n[Choir singin']\nDoooon't drink that wiiiine\nCoke would be better, just - it's easy to fiiiind!\nIf that won't do, - smoke a joint o-or twoo-ooo!\nDon't drink that wii-iii-iine! - Woooaahhh, that wii-ii-iine! [cell door close]\n\n[Outro: Dr. Dre as News Archor]\nThe shit y'all listenin' to was sponsored by \"M.A.D.D\nMothafuckas Against Drunk Drivin'!\"\n[Music starts playin' Parliament's]: when you talkin motherfuckin hit\nDaaaamn, this some good shit, man!\nWhere you get this shit from? Daaamn! [coughes]\nYeah, now we take it back to an earlier...\nThe...\nThe previous program!", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "Dopeman", "lyrics": "[Introduction: Eazy-E & unknown Dopefiend]\n[knocking on the door]\nYo man what you need?\nYo, uh, man I need something man, I need a twenty, man\nWhatchu got, man?\nEy, I got this rope chain, man\nMan, this shit look like a gold on the roll shit (What the fuck is that?)\n(It's a fuckin dud!)\nIt's real man\nThis shit ain't real\n(That nigga sellin' that shit again, man?!)\nGet the fuck outta here and come back with some money\nC'mon man, be cool man\nY'all Mexicans always comin' with this shit\n\n[Verse 1: Ice Cube]\nIt was once said by a man who couldn't quit\n\"Dopeman, please can I have another hit?\"\nThe dope man said, \"Clucka, I don't give a shit\nIf your girl kneel down and sucked my dick\"\nIt all happened and the guy tried to choke her\nNigga didn't care, she ain't nothing but a smoker\nThat's the way it goes, that's the name of the game\nYoung brother getting over by slanging 'caine\nGold around his neck in 14 k heaven\nBitches jocking on his dick 24-7\nPlus he's making money keeping the base heads waiting\nRollin' six four with the fresh ass daytons\nLiving in Compton, California CA\nHis uzi up yo ass if he don't get paid\nNigga begging for credit, he's knocking out teeth\nClocking much dollars on the 1st and 15th\nBig wad of money, nothing less than a twenty\nYo, you want a five-oh? The dope man's got plenty\nTo be a dope man, boy, you must qualify\nDon't get high off your own supply\nFrom a key to a g it's all about money\n10 piece for 10 base, pipe comes free\nAnd people out there are not hip to the fact\nIf you see someboy getting money for crack, he's the\n\n[Hook]\nDopeman, dopeman!\nHey man give me a hit\nDopeman, dopeman!\nYo man fuck that shit\nDopeman, dopeman!\nWe just can't quit\nDopeman, dopeman!\nWell, suck this bitch!\n\n[Interlude: Dr. Dre]\nWait a minute -- who the fuck are you talking to?\nDo you know who the fuck I am?\nMan, I can't believe this shit -- this bitch is trying to gank me\nI'll slap you up side your head with nine inches of limp dick!\n\n[Verse 2: Ice Cube]\nYou need a nigga with money so you get a dopeman\nJuice that fool for as much as you can\nShe likes his car and he gets with her\nGot a black eye cause the dopeman hit her\nLet that slide and you pay it no mind\nFind that he's slapping you all the time\nBut that's okay, cause he's so rich\nAnd you ain't nothing but a dopeman's bitch!\nDo what he say and you keep your mouth shut\nPopping that trash might get you fucked up\nYou'll sit and cry if the dope man strikes you\nHe don't give a fuck - he got two just like you\nThere's a another girl in the dopeman's life\nNot quite a bitch but far from a wife\nSh'es called the strawberry and everybody know\nStrawberry, strawberry is the neighborhood ho\nDo anything for a hit or two\nGive tha bitch a rock, she'll fuck the whole damn crew\nIt might be your wife and it might make you sick\nCome home and see her mouth on the dopeman's dick\nStrawberry just look and you'll see her\nBut don't fuck around or she'll give you gonorrhea\nAnd people out there are not hip to the fact\nThat Strawberry is a girl selling pussy for crack to the\n\n[Hook 2]\nDopeman, dopeman!\nHey man give me a hit\nDopeman, dopeman!\nHey yo man fuck that shit\nDopeman, dopeman!\nIn yo face\nYo Dre, kick in tha bass\n\n[Verse 3: Ice Cube]\nIf you smoke 'caine, you're a stupid motherfucker\nKnown around the hood as the schoolyard clucker\nDoing that crack with all the money you got\nOn your hands and knees searching for a piece of rock\nJonesing for a hit and you're looking for more\nDone stole a Alpine of out Eazy's 6-4\nYou need your ass whooped cause it's out of this earth\nCan't get a 10 piece need a dolla fifty's worth\nKnucklehead nigga, yeah, you turned into a crook\nBut swear up and down, boy, that you ain't hooked\nYou beat your friend up and you whooped his ass long\nCause he hit the pipe till the rock was all gone\nYou're robbing and stealing, bugging and illing\nWhile the dope man's dealing\nWhat is killing your pain, cocaine, this shit's insane\nYo, E, she's a berry, let's run a train\n\n[Eazy-E]\nMan, I wouldn't touch that bitch\n\n[Ice Cube]\nMe neither; Ho, go home and wash out your beaver\nAnd niggas out there messing up people's health\nYo, what the fuck yo gotta say for yourself?\n\n[Eazy-E]\nWell, I'm the dopeman - yeah, boy, wear corduroy\nMoney up to here but unemployed\nYou keep smoking that rock and my pocket's getting bigger\n\n[Dr. Dre]\nYo, got that five-0 - double up, nigga\n\n[Eazy-E]\nYeah, high rolling, big money I'm folding\nBitch on my tip for the dick I'm holding\nStrung strawberry jocking me so early\nHo, you want a hit you gotta get your knees dirty\nWell, that's my life that how it's cut\n\n[Girls]\nHey, dopeman!\n\n[Eazy-E]\nBitch, shut the fuck up\nGotta make a run, it's a big money deal\nGankers got the fake but you can get the real from the\n\n[Hook 3]\nDopeman, dopeman!\nYeah, that's me\nDopeman, dopeman!\nYo, can I get a \"g\"?\nDopeman, dopeman!\nClock as much as he can\nFuck this shit, who am I?\nTHE DOPEMAN!\n\n[Krazy D]\nYo, mister dopeman, you think you're slick\nYou sold crack to my sister and now she's sick\nBut if she happens to die because of your drug\nI'm putting in your culo a .38 slug!", "year": "1987-08-13"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Dopeman (Remix)", "lyrics": "Yo Dre!!\n\n[Verse 1: Ice Cube]\nIt was once said by a man who couldn't quit\n\"Dopeman,\" please can I have another hit\nThe dopeman said, \"Cluck, I don't give a shit\nIf your girl kneel down, and suck my dick\"\nIt all happened and the guy tried to choke her\nNigga didn't care, she ain't nothin' but a smoker\nThat's the way goes, that's the name of the game\nYoung brother gettin' over by slangin' 'caine\nGold around his neck in 14 K heaven\nBitches clockin' on his dick twenty-four/seven\nPlus he's makin' money, keep the baseheads waitin'\nRollin' six-fo' wit the fresh ass Daytons\nLivin' in Compton, Cailfornia C-A\nHis uzi up yo' ass if he don't get paid\nNigga beggin' for credit, he's knockin' out teeth\nClockin' much dollars on the 1st and 15th\nBig wad of money nuttin' less than a twenty\nYo you want a five-oh the dopeman's got plenty\nTo be a dopeman boy you must qualify\nDon't get high off your own supply\nFrom a ki' to a G it's all about money\nTen piece for a champ, bass pipe comes free\nIf people out there are not hip to the fact\nIf you see somebody gettin' money for crack\nHe's the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Ay man, give me a hit)\nDopeman, dopeman! (Yo man, fuck that shit!)\nDopeman, dopeman! (We just can't quit!)\nDopeman, dopeman! (Well suck this, bitch!)\n\n[Verse 2: Dr. Dre]\nWait a minute, wait a minute\nWho the fuck are you talkin' to?\nDo you know who the fuck I am?\nMan I can't believe this shit\nThis bitch is tryin' to gank me\nYo I oughta slap you upside yo' head\nWith nine inches of limp dick\n\n[Ice Cube]\nYou need a nigga with money so you get a dopeman\nJuice that fool for as much as you can\nShe like his car, and he get wit her\nGot a black eye cause the dopeman hit her\nLet that slide and you pay it no mind\nFind that he's slappin' you all the time\nBut that's okay, cause he's so rich\nAnd you ain't nuttin' but a dopeman's bitch\nDo what he say and you keep your mouth shut\nPoppin' that trash might get you fucked up\nWell sit and cry, if the dopeman strike you\nHe don't give a fuck he got two just like you\nThere's another girl in the dopeman's life\nNot quite a bitch but far from a wife\nShe's called \"Strawberry\" and everybody know\nStrawberry, Strawberry is the neighborhood ho\nDo anything for a hit or two\nGive the bitch a rock she fucked the whole damn crew\nIt might be your wife and it might make you sick\nCome home and see her mouth on the dopeman's dick\nStrawberry, just look and you'll see her\nBut don't fuck around she'll give you gonnorhea\nIf people out there are not hip to the fact\nStrawberry is a girl sellin' pussy for crack\nTo the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Ay man, give me a hit)\nDopeman, dopeman! (Yo man, fuck that shit!)\nDopeman, dopeman! (In yo' face)\nDopeman, dopeman! \"Yo Dre!! Kick in the bass!!\"\n\n[Verse 3: Ice Cube]\nIf you smoke 'caine, you a stupid motherfucker\nKnown around the hood as the schoolyard clucker\nDoin' that crack with all the money you got\nOn your hands and knees, searchin' for a piece of rock\nJonesin' for a hit, and you're lookin' for mo'\nDone stole the Alpine out of Eazy's six-fo'\nYou need your ass whupped cause it's out of this earth\nTo get a ten-piece need a dollar fifty work\nKnucklehead nigga, yeah you turned into a crook\nBut swear up and down boy that you ain't hooked\nYou beat your friend up, and you whupped his ass long\nCause he hit the pipe til the rock was all gone\nYou robbin' and stealin', buggin' and illin'\nWhile the dopeman's dealin', what is healin' yo' pain\nCocaine, this shit's insane\nYo E she's a berry, let's run a train\n(Man, I wouldn't touch that bitch) me neither\nHo go home and wash out your beaver\nAnd niggas out there messin' up people's health\nYo, what the fuck you gotta say for yourself?\n\n[Eazy-E]\nWell I'm the dopeman, yeah boy, I wear courderoy\nMoney up to here but unemployed\nYou keep smokin' that rock and my pockets gettin' bigger\n(Yo, got that five-oh double up nigga!)\nYeah high rollin', big money I'm foldin'\nBitch on my tip for the dick I'm holdin'\nSprung strawberry jockin' me so early\nHo you wanna hit you gotta get your knees dirty\nNow that's my life, that's how it's cut\n\"Hey dopeman!\" Bitch, shut the fuck up!\nGotta make a run, it's a big money deal\nGankers got the fake but you can get the real\nFrom the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Yeah that's me)\nDopeman, dopeman! (Yo can I get a G?)\nDopeman, dopeman! (Clock as much as he can)\nFuck this shit who am I? THE DOPEMAN!\n\n[Outro: Krazy D]\nYo Mr. Dopeman, you think you're slick\nYou sold crack to my sister, and now she's sick\nBut if she happens to die, because of your drug\nI'm puttin' in your culo, a .38 slug", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Express Yourself", "lyrics": "[Intro]\nDr. Dre: Yo, man, it's a lot of brothers out there flakin' and perpetratin' but scared to kick reality\nIce Cube: Man, you've been doin' all this dope producing, but you ain't had a chance to show 'em what time it is\nDr. Dre: So what you want me to do? ... (Express yourself)\n\n[Verse 1: Dr. Dre]\nI'm expressing with my full capabilities\nAnd now I'm living in correctional facilities\nCause some don't agree with how I do this\nI get straight, meditate like a Buddhist\nI'm dropping flavor, my behavior is hereditary\nBut my technique is very necessary\nBlame it on Ice Cube, because he says it gets funky\nWhen you got a subject and a predicate\nAdd it on a dope beat and that'll make you think\nSome suckers just tickle me pink\nTo my stomach, cause they don't flow like this one\nYou know what? I won't hesitate to dis one\nOr two before I'm through, so don't try to sing this\nSome drop science, well I'm dropping English\nEven if Yella makes it a cappella\nI still express, yo I don't smoke weed or sess\nCause it's known to give a brother brain damage\nAnd brain damage on the mic don't manage nothing\nBut making a sucker and you equal, don't be another sequel\n\n[Hook]\nExpress yourself\nCome on and do it\n\n[Verse 2: Dr. Dre]\nNow, getting back to the PG\nThat's program, and it's easy\nDre is back, new jacks are made hollow\nExpressing ain't their subject because they like to follow\nThe words, the style, the trend, the records I spin\nAgain and again and again, yo, you on the other end\nWatch a brother saying dope rhymes with no help\nThere's no fessing and guessing while I'm expressing myself\nIt's crazy to see people be\nWhat society wants them to be, but not me\nRuthless is the way to go, they know\nOthers say rhymes that fail to be original\nOr they kill where the hip-hop starts\nForget about the ghetto and rap for the pop charts\nSome musicians cuss at home\nBut scared to use profanity when up on the microphone\nYeah, they want reality but you won't hear none\nThey rather exaggerate a little fiction\nSome say no to drugs and take a stand\nBut after the show they go looking for the dopeman\nOr they ban my group from the radio, hear N.W.A and say \"Hell no!\"\nBut you know it ain't all about wealth as long as you make a note to...\n\n[Hook]\nExpress yourself\nCome on and do it\n\n[Verse 3: Dr. Dre]\nFrom the heart cause if you wanna start to move up the chart\nThen expression is a big part of it\nYou ain't efficient when you flow\nYou ain't swift, moving like a tortoise, full of rigor mortis\nThere's a little bit more to show\nI got rhymes in my mind, embedded like an embryo\nOr a lesson, all of 'em expression\nAnd if you start fessing, I got a Smith and Wesson for you\nI might ignore your record because it has no bottom\nI get loose in the summer, winter, spring and autumn\nIt's Dre on the mic, getting physical\nDoing the job, N.W.A is the lynch mob\nYes, I'm macabre but you know you need this\nAnd the knowledge is growing, just like a fetus\nOr a tumor but here's the rumor\nDre is in the neighborhood and he's up to no good\nWhen I start expressing myself, Yella slam it\nCause If I stay funky like this, I'm doing damage\nOr I'mma be too hyped and need a straight jacket\nI got knowledge and other suckers lack it\nSo, when you see Dre, a DJ on the mic\nAsk what it's like, it's like we getting hype tonight\nCause if I strike, it ain't for your good health\nBut I won't strike if you just\n\n[Hook]\nExpress yourself\nCome on and do it", "year": "1988-07-10"}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "Express Yourself (Edited)", "lyrics": "[Intro: Dr. Dre & Ice Cube]\nDr. Dre: Yo, man, it's a lot of brothers out there flakin' and perpetratin' but scared to kick reality\nIce Cube: Man, you've been doin' all this dope producing, but you ain't had a chance to show 'em what time it is\nDr. Dre: So what you want me to do? ... (Express yourself)\n\n[Verse 1: Dr. Dre]\nI'm expressing with my full capabilities\nAnd now I'm living in correctional facilities\n'Cause some don't agree with how I do this\nI get straight, meditate like a Buddhist\nI'm dropping flavor, my behavior is hereditary\nBut my technique is very necessary\nBlame it on Ice Cube, because he says it gets funky\nWhen you got a subject and a predicate\nAdd it on a dope beat and it'll make you think\nSome suckers just tickle me pink\nTo my stomach, 'cause they don't flow like this one\nYou know what? I won't hesitate to diss one\nOr two before I'm through, so don't try to sing this\nSome drop science, well I'm dropping English\nEven if Yella makes it a cappella\nI still express, yo I don't smoke weed or sess\nCause it's known to give a brother brain damage\nAnd brain damage on the mic don't manage nothing\nBut making a sucker and you equal, don't be another sequel\n\n[Hook]\nExpress yourself\nExpress yourself\nCome on and do it\nExpress yourself\nExpress yourself\nCome on and do it\n\n[Verse 2: Dr. Dre]\nNow, getting back to the PG\nThat's program, and it's easy\nDre is back, new jacks are made hollow\nExpressing ain't their subject because they like to follow\nThe words, the style, the trend, the records I spin\nAgain and again and again, yo, you on the other end\nWatch a brother saying dope rhymes with no help\nThere's no fessing and guessing while I'm expressing myself\nIt's crazy to see people be\nWhat society wants them to be, but not me\nRuthless is the way to go, they know\nOthers say rhymes that fail to be original\nOr they kill where the hip-hop starts\nForget about the ghetto and rap for the pop charts\nSome musicians curse at home\nBut scared to use profanity when up on the microphone\nYeah, they want reality but you won't hear none\nThey rather exaggerate a little fiction\nSome say no to drugs and take a stand\nBut after the show they go looking for the dopeman\nOr they ban my group from the radio, hear N.W.A and say \"Hell no!\"\nBut you know it ain't all about wealth as long as you make a note to...\n\n[Hook]\nExpress yourself\nExpress yourself\nCome on and do it\nExpress yourself\nExpress yourself\nCome on and do it\n\n[Verse 3: Dr. Dre]\n(Express yourself) From the heart cause if you wanna start to move up the chart\nThen expression is a big part of it\nYou ain't efficient when you flow\nYou ain't swift, moving like a tortoise, full of rigor mortis\nThere's a little bit more to show\nI got rhymes in my mind, embedded like an embryo\nOr a lesson, all of 'em expression\nAnd if you start fessing, I got a Smith and Wesson for you\nI might ignore your record because it has no bottom\nI get loose in the summer, winter, spring and autumn\nIt's Dre on the mic, getting physical\nDoing the job, N.W.A is the lynch mob\nYes, I'm macabre but you know you need this\nAnd the knowledge is growing, just like a foetus\nOr a tumor but here's the rumor\nDre is in the neighbourhood and he's up to no good\nWhen I start expressing myself, Yella slam it\nCause If I stay funky like this, I'm doing damage\nOr I'ma be too hyped and need a straight jacket\nI got knowledge and other suckers lack it\nSo, when you see Dre, a DJ on the mic\nAsk what it's like, it's like we getting hype tonight\nCause if I strike, it ain't for your good health\nBut I won't strike if you just\n\n[Hook x2]\nExpress yourself\nExpress yourself\nCome on and do it\nExpress yourself\nExpress yourself\nCome on and do it", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Express Yourself [Extended Mix]", "lyrics": "[Intro]\nDr. Dre: Yo man there's alot of brothers out there flakin and perpatratin who scared to kick reality\nIce Cube: Yo Dre you've been doin all this dope producin', you ain't had a chance to show 'em what time it is\nDr. Dre: So watch do you want me to do\n\n[Entrence]\nAll you got to do now, express yourself\n\n[Verse 1: Dr. Dre]\nI'm expressin' with my full capabilities\nNow I'm livin' in correctional facilities\n'Cause some don't agree with how I do this\nI get straight, meditate, like a Buddhist\nI'm droppin' flavor, my behavior is hereditary\nBut my technique is very necessary\nBlame it on Ice Cube, because he said it gets funky\nWhen you got a subject and a predicate\nAdd it on a dope beat, and it'll make ya think\nSome suckers just tickle me pink, to my stomach\n'Cause they don't flow like this one\nYou know what, I won't hesitate to dis one or two before I'm through\nSo don't try to sing this\nSome drop science, well I'm droppin' English\nEven if Yella, makes it a-capella\nI still express, yo I don't smoke weed or sess\n'Cause it's known to give a brother brain damage\nAnd brain damage on the mic don't manage nothin'\nBut makin' a sucker and you equal\nDon't be another sequel\n\n[Hook]\nExpress yourself\nDo it good\nExpress yourself\nOh do it\n\n[Verse 2: Dr. Dre + Ice Cube]\nIce Cube, is not for the pop charts\nSo where should a brother like you start expressin' yourself\nMy boy'll show you how\nYo Dre  - What up? - Drop English right about...\n....Now, gettin' back to the PG\nThat's program, and it's easy\nDre is back - New jacks are made hollow\nExpressin' ain't their subject because they like to follow the words\nThe style, the trend, the records I spin\nAgain and again and again\nYo ya on the other end\nWatch a brother playin' dope rhymes, with no help\nThere's no fessin' and guessin' while I'm expressin myself\nIt's crazy to see people be what society wants 'em to be\nBut not me\nRuthless, is the way to go, they know\nOthers say rhymes that fail to be original\nOr they kill where the hip-hop starts\nForget about the ghetto, and rap for the pop charts\nAnd those musicians, curse at home\nBut scared to use profanity, when up on the microphone\nYeah they want reality, but you won't hear none\nThey rather exaggerate a little fiction\nSome say no to drugs, and take a stand\nBut after the show they go lookin for the dope man\nOh they ban my group from the radio\nHear N.W.A. and say ''Hell no!''\nBut you know it ain't all about wealth\nAs long as you make a note to\n(express yourself)\n\n[Hook]\nExpress yourself\nDo it do...\nExpress yourself\nOh do it!\n\n[Verse 3: Dr. Dre + MC Ren]\nA lyricist, yo Dre is the name for it\nTo make somethin' dope on a record that's what he came for\nKickin' reality yo but staying hisself\nBut it's important to keep it in mind to (Express yourself)\nFrom the heart if you wanna start to move up the chart then\nExpression is big part of it\nYou ain't efficient when you flow, you ain't swift\nMovin' like a tortoise, full of rigor mortis\nThere's a little bit more to show\nI got rhymes in my mind, embedded like an embryo\nOr a lesson, all of them expression\nAnd if you start fessin', I got a Smith&Wesson for ya\nI might ignore your record, because it has no bottom\nI get loose in the Summer, Winter, Spring and Autumn\nIt's Dre on the mic gettin physical\nDoin' the job, NWA is the lynch mob\nYes I'm macabre, but you know you need this\nAnd the knowledge is growin' just like a fetus\nOr a tumor, but here's the rumour, Dre's in the neighborhood and he's up to no good\nWhen I start expressin myself, Yella slam it\n'Cause if I stay funky like this, I'm doin' damage\nOr I'mma be too hyped, I need a straight jacket\nI got knowledge, and other suckers lack it\nSo when you see Dre, a DJ on the mic\nAsk what it's like, it's like we gettin' hype tonight\n'Cause if I strike, It ain't for your good health\nBut I won't strike if you just\n(express yourself)\n\n[Hook]\nExpress Yourself\nDo it good...\nExpress Yourself\nOh do it", "year": "1988-03-27"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "Fat Girl", "lyrics": "[Fat girl!]\n[You're a fat girl]\n[Fat...fat...fat fat fat fat girl] (repeat 2X)\n\n(It's funky fresh Eazy E) new kid on tha block\nAnd already got a fat girl on my jock\nNow my story's kinda simple, so please change the tempo\nAs I tell you a tale bout this big fat pimple\nI was chillin' on the ave, drinkin' some brew\nSaw a fatty comin' my way, so what was I to do?\nI busted a U, went tha other way again\nBut forgot that tha avenue was a dead end\nI turned around, here she came, stride for stride\nFunky fat like that, bout two thirty-five\nStampede was rushin, I double looked\nAnd she had more chins than a chinese phonebook\nFive four three ugly as can be, she said\n\n[Ron-de-vu]\nHello Eazy E! Do you remember me? (I said no)\nHuhu yes you do suga\nMy name is Bertha but you can call me booga\nRemember the time when you were drunk at a party\nWe was slow dancin, give ya all this body\n\n[Eazy-E]\nWhen she said that she loved it, I was in shock\nOh my God got a fat girl on my jock\n\n[Hook:]\n[I got a fat girl on my jock] [Fat girl] [Got a fat girl on my jock]\n\nShe gave me tha grin, I showed tha frown\nAnd with a bear hug picked me off tha ground\nSqueezin' me tight, attempted to bug me\nGrabbed me by tha rear, said [Love me, hug me!]\nI was hell, victim of a scandal\nCoz this girl's too much for E to handle\nBroke tha beast grip, started to run\nBack to tha crib, grabbed tha elephant gun\nShe's grubbin', thighs rubbin' in a hot pursuit\nI loaded up tha gun bout ready to shoot\nShe kept on comin' because of addiction\nLegs on fire because of friction\nMy gun broke\nI was doomed\nDropped tha double barrel, grabbed tha harpoon\nAs I swung, tha fat girl fell\nLyin' on tha ave just like a beached whale\nThat's tha story, it's quite ill\nAnd all fat girls y'all besta chill\nAll overweight freaks stay off my block\nCause it's ill to have a fat girl on your jock\n\n[Hook]", "year": "1987-11-06"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Findum, Fuckum & Flee", "lyrics": "[Intro: CPO Boss Hogg]\nHehehehehehehahahahaha\nYeah, it's me again\nSo check it out - ladies, not gentlemen\nDrop your draws, cop a seat\nAnd let's get into this, yeah\n\n[Verse 1: Eazy-E]\nEasily I'm approachin', there ain't no jokin'\nWhen the pussy holes are open\nReady to fuck until my dick is raw\nYo! the muthafuckin' devil's son-in-law\n(Peter Peter, the Pussy-eater)\nNo it's the E, the mothafuckin' pussy-beater\nAnd I’m the quicker-picker-up, I'm quick to pick up a bitch\nSo come here bitch and lick up and lick up and lick up the dick\nNow how many nuts would it take for me\nTo let that bitch graduate to lesson three, let's see\n(Splash splash splash splash splash splash)\nAs you can see I straight waxed that ass\nBack up bitch unless you want nut in your eye\nI never never ever ever seen a bitch cry\nNut one, nut two, nut four, five, six\nI lost the third nut in the mix, fuck it!\n(Hey yo Yella boy, why don't you rewind it!)\nSix, five, four, now three is up\nGimme that gimme that gimme that nut\nYou wanna feel the dick baby try your luck\nBecause the E likes to fuck fuck fuck yo\nI get 'em stuck-on and get the fuck on\nGive 'em a Tootsie Roll and tell 'em thanks for the pussy hole\nI find 'em fuck 'em and flee you know\nBut before I D.O. - yo I take a ho to the hotel\nTo the motel, to the holiday inn\nYo, if that bitch start fuckin' up (What you do?)\nI'll just fuck her friend\n\n[Transition: Eazy-E + Dr. Dre]\nAh Dr. Dre\nWhat up?\nMy mellow\nYo\nIt's on you - so what the fuck you're gonna do?\n\n[Verse 2: Dr. Dre]\nWell, it's on and on and on and on\nYo the beat don't stoppin' 'till the break o' dawn\nYo, every bitch I know they wanna get with me\nThe motherfuckin' notorious D-R-E\nSpit game at a bitch while a nigga's around\nAnd you know most ho's knows not to clown\nCause if a bitch tries to diss me while I'm full of liquor\nI smack the bitch up and shoot the nigga that's with her\nThat's the kind of nigga that you're listenin' to\nTalk to you for a minute then my dick's in you\nYo now every single bitch got a price to pay\nUp on the dicks of N.W.A\nI find 'em fuck 'em and flee you know\nBut before I D.O. - yo, I take a hoe to the hotel\nTo the motel, to the holiday inn (say what?)\nIf that bitch start fuckin' up, yo\nI'll just fuck her friend\n\n[Transition: Dr. Dre + MC Ren]\nNow MC Ren\nWhat up?\nMy mellow\nA check it out\nIt's on you - so what the fuck you're gonna do?\n\n[Verse 3: MC Ren]\nNow gather around y'all, and check it out y'all\nAnd all the bitches come and suck up on my balls y'all\nAnd take a ticket to play with it like a Slinky\nSo put your lips on my big chocolate twinkie\nAnd you swallow all the nut if you bitches are smart\nTo make my dick pop up like a Pop-Tart\nBut after I nut I'mma leave ya\nBut first I must deceive ya, because bitch I don't need ya\nAnd don't say that you love me too\nCause if I turn my back you would fuck the whole crew\nYou're nothin' but a stank ho' tryin' to take my bank ho'\nSo I have to let you know  at a hotel\nAnd a motel and a holiday inn (say what?)\nBecause if that bitch starts fuckin' up yo\nI'll just fuck her friend", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Fuck tha Police", "lyrics": "[Produced by Dr. Dre & DJ Yella]\n\n[Intro: The D.O.C., Dr. Dre, and Ice Cube]\nRight about now, N.W.A. court is in full effect\nJudge Dre presiding\nIn the case of N.W.A. versus the Police Department\nProsecuting attorneys are; MC Ren, Ice Cube\nAnd Eazy-motherfucking-E\nOrder, order, order!\nIce Cube, take the motherfucking stand\nDo you swear to tell the truth, the whole truth\nAnd nothing but the truth so help your black ass?\nYou goddamn right!\nWell, won't you tell everybody what the fuck you gotta say?\n\n[Verse 1: Ice Cube]\nFuck the police! Comin' straight from the underground\nA young nigga got it bad ‘cause I'm brown\nAnd not the other color, so police think\nThey have the authority to kill a minority\nFuck that shit, ‘cause I ain't the one\nFor a punk motherfucker with a badge and a gun\nTo be beating on, and thrown in jail\nWe can go toe-to-toe in the middle of a cell\nFuckin' with me ‘cause I'm a teenager\nWith a little bit of gold and a pager\nSearchin' my car, lookin' for the product\nThinkin' every nigga is sellin' narcotics\nYou'd rather see me in the pen\nThan me and Lorenzo rollin' in a Benz-o\nBeat a police out of shape\nAnd when I'm finished, bring the yellow tape\nTo tape off the scene of the slaughter\nStill getting swole off bread and water\nI don't know if they fags or what\nSearch a nigga down, and grabbing his nuts\nAnd on the other hand, without a gun, they can't get none\nBut don't let it be a black and a white one\n‘Cause they'll slam ya down to the street top\nBlack police showing out for the white cop\nIce Cube will swarm\nOn any motherfucker in a blue uniform\nJust ‘cause I'm from the CPT\nPunk police are afraid of me\nHuh, a young nigga on the warpath\nAnd when I'm finished, it's gonna be a bloodbath\nOf cops, dying in L.A\nYo, Dre, I got something to say\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 1: Cop, MC Ren, & Dr. Dre]\nPull your goddamn ass over right now!\nAww shit, now, what the fuck you pullin' me over for?\n‘Cause I feel like it!\nJust sit your ass on the curb and shut the fuck up!\nMan, fuck this shit!\nA'ight, smartass, I'm taking your black ass to jail!\nMC Ren, will you please give your testimony\nTo the jury about this fucked up incident?\n\n[Verse 2: MC Ren]\nFuck the police! And Ren said it with authority\nBecause the niggas on the street is a majority\nA gang is with whoever I'm steppin'\nAnd the motherfuckin' weapon is kept in\nA stash spot, for the so-called law\nWishing Ren was a nigga that they never saw\nLights start flashing behind me\nBut they're scared of a nigga, so they mace me to blind me\nBut that shit don't work, I just laugh\nBecause it gives them a hint not to step in my path\nFor police, I'm saying, \"Fuck you, punk!\"\nReading my rights and shit, it's all junk\nPulling out a silly club, so you stand\nWith a fake-ass badge and a gun in your hand\nBut take off the gun so you can see what's up\nAnd we'll go at it, punk, and I'ma fuck you up!\nMake you think I'ma kick your ass\nBut drop your gat, and Ren's gonna blast\nI'm sneaky as fuck when it comes to crime\nBut I'ma smoke them now and not next time\nSmoke any motherfucker that sweats me\nOr any asshole that threatens me\nI'm a sniper with a hell of a scope\nTaking out a cop or two, they can't cope with me\nThe motherfuckin' villain that's mad\nWith potential to get bad as fuck\nSo I'ma turn it around\nPut in my clip, yo, and this is the sound\n(Gunshot sounds)\nYeah, somethin' like that\nBut it all depends on the size of the gat\nTaking out a police would make my day\nBut a nigga like Ren don't give a fuck to say…\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 2: Cop, Eazy-E, and Dr. Dre]\n(Knocking sounds)\nYeah, man, what you need?\nPolice, open out!\nAww, shit\nWe have a warrant for Eazy-E's arrest\nGet down and put your hands right where I can see 'em!\n(Move, motherfucker, move now!)\nWhat the fuck did I do, man? What did I do?\nJust shut the fuck up\nAnd get your motherfucking ass on the floor!\n(You heard the man, shut the fuck up!)\nBut I didn't do shit\nMan, just shut the fuck up!\nEazy-E, won't you step up to the stand\nAnd tell the jury how you feel about this bullshit?\n\n[Verse 3: Eazy-E & MC Ren]\nI'm tired of the motherfuckin' jackin'\nSweating my gang, while I'm chillin' in the shack, and\nShining the light in my face, and for what?\nMaybe it's because I kick so much butt\nI kick ass, or maybe ‘cause I blast\nOn a stupid ass nigga when I'm playing with the trigger\nOf an Uzi or an AK\n‘Cause the police always got somethin' stupid to say\nThey put out my picture with silence\n‘Cause my identity by itself causes violence\nThe E with the criminal behavior\nYeah, I'm a gangsta, but still I got flavor\nWithout a gun and a badge, what do you got?\nA sucker in a uniform waiting to get shot\nBy me, or another nigga\nAnd with a gat, it don't matter if he's smaller or bigger\n(Size don't mean shit, he's from the old school, fool!)\nAnd as you all know, E's here to rule\nWhenever I'm rollin', keep lookin' in the mirror\nAnd ears on cue, yo, so I can hear a\nDumb motherfucker with a gun\nAnd if I'm rollin' off the 8, he'll be the one\nThat I take out, and then get away\nWhile I'm driving off laughing, this is what I'll say\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 3: Dr. Dre, Cop]\nThe verdict:\nThe jury has found you guilty of being a redneck\nWhite bread, chickenshit motherfucker\nWait, that's a lie! That's a goddamn lie!\nGet him out of here!\nI want justice!\nGet him the fuck out my face!\nI want justice!\nOut, right now!\nFuck you, you black motherfuckers!\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!", "year": "1988-08-09"}, {"artist": "N.W.A", "album": "The Best Of N.W.A: The Strength Of Street Knowledge", "title": "Fuck Tha Police (2006 Remaster)", "lyrics": "[Verse 1: Ice Cube]\nFuck the police! Comin' straight from the underground\nA young nigga got it bad ‘cause I'm brown\nAnd not the other color, so police think\nThey have the authority to kill a minority\nFuck that shit, ‘cause I ain't the one\nFor a punk motherfucker with a badge and a gun\nTo be beating on, and thrown in jail\nWe can go toe-to-toe in the middle of a cell\nFuckin' with me ‘cause I'm a teenager\nWith a little bit of gold and a pager\nSearchin' my car, lookin' for the product\nThinkin' every nigga is sellin' narcotics\nYou'd rather see me in the pen\nThan me and Lorenzo rollin' in a Benz-o\nBeat a police out of shape\nAnd when I'm finished, bring the yellow tape\nTo tape off the scene of the slaughter\nStill getting swoll off bread and water\nI don't know if they fags or what\nSearch a nigga down, and grabbing his nuts\nAnd on the other hand, without a gun, they can't get none\nBut don't let it be a black and a white one\n‘Cause they'll slam ya down to the street top\nBlack police showing out for the white cop\nIce Cube will swarm\nOn any motherfucker in a blue uniform\nJust ‘cause I'm from the CPT\nPunk police are afraid of me\nHuh, a young nigga on the warpath\nAnd when I'm finished, it's gonna be a bloodbath\nOf cops, dying in L.A\nYo, Dre, I got something to say\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 1: Cop, MC Ren, & Dr. Dre]\nPull your goddamn ass over right now!\nAww shit, now, what the fuck you pullin' me over for?\n‘Cause I feel like it!\nJust sit your ass on the curb and shut the fuck up!\nMan, fuck this shit!\nA'ight, smartass, I'm taking your black ass to jail!\nMC Ren, will you please give your testimony\nTo the jury about this fucked up incident?\n\n[Verse 2: MC Ren]\nFuck the police! And Ren said it with authority\nBecause the niggas on the street is a majority\nA gang is with whoever I'm steppin'\nAnd the motherfuckin' weapon is kept in\nA stash box, for the so-called law\nWishing Ren was a nigga that they never saw\nLights start flashing behind me\nBut they're scared of a nigga, so they mace me to blind me\nBut that shit don't work, I just laugh\nBecause it gives them a hint not to step in my path\nFor police, I'm saying, \"Fuck you, punk!\"\nReading my rights and shit, it's all junk\nPulling out a silly club, so you stand\nWith a fake-ass badge and a gun in your hand\nBut take off the gun so you can see what's up\nAnd we'll go at it, punk, and I'ma fuck you up!\nMake you think I'ma kick your ass\nBut drop your gat, and Ren's gonna blast\nI'm sneaky as fuck when it comes to crime\nBut I'ma smoke them now and not next time\nSmoke any motherfucker that sweats me\nOr any asshole that threatens me\nI'm a sniper with a hell of a scope\nTaking out a cop or two, they can't cope with me\nThe motherfuckin' villain that's mad\nWith potential to get bad as fuck\nSo I'ma turn it around\nPut in my clip, yo, and this is the sound\n(Gunshot sounds)\nYeah, somethin' like that\nBut it all depends on the size of the gat\nTaking out a police would make my day\nBut a nigga like Ren don't give a fuck to say…\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 2: Cop, Eazy-E, and Dr. Dre]\n(Knocking sounds)\nYeah, man, what you need?\nPolice, open out!\nAww, shit\nWe have a warrant for Eazy-E's arrest\nGet down and put your hands right where I can see 'em!\n(Move, motherfucker, move now!)\nWhat the fuck did I do, man? What did I do?\nJust shut the fuck up\nAnd get your motherfucking ass on the floor!\n(You heard the man, shut the fuck up!)\nBut I didn't do shit\nMan, just shut the fuck up!\nEazy-E, won't you step up to the stand\nAnd tell the jury how you feel about this bullshit?\n\n[Verse 3: Eazy-E & MC Ren]\nI'm tired of the motherfuckin' jackin'\nSweating my gang, while I'm chillin' in the shack, and\nShining the light in my face, and for what?\nMaybe it's because I kick so much butt\nI kick ass, or maybe ‘cause I blast\nOn a stupid ass nigga when I'm playing with the trigger\nOf an Uzi or an AK\n‘Cause the police always got somethin' stupid to say\nThey put out my picture with silence\n‘Cause my identity by itself causes violence\nThe E with the criminal behavior\nYeah, I'm a gangsta, but still I got flavor\nWithout a gun and a badge, what do you got?\nA sucker in a uniform waiting to get shot\nBy me, or another nigga\nAnd with a gat, it don't matter if he's smaller or bigger\n(Size don't mean shit, he's from the old school, fool!)\nAnd as you all know, E's here to rule\nWhenever I'm rollin', keep lookin' in the mirror\nAnd ears on cue, yo, so I can hear a\nDumb motherfucker with a gun\nAnd if I'm rollin' off the 8, he'll be the one\nThat I take out, and then get away\nWhile I'm driving off laughing, this is what I'll say\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 3: Dr. Dre, Cop]\nThe verdict:\nThe jury has found you guilty of being a redneck\nWhite bread, chickenshit motherfucker\nWait, that's a lie! That's a goddamn lie!\nGet him out of here!\nI want justice!\nGet him the fuck out my face!\nI want justice!\nOut, right now!\nFuck you, you black motherfuckers!\n\n[Hook]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!", "year": null}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Fuck Tha Police (Insert)", "lyrics": "[Eazy-E]\nBut anyway, fuck all the shit you know\nYou know cause huh, most people in Compton don't give a fuck. Young niggas gangbangers, same fucking thing with the police. All we do is rap about it. You know, you know, you know, you know cause police is like fucking with people, you know. Niggas stop you, throw you on the ground and shit. You know, put a gun to your head and shit. You know what I'm saying?\nYou know just fuck with you for no reason. Anyway, huh fuck the police", "year": "1996-07-02"}, {"artist": "N.W.A", "album": null, "title": "FUCK THE POLICE - Kakuda", "lyrics": "Right about now, N.W.A. court is in full effect\nJudge Dre presiding\nIn the case of N.W.A. vs. the Police Department;\nProsecuting attorneys are MC Ren, Ice Cube, and Eazy-motherfucking-E\n\n[Dr. Dre as The Judge]\nOrder, order, order\nIce Cube, take the motherfucking stand\nDo you swear to tell the truth, the whole truth and nothing but the truth to help your black ass?\n\n[Ice Cube as Witness]\nYou goddamn right!\n\n[Dr. Dre]\nWell won't you tell everybody what the fuck you gotta say?\n\n[Ice Cube]\nFuck the police coming straight from the underground\nA young nigga got it bad 'cause I'm brown\nAnd not the other color so police think\nThey have the authority to kill a minority\nFuck that shit, 'cause I ain't the one\nFor a punk motherfucker with a badge and a gun\nTo be beating on, and thrown in jail\nWe can go toe to toe in the middle of a cell\nFucking with me 'cause I'm a teenager\nA little bit of gold and a pager\nSearching my car, looking for the product\nThinking every nigga is selling narcotics\nYou'd rather see, me in the pen\nThan me and Lorenzo rollin in a Benz-o\nBeat a police out of shape\nAnd when I'm finished, bring the yellow tape\nTo tape off the scene of the slaughter\nStill getting swole off bread and water\nI don't know if they fags or what\nSearch a nigga down, and grabbing his nuts\nAnd on the other hand, without a gun they can't get none\nBut don't let it be a black and a white one\n'Cause they'll slam ya down to the street top\nBlack police showing out for the white cop\nIce Cube will swarm\nOn any motherfucker in a blue uniform\nJust 'cause I'm from, the CPT\nPunk police are afraid of me!\nHUH, a young nigga on the warpath\nAnd when I'm finished, it's gonna be a bloodbath\nOf cops, dying in L.A\nYo Dre, I got something to say\n\nFuck the police [4x]\n\nExample of scene one\n\n[Cop] Pull your goddamn ass over right now\n[NWA] Aww shit, now what the fuck you pulling me over for?\n[Cop] 'Cause I feel like it! Just sit your ass on the curb and shut the fuck up\n[NWA] Man, fuck this shit\n[Cop] Aight smartass, I'm taking your black ass to jail!\n\n[Dr. Dre]\nMC Ren, will you please give your testimony to the jury about this fucked-up incident?\n\n[MC Ren]\nFuck the police and Ren said it with authority\nBecause the niggas on the street is a majority\nA gang is with whoever I'm stepping\nAnd the motherfucking weapon is kept in\nA stash box for the so-called law\nWishing Ren was a nigga that they never saw\nLights start flashing behind me\nBut they're scared of a nigga\nSo they mace me to blind me\nBut that shit don't work, I just laugh\nBecause it gives em a hint, not to step in my path\nFor police, I'm saying, \"Fuck you punk!\"\nReading my rights and shit, it's all junk\nPulling out a silly club, so you stand\nWith a fake-ass badge and a gun in your hand\nBut take off the gun so you can see what's up\nAnd we'll go at it punk, and I'mma fuck you up!\nMake you think I'mma kick your ass\nBut drop your gat, and Ren's gonna blast\nI'm sneaky as fuck when it comes to crime\nBut I'mma smoke 'em now and not next time\nSmoke any motherfucker that sweats me\nOr any asshole that threatens me\nI'm a sniper with a hell of a scope\nTaking out a cop or two, they can't cope with me\nThe motherfucking villain that's mad\nWith potential to get bad as fuck\nSo I'mma turn it around\nPut in my clip, yo, and this is the sound\nYeah, something like that\nBut it all depends on the size of the gat\nTaking out a police, would make my day\nBut a nigga like Ren don't give a fuck to say\n\nFuck the police [4x]\n\n[NWA] Yeah man, what you need?\n[Cop] Police, open now\n[NWA] Aww shit\n[Cop] We have a warrant for Eazy-E's arrest\n[Cop] Get down and put your hands up where I can see 'em (Move motherfucker, move now!)\n[NWA] What the fuck did I do, man what did I do?\n[Cop] Just shut the fuck up and get your motherfucking ass on the floor (You heard the man, shut the fuck up!)\n[NWA] But I didn't do shit\n[Cop] Man just shut the fuck up!\n\n[Dr. Dre]\nEazy-E, won't you step up to the stand and tell the jury how you feel about this bullshit?\n\n[Eazy-E]\nI'm tired of the motherfucking jacking\nSweating my gang, while I'm chilling in the shack, and\nShining the light in my face, and for what?\nMaybe it's because I kick so much butt\nI kick ass, or maybe 'cause I blast\nOn a stupid-ass nigga\nWhen I'm playing with the trigger\nOf an Uzi or an AK\n'Cause the police always got something stupid to say\nThey put out my picture with silence\n'Cause my identity by itself causes violence\nThe E with the criminal behavior\nYeah, I'm a gangster, but still I got flavor\nWithout a gun and a badge, what do ya got?\nA sucker in a uniform waiting to get shot\nBy me or another nigga\nAnd with a gat it don't matter if he's smaller or bigger\n([MC Ren:] Size ain't shit, he's from the old school fool)\nAnd as you all know, E's here to rule\nWhenever I'm rolling, keep looking in the mirror\nAnd ears on cue, yo, so I can hear a\nDumb motherfucker with a gun\nAnd if I'm rolling off the 8, he'll be the one\nThat I take out, and then get away\nWhile I'm driving off laughing this is what I'll say\n\nFuck the police [4x]\n\nThe verdict\n\n[Dre] The jury has found you guilty of being a redneck, white bread, chickenshit motherfucker\n[Cop] Wait, that's a lie! That's a goddamn lie!\n[Dre] Get him out of here!\n[Cop] I want justice!\n[Dre] Get him the fuck out my face!\n[Cop] I want justice!\n[Dre] Out, right now!\n[Cop] Fuck you, you black motherfuckers!", "year": null}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Gangsta Gangsta", "lyrics": "[Skit: Krazy D + Eazy-E (Dr. Dre)]\n*Sirens*\nAh shit. Man, them pinche black gangstas are at it again\nI wonder who they fucked up today?\n*Screeching Tires*\nYou motherfucker!\n*Machine Gun Fire*\n(Got him)\n\n[Police + MC Ren]\nPull over to the side right now\nMan, fuck them motherfuckers!\n\n[Intro: Eazy-E + Sample]\nYo, Dre! Give me a funky-ass bassline!\nRight here!\n\n[Verse 1: Ice Cube]\nHere's a little somethin' about a nigga like me\nNever should've been let out the penitentiary\nIce Cube would like to say\nThat I'm a crazy mothafucka from around the way\nSince I was a youth, I smoked weed out\nNow I'm the mothafucka that you read about\nTakin' a life or two, that's what the hell I do\nYou don't like how I'm livin'? Well, fuck you!\nThis is a gang and I'm in it\nMy man Dre'll fuck you up in a minute\nWith a right left, right left, you toothless\nAnd then you say: \"Goddamn, they ruthless!\"\nEverywhere we go they say: \"Damn!\"\nN.W.A's fuckin' up the program\nAnd then you realize we don't care\nWe don’t just say no, we’re too busy sayin', \"Yeah!\"\nAbout drinkin' straight out the eight bottle\nDo I look like a mothafuckin' role model?\nTo a kid lookin' up to me\nLife ain't nothin' but bitches and money\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me I’ll put my foot in your ass\nSee, I don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta!\nHopin' you sophisticated motherfuckers\nHear what I have to say\n\n[Verse 2: Ice Cube]\nWhen me and my posse stepped in the house\nAll the punk-ass niggas start breakin' out\n'Cause you know, they know what’s up\nSo we started lookin' for the bitches with the big butts\nLike her, but she keep cryin'\n\"I got a boyfriend\"—bitch, stop lyin'!\nDumb-ass hooker ain't nothin' but a dyke\nSuddenly I see some niggas that I don't like\nWalked over to 'em, and said, \"What's up?\"\nThe first nigga that I saw, hit him in the jaw\nRen started stompin' him, and so did E\nBy that time got rushed by security\nOut the door, but we don't quit\nRen said: \"Let's start some shit\"\nI got a shotgun, and here's the plot\nTakin' niggas out with a flurry of buck shots\nBoom, boom, boom! Yeah, I was gunnin'\nAnd then you look, all you see is niggas runnin'\nAnd fallin' and yellin' and pushin' and screamin'\nAnd cussin', I stepped back and I kept bustin'\nAnd then I realized it's time for me to go\nSo I stopped, jumped in the vehicle\nIt's like this, because of that who-ride\nN.W.A is wanted for a homicide\n'Cause I'm the type of nigga that's built to last\nFuck with me, I'll put my foot in your ass\nSee, I don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll tell you exactly how he feel\nAnd don't hold a fuckin' thing back\n\n[Verse 3: Ice Cube]\nHomies all standin' around, just hangin'\nSome dope-dealin', some gang-bangin'\nWe decide to roll and we deep\nSee a nigga on Dayton's and we creep\nReal slow and before you know\nI had my shotgun pointed in the window\nHe got scared and hit the gas\nRight then I knew I has to smoke his ass\nHe kept rollin', I jumped in the bucket\nWe couldn't catch him, so I said fuck it\nThen we headed right back to the fort\nSweatin' all the bitches in the biker shorts\nWe didn't get no play from the ladies\nWith six niggas in a car—are you crazy?\nShe was scared, and it was showin'\nWe all said \"Fuck you, bitch!\" and kept goin'\nTo the hood, and we was fin to\nFind somethin' else to get into\nLike some pussy, or in fact\nA bum rush, but we call it rat pack\nOn a nigga for nothin' at all\nIce Cube'll go stupid when I'm full of eight ball\nI might stumble, but still won't lose\nNow I'm dressed in the county blues\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me, I'll put my foot in your ass\nI don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Interlude: Dr. Dre + MC Ren (The Jimmy Castor Bunch)]\nWait a minute, wait a minute, cut this shit!\nMan, what'cha gon' do now?\n(What we're gonna do right here is go way back)\nHow far you goin' back? (Way back)\n\"As we go a lil' somethin' like this\"—hit it!\n\n[Pre-Verse: Ice Cube]\nHere's a little gangsta, short in size\nA t-shirt and Levi's is his only disguise\nBuilt like a tank, yet hard to hit\nIce Cube and Eazy-E cold runnin' shit\n\n[Verse 4: Eazy-E]\nWell, I'm Eazy-E, the one they're talkin' about\nNigga tried to roll the dice and just crapped out\nPolice tried to roll, so it's time to go\nI creeped away real slow and jumped in the six-fo'\nWith the {diamond in the back, sun-roof top}\nDiggin' the scene with the gangsta lean\n'Cause I'm the E, I don't slang or bang\nI just smoke motherfuckers like it ain't no thang\nAnd all you bitches, you know I'm talkin' to you\n\"We want to fuck you, Eazy,\" I want to fuck you too\nBecause you see, I don’t really take no shit\nSo let me tell you motherfuckers who you're fuckin' with\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me, I'll put a foot in your ass\nI don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll fuck up you and yours\nAnd anything that gets in his way\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll just call you a low-life motherfucker\nAnd talk about yo' funky ways", "year": "1988-09-05"}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "Gangsta Gangsta (Clean)", "lyrics": "[Verse 1: Ice Cube]\nHere's a little something about a brotha like me\nNever shoulda been let out the penitentiary\nIce Cube would like to say\nThat I'm a crazy motha from around the way\nSince I was a youth, I smoked weed out\nNow I'm the type of punk that you read about\nDoin' a crime or two, that's what the hell I do\nYou don't like how I'm livin well [garbled]!\nThis is a crew, and I'm in it\nMy man Dre'll knock you out in a minute\nWith a right left, right left you're toothless\nAnd then you say -- damn they ruthless!\nWe'll make you say it again [damn]\nN.W.A's messing up the program\nAnd then you realize we don't care\nWe don't just say no, we're too busy saying: \"Yeah\"\nAbout drinking straight out the eight bottle\nTell the truth -- do I look like a role model?\nTo a kid looking up to me\nLife ain't nothin but girls and money\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailing\nYo, tell em what they yelling\n\n[Hook]\nGangsta gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll tell you exactly how he feel, and don't want a thing back)\n\n[Verse 2: Ice Cube]\nHomies all standing around, just hanging\nSome dope-dealing, some gang-banging\nWe decide to roll and we deep\nSee a sucka on Daytons and we creep\nReal slow, and before you know\nI had my AK pointed in the window\nCheck it in, punk, or I might blast\nHe got scared and hit the gas\nWe tried to catch him, but you all know\nYou can't catch a five point oh, so\nWe headed right back to the fort\nSweatin’ all the girls in the biker shorts\nWe didn't get no play, from the ladies\nWith six thugs in a car are you crazy?\nShe was scared, and it was showing\nWe all said [garbled] and kept going\nTo the hood, and we was fin to\nLook for somethin’ else to get into\nLike a new female, or in fact\nA bum rush, but we call it rat pack\nOn a sucka for nothin’ at all\nIce Cube'll go stupid when I'm full of eight ball\nI might stumble, but still won't lose\nNow I'm dressed in the county blues\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailin'\nYo, tell em what they yellin'\n\n[Interlude: Dr. Dre (MC Ren)]\nWait a minute, wait a minute, cut this\n(Man whatcha gonna do now?)\n\"What we're gonna do right here is go way back\"\nHow far you goin back? \"Way back\"\n\"As we go a lil somethin like this\"\n\n[Ice Cube]\nHere's a lil gangsta, short in size\nA t-shirt and Levi's is his only disguise\nBuilt like a tank yet hard to hit\nIce Cube and Eazy E [Dre:] cold rockin' it\n\n[Verse 3: Eazy E (MC Ren)]\nWell I'm Eazy E the one they're talkin about\nSucka tried to roll the dice and just crapped out\nPolice tried to roll, so it's time to go\nI creeped away real slow and jumped in the six-fo'\nWith the \"Diamond in the back, sun-roof top\"\nDiggin' the scene with the gangsta lean\nCause I'm the E, I don't slang or bang\nI just knock suckas out like it ain't no thang\nAnd all the ladies, you know I'm talkin to you\n\"We love you Eazy!\" Yeah, I love you too\nBecause you see, you know I gotta be legit\n(So let me tell you stupid suckas who you're messing with]\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailin'\nYo, tell em what they yellin'\n\n[Hook]\nGangsta, Gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll...up you and yours, and anything that gets in his way)\n\nGangsta, Gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll just call you a low-life mother..., and talk about your funky ways)", "year": null}, {"artist": "N.W.A", "album": "War & Peace Vol. 2 (The Peace Disc)", "title": "Hello", "lyrics": "Look at these niggas with attitudes\nLook at these niggas with attitudes\nLook at these niggas with attitudes\nLook at these niggas with attitudes, hello\n\n[Hook|Dr. Dre, MC Ren]\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hell\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\n\n[Ice Cube]\nThe motherfuckin' world is a ghetto\nFull of magazines, full clips, and heavy metal\nWhen the smoke settle\nI'm just lookin' for a big yellow in six inch stilletos\n\nDr. Dre, (hello), perculatin' keep 'em waitin'\nWhile you sittin' here hatin', yo' bitch is hyperventilatin'\nHopin' that we penetratin', you gets natin'\nCause, I never been to Satan, for hardcore administratin'\n\nGang bang affiliatin', mc Ren'll have you\nWildin' off a zone and a whole half a gallon\nGet to dialin' 9 1 1 emergency\nAnd you can tell 'em, it's my son, he's hurtin' me\nAnd he's a felon on parole for robbery\n\nAin't no coppin' a plea, ain't no stoppin' a G\nI'm in the 6, you got to hop in the 3, company monopoly\nYou handle shit sloppily, I drop a ki properly\n\nThey call me the Don Dada, pop a collar\nDrop a dollar if you hear me, you can holla\nEven rottweilers, follow, the Impala\nWanna talk about this concrete? Nigga, I'm a scholar\n\nThe incredible, hetero sexual, credible\nBeg a hoe, let it go, dick ain't edible\nNigga ain't federal, I plan shit\nWhile you handpicked motherfuckers givin' up transkript\n\nLook at these niggas with attitudes\nLook at these niggas with attitudes, hello\n\n[Hook|Ice Cube, Dr. Dre]\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get\n\n[MC Ren]\nVillain blows up yo' spot\nTake yo' notebook, yo' bitch and yo' Glock\nThis motherfucker thought the coochie had a padlock\nYou slapped her ass, that's alarmin'\nCause she want my worm like Carmen\n\nWe chin check niggas, them thin check niggas\nRun trains on golddiggers, beware these fo' niggas\nScarin' motherfuckers like Steven King flicks\nMakin' niggas clear the room like a Dyke flea a dick\nMakin' 2nd to none, shit, nigga like quick\nSo when I bomb first, nigga, who you rollin' with?\n\nFuck that ice on your wrist, fuck yo' fine ass bitch\nCause you could lose it in a tussle, nigga, watch me hustle\nWatch niggas kiss my ass without flexin' a muscle\nBitches, all in the back, they knees waitin' to buckle\nSame time, same channel, don't change the dial\nNiggas 4 Life, fuckin' your wife, these niggas wild, hello\n\n[Hook|MC Ren, Ice Cube]\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\n\n[Dr. Dre]\nDid I fall off? Got you in your room\nRippin' every chronic poster on your wall off\nJust cause I put away the sawed off\nNow I got you sittin' back with a smirk\nListenin' with your arms crossed\n\nQuestionin' Dre's credibility\nWondering if it's still in me to produce hits, y'all be killin' me\nAs if I need to make mo', I got a mansion\nAnd six cars that are paid fo', suck my dick, hello\n\nWe came a long way from not givin' a fuck\nSellin' tapes out of a trunk to movin' this far up\nNow we got the whole world starstruck\nMade a million plus and still don't give a Motherfuck\n\nMotherfucker, I'm Dre, I don't need your respect\nI don't need to make another album, bitch, I don't gotta do shit\nI do it because I want to not to stay in the game\nFuck the fame, I'm still stayin' the same, lil' bitch, hello\n\n[Hook|Dr.Dre, MC Ren]\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\nI started this gangsta shit\nAnd this the motherfuckin' thanks I get, hello\n\nLook at these niggas with attitudes\nLook at these niggas with attitudes, hello\nLook at these niggas with attitudes\nLook at these niggas with attitudes\n\nLook at these niggas with attitudes\nLook at these niggas with attitudes\nLook at these niggas with attitudes\nLook at these niggas with attitudes", "year": null}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "I Ain't tha 1", "lyrics": "[Intro: Woman #1 and Ice Cube]\nIce Cube, do you think you could give me some money to get my hair done?\nWhat's wrong with your hair right now?\nWell you know I get it done every week, and I need my nails done too\nLook, I'mma tell you like this\n\n[Verse 1: Ice Cube]\nI ain't the one, the one to get played like a pooh butt\nSee I'm from the street, so I know what's up\nOn these silly games that's played by the women\nI'm only happy when I'm goin up in em\nBut you know, I'm a menace to society\nBut girls in biker shorts are so fly to me\nSo I step to em, with aggression\nListen to the kid, and learn a lesson today\nSee they think we narrow minded\nCause they got a cute face, and big-behinded\nSo I walk over and say \"How ya doin'?\"\nSee I'm only down for screwin', but you know\nYa gotta play it off cool\nCause if they catch you slipping, you'll get schooled\nAnd they'll get you for your money, son\nNext thing you know you're getting their hair and they nails done\nFool, and they'll let you show em off\nBut when it comes to sex, they got a bad cough\nOr a headache, it's all give\nAnd no take\nRun out of money, and watch your heart break\nThey'll drop you like a bad habit\nCause a brother with money yo, they gotta have it\nMessing with me though, they gets none\nYou can't juice Ice Cube girl, cause I ain't the one\n\n[Interlude #1: Woman #2 and Woman #1]\nGirrrrrl, you got to get these brothers for all the money you can honey. Cause if they ain't got no money, they can't do nothin for me but get out of my face.\nI know what you mean, girl; it ain't nothin right jumpin off unless he got dollars!\n\n[Verse 2: Ice Cube]\nSometimes I used to wonder\nHow the hell an ugly dude get a fine girl's number\nHe's getting juiced for his ducats\nI tell a girl in a minute yo, I drive a bucket\nAnd won't think nutting of it\nShe can ride or walk, either leave it or love it\nI show her that I'm not the O, the N-E, say\nI'm a ruthless N-I double-G A\nCause I'm gamin on a female that's gamin on me\nYou know I spell girl with a B\nA brother like me is only out for one thing\nI think with my ding-a-ling, but I won't bring no\nFlowers to your doorstep, when we goin out\nCause you'll take it for granted, no doubt\nAnd after the date, I'mma want to do the wild thing\nYou want lobster, huh? I'm thinking Burger King\nAnd when I take you, you get frustrated\nYou can't juice Ice Cube and you hate it\nBut you see, I don't go nuts\nOver girls like you with the BIG ol butts\nIt start comin out the pocket, to knock it\nBut when the damage is done\nYou can only lay me girl, you can't play me girl\nFor the simple fact that, I ain't the one\n\n[Interlude #2: Woman #2 and Woman #1]\nI don't care how they look; if they got money, we can hook up but they ain't gettin none.\nYeah I just make em think they gonna get some, play with they mind a lil bit, and get that money. Oh Ice Cube, can I have some money pleeeease?\n\n[Verse 3]\nGive you money? Why bother?\nCause you know I'm looking nothing like your father\nGirl, I can't be played or ganked\nGanked means getting took for your bank\nOr your gold or your money or something\nNine times outta ten, she's giving up nothing\nThey get mad when I put it in perspective\nBut let's see if my knowledge is effective\nTo the brothas man they robbing you blind\nCause they fine with a big behind, but pay it no mind\nKeep your money to yourself homie\nAnd if you got enough game\nYou'll get her name and her number\nWithout going under\nYou can't leave em and love and stay above em\nI used to get no play now she stay behind me\nCause I said I had a Benz 190\nBut I lied and played the one\nJust to get some now she feels dumb\nTo my homies it's funny\nBut that's what you get trying to play me for my money\nNow don't you feel used?\nBut I don't give a hoot, huh, because I knock boots\nYou shouldn't be, so damn material\nAnd try to milk Ice Cube like cereal\nNow how many times do I have to say it?\nCause if I have to go get a gun\nYou girls will learn I don't burn\nYou think I'm a sucka, but I ain't the one\n\n[Outro: Woman #1 and Ice Cube]\nBut you said you love me!\nI don't see no rings on this finger\nWhy you doin me like this? I love you!\nYeah, you love my money; I got what I wanted -- beat it!", "year": "1988-08-08"}, {"artist": "N.W.A", "album": null, "title": "I Ain't Tha One", "lyrics": "Ice Cube, do you think you could give me some money\nTo get my hair done?\nHow short's your hair right now?\nWell you know I get it done every week\nAnd I need my nails done too\nLook, I'ma tell you like this\nI ain't the one, the one to get played like a pooh butt\nSee I'm from the street, so I know what's up\nOn these silly games that's played by the women\nI'm only happy when I'm goin' up in 'em\nBut you know, I'm a menace to society\nBut girls in biker shorts are so fly to me\nSo I step to 'em, with aggression\nListen to the kid, and learn a lesson today\nSee they think we narrow minded\n'Cause they got a cute face, and big-behinded\nSo I walk over and say, \"How ya doin'?\"\nSee I'm only down for screwin', but you know\nYa gotta play it off cool\n'Cause if they catch you slippin', you'll get schooled\nNow they'll get you for your money, son\nNext thing you know you're gettin' their hair and they nails done\nFool, and they'll let you show 'em off\nBut when it comes to sex, they got a bad cough\nOr a headache, it's all give and no take\nRun out of money, and watch your heart break\nThey'll drop you like a bad habit\n'Cause a brother with money yo, they gotta have it\nMessin' with me though, they gets none\nYou can't juice Ice Cube girl, 'cause I ain't the one\nGirl, you got to get these brothers for all the money you can honey\n'Cause if they ain't got no money, they can't do nothin' for me\nBut get out of my face\nI know what you mean girl, it ain't nothin' right jumpin' off\nUnless he got dollars\nSometimes I used to wonder\nHow the hell an ugly dude get a fine girl's number\nHe's gettin' juiced for his ducats\nI tell a girl in a minute yo, I drive a bucket\nAnd won't think nuttin' of it\nShe can ride or walk, either leave it or love it\nI show her that I'm not the O, the N-E, say\nI'm a ruthless N-I double-G A\n'Cause I'm gamin' on a female that's gamin' on me\nYou know I spell girl with a B\nA brother like me is only out for one thing\nI think with my ding-a-ling, but I won't bring no\nFlowers to your doorstep, when we goin' out\n'Cause you'll take it for granted, no doubt\nAnd after the date, I'ma want to do the wild thing\nYou want lobster huh? I'm thinking Burger King\nAnd when I take you, you get frustrated\nYou can't juice Ice Cube and you hate it\nBut you see, I don't go nuts\nOver girls like you with the BIG ol' butts\nIt start comin out the pocket, to knock it\nBut when the damage is done\nYou can only lay me girl, you can't play me girl\nFor the simple fact that, I ain't the one\nI don't care how they look if they got money\nWe can hook up but they ain't gettin' none\nYeah, I just make 'em think they gonna get some\nPlay up they mind a lil' bit, and get that money\nOh Ice Cube, can I have some money please\nGive you money why bother\nCause you know I'm lookin' nothin' like your father\nGirl, I can't be played or ganked\nGanked means getting took for your bank\nOr your gold or your money or something\nNine times outta ten, she's giving up nothing\nThey get mad when I put it in perspective\nBut let's see if my knowledge is effective\nTo the brothas man they robbing you blind\n'Cause they fine with a big behind, but pay it no mind\nKeep your money to yourself homie and if you got enough game\nYou'll get her name and her number without going under\nYou can't leave 'em and love 'em and stay above 'em\nI used to get no play now she stay behind me\n'Cause I said I had a Benz 190 but I lied and played the one\nJust to get some now she feels dumb to my homies it's funny\nBut that's what you get trying to play me for my money\nNow don't you feel used\nBut I don't give hoot, huh, because I knock boots\nYou shouldn't be, so damn material\nAnd try to milk Ice Cube like cereal\nNow how many times do I have to say it\n'Cause if I have to go get a gun, you girls will learn I don't burn\nYou think I'm a sucka, but I ain't the one\nBut you said, you love me\nI don't see no rings on this finger\nWhy you doin' me like this? I love you\nYeah, you love my money, I got what I wanted, beat it", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "I'd Rather Fuck You", "lyrics": "Aaaah, this is one of them songs\nYou can kick back and smoke a joint to\nAnd get real fucked up\nI like to dedicate this one to all the lovely young ladies out there\nOh me? I'm Eazy E, alias A Hoe Taming Motherfucker\nAnd I want all you ladies to know something...\n\nI'd rather fuck with you all goddamn night\nCause your pussy's good\nNow I'm fucking all your friends\nCause you ran your mouth like I knew you would\nYou were bragging to your friends\nSaying \"Eazy E knows how to fuck\"\nSo bring your ass in here and give me some\nSo I can bust a nut (go on and sing that shit)\n\n[Hook:Jewell]\nI'd rather fuck you, yeah (said I'd rather fuck with you)\nI'd rather fuck you, yeah (said I'd rather fuck with you)\n\nI'd rather fuck with you\nCause I like the way you scream my name\nI know you like this dick\nCause you enjoy the pleasure and pain\nNow I'm riding on this pussy here\nAnd I'm not gonna stop (I'm not gonna stop bitch)\nWe can do it doggy style\nAnd you can get on top (sing this motherfucker)\n\nHook/Jewell\n\nWhoo boy, I'd rather fuck with you, yeah (sing that song bitch)\nI need you baby, whoo, I'd rather fuck you, I'd rather fuck with you\n\nI'd rather fuck with you\nCause the other bitches wanna wine and dine (fuck all that)\nI better hurry up and get this nut\nCause it's check-out time\nShe said she wanted me to eat the pussy\nWell I think I'll pass (I don't think so)\nSo get your ass up you funky bitch\nAnd wash your ass (sing this motherfucking shit)\n\n\n[Hook along with Jewell harmonizing until songs ends]", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "If It Ain't Ruff", "lyrics": "[Intro]\nAin't that kinda shit you can sweep under no rug, you know?\n\n[Verse 1: MC Ren]\nRen is the villain and you're just an hostage\nSo whenever I'm steppin' cover your head like an ostrich\nGroupies been waitin' for this, suckers been hatin for this\nYou know why? Because so many are relatin' to this\nJealous is how they feel it intentionally\nBut they start to love it because I made it eventually\nPumpin' the music I keep the music like pumpin'\nCause Ren ain't in here for nothin', I keep the average crowd jumpin'\nYo, you know the color, the villain's in black\nAlways down to make noise, and attack\nSo you better get back unless you wanna come with it\nAnd make your face like a target and close your eyes when I hit it\nYou're screamin' with fear but it's with fear that you're screamin'\nYou're wakin up in a sweat cause Ren is givin' bad dreams and\nI'm not schemin', I'm just tellin the facts\nThat's how it is when N.W.A. starts to jack\nSo brothers that wanna scrap with me\nThat sweezin' and sneezin' will have to lap with me\nEspecially beggin' to write some lyrics with me\nI just snatch your girl to take a nap with me\nCause when it comes to Ren there's no comparison\nAnd if you try to be me, it's quite embarrassin'\nBut I understand cause you're mentally slow\nCause I can tell from the jump you're too nervous to go\n\n[Hook]\nIf it ain't ruff, it ain't me\nThe gangsta's black and he's about to attack\nIf it ain't ruff, it ain't me\nLemme bust a freestyle there - (Alright bet)\n\n[Verse 2: MC Ren]\nI can tell that you're afraid to fight me\nSimple because you lost the crowd and they had to invite me\nBecause your sweat is a puddle but there's a puddle o' sweat\nI'm a threat, so get a cold rag and wipe your neck\nAnd clean the dirt off your face that causes acne\nIt's ridiculous thinkin' that you can jack me\nThis is the round where the punch will go\nInto your H-E-A-D; that's known as a blow\nI'm makin a point but it's a point that I'm makin\nLike, see, I'm hatin' the fakin' I keep the suckers like shakin'\nScared to speak with a thought when they're chosen\nThe sound of my voice in their ear and they're frozen\nThis is a battle to the death, it's like the same ol'\nAgainst a brother on a tip, with a Kangol\nGivin' a pain but it's with pain that I'm givin\nBut I'm comparin' and tearin' em but I'm makin a livin'\nWith the hype of a nine volt battery\nAnd the odds for me to conquer is averagely good\nMeanin' I'mma flow\nI'm from the streets so, yo, I'm ready to go\n\n[Hook]\nIf it ain't ruff, it ain't me (Yo Ren)\nThe gangsta's black and he's about to attack\nIf it ain't ruff, it ain't me\nMan whatcha gonna do now? - *Get funky*\n\n[Verse 3: MC Ren]\nThe 'do not disturb' sign is in effect\nWhile I'm thinkin of a fool to select\nTo give the victim the verdict so for the verdict a victim\nSlammin' my vocals on a dance with the rest then I kick them\nTell 'em they're guilty, and peep out the bailer\nAnd get a new track o' drums so I can play with\nPercussion, pumpin' it loud when I perform\nYo, you wanna play in my game, put on a uniform\nIt ain't a rule in the book you have to go by\nHey, cause when it comes to cheatin', yo, you should know I\nFor fear in the hearts cause it's the hearts full of fear\nCoz what you hear in your ear is something funky and clear\nThe Hulk was incredible yo but Ren he was super\nBut now I'm ruthless, a civilian and not a trooper\nBut a soldier with a top rankin\nGivin' dope material, the hell with the gankin'\nSo play like an airplane and just jet\nAnd keep your blood pressure low cause I'm a threat, if not\nI'm afraid of the show\nThat you're a sucker and you're too nervous to go\n\n[Hook]\nIf it ain't ruff, it ain't me (Yo Ren)\nThe gangsta's black and he's about to attack\nIf it ain't ruff, it ain't me (Yo Ren)\nThe gangsta's black\nIf it ain't ruff, it ain't me\nThe gangsta's black and he's about to attack\nIf it ain't ruff, it ain't me (Yo Ren)\nThe gangsta's black\nIf it ain't ruff, it ain't me\nThe gangsta's black and he's about to attack\nIf it ain't ruff, it ain't me (Yo Ren)\nThe gangsta's black\nIf it ain't ruff, it ain't me", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "If It Ain't Ruff (Edited)", "lyrics": "[Verse 1: MC Ren]\nRen is the villain and you're just a hostage\nSo whenever I'm steppin' cover your head like an ostrich\nGroupies been waitin' for this, suckers been hatin for this\nYou know why?\n'Cause so many are relatin' to this\nJealous is how they feelin' intentionally\nBut they start to love it because I made it eventually\nPumpin' the music, I keep the music like pumpin'\nCause Ren ain't in here for nothin', I keep the average crowd jumpin'\nYo, you know the colour, the villain's in black\nAlways down to make noise, and attack\nSo you better get back unless you wanna come with it\nAnd make your face like a target and close your eyes when I hit it\nYou're screamin' with fear, but it's with fear that you're screamin'\nYou're wakin up in a sweat 'cause Ren is givin' bad dreams and\nI'm not schemin', I'm just tellin the facts\nThat's how it is when N.W.A. starts to jack\nSo brothers that wanna scrap with me\nThat sweezin' and sneezin' will have to lap with me\nEspecially beggin' to write some lyrics with me\nI just snatch your girl to take a nap with me\n'Cause when it comes to Ren there's no comparison\nAnd if you try to be me, it's quite embarrassin'\nBut I understand cause you're mentally slow\nCause I can tell from the jump you're too nervous to go\n\n[Hook 1]\nIf it ain't' ruff, it ain't me *scratching noise*\n(The gangsta's black and he's about to attack)\nIf it ain't ruff, it ain't me *scratching noise*\nLemme bust a freestyle then(Alright bet)\n\n[Verse 2: MC Ren]\nI can tell that you're afraid to fight me\nSimple because you lost the crowd and they had to invite me\nBecause your sweat is a puddle, but there's a puddle o' sweat\nI'm a threat, so get a cold rag and wipe your neck\nAnd clean the dirt off your face that causes acne\nIt's ridiculous thinkin' that you can jack me\nThis is the round where the punch will go\nInto your H-E-A-D; that's known as a blow\nI'm makin a point, but it's a point that I'm makin\nLike, see, I'm hatin' the fakin' I keep the suckers like shakin'\nScared to speak with a thought when they're chosen\nThe sound of my voice in their ear and they're frozen\nThis is a battle to the death, it's like the same ol'\nAgainst a brother on a tip, with a Kangol\nGivin' a pain, but it's with pain that I'm givin\nBut I'm comparin' and tearin' em but I'm makin a livin'\nWith the hype of a nine volt battery\nAnd the odds for me to conquer is averagely\nGood, meanin' I'mma flow\nI'm from the streets so, yo, I'm ready to go\n\n[Hook 2]\nIf it ain't ruff, it ain't me (Yo Ren)\n[Tha gangsta's black and he's about to attack]\nIf it ain't ruff, it ain't me\n(Man what'chya gonna do now?) Get funky\n\n[Verse 3: MC Ren]\nThe 'do not disturb' sign is in effect\nWhile I'm thinkin of a fool to select\nTo give the victim the verdict, so for the verdict a victim\nSlammin' my vocals on a dance with the rest then I kick them\nTell 'em they're guilty, and peep out the bailer\nAnd get a new track o' drums so I can play with\nPercussion, pumpin' it loud when I perform\nYo, you wanna play in my game, put on a uniform\nIt ain't a rule in the book you have to go by\nHey, cause when it comes to cheatin', yo, you should know I\nFor fear in the hearts cause it's the hearts full of fear\n'Cause what you hear in your ear is something funky and clear\nThe Hulk was incredible, yo, but Ren he was super\nBut now I'm ruthless, a civilian and not a trooper\nBut a soldier with a top rankin\nGivin' dope material, the hell with the gankin'\nSo play like an airplane and just jet\nAnd keep your blood pressure low 'cause I'm a threat, 'cause if not\nI'm afraid of the show\nThat you're a sucker and you're too nervous to go\n\n[Hook 3]\nIf it ain't ruff, it ain't me (Yo Ren)\n[The gangsta's black and he's about to attack]\nIf it ain't ruff, it ain't me (Yo Ren)\n(The gangsta's black) If it ain't, if it ain't\n*scratching noise*", "year": "1988-08-08"}, {"artist": "N.W.A", "album": null, "title": "It ain't ruff", "lyrics": "[MC Ren:]\nRen is the villain and you're just an hostage\nSo whenever I'm steppin cover your head like an ostrich\nGroupies been waitin for this, suckers been hatin for this\nYou know why ? Because so many are relatin to this\nJealous is how they feel it intentionally\nBut they start to love it becoz I made it eventually\nPumpin the music I keep the music like pumpin\nCoz Ren ain't in here for nuthin, I keep the average crowd jumpin\nYo, you know the color, the villain's in black\nAlways down to make noise, and attack\nSo you better get back unless you wanna come with it\nAnd make your face like a target and close your eyes when I hit it\nYou're screamin with fear but it's with fear that you're screamin\nYou're wakin up in a sweat coz Ren is givin bad dreams and\nI'm not schemin, I'm just tellin the facts\nThat's how it is when N.W.A. starts to jack\nSo brothers that wanna scr*p with me\nThat sweezin and sneezin will have to lap with me\nEspecially beggin to write some lyrics with me\nI just snatch your girl to take a nap with me\nCoz when it comes to Ren there's no comparison\nAnd if you try to be me, it's quite embarassin\nBut I understand coz you're mentally slow\nCoz I can tell from the jump you're too nervous to go\nIf it ain't' ruff it ain't me (scratch)\n[Tha gangsta's black and he's about to attack]\nIf it ain't ruff it ain't me (scratch)\nLemme bust a freestyle here [Allright then]\nI can tell that you're afraid to fight me\nSimple because you lost the crowd and they had to invite me\nBecoz you're sweat as a puddle but there's a puddle o' sweat\nI'm a threath, so get a cold rag and wipe your neck\nAnd clean the dirt off your face that calls acne\nIt's ridiculous thinkin that you can jack me\nThis is the round where the punch will go\nUntil ya A G-A-T that's known as a flow\nI'm makin a point but it's a point that I'm makin\nLike, see, I'm hatin the fakin I keep the suckers like shakin\nScared to speak with a tongue and they're chozen\nThe sound of my voice in their ear and they're frozen\nThis is a battle to the death, it's like the [?? same ol' ??]\nAgainst a brother on a tip, with [??]\nGivin a pain but it's with pain that I'm givin\nBut I'm comparin and tearin'em but I'm makin a livin\nWith the hype of a 9 Volt battery\nAnd the odds for me to conquer is averagely good\nMeanin I'm a flow\nI'm from the streets so, yo, I'm ready to go\nIf it ain't ruff it ain't me [Yo Ren]\n[Tha gangsta's black and he's about to attack]\nIf it ain't ruff it ain't me\n[Man whatcha gonna do now ?] [get funky]\nThe 'do not disturb' sign is in effect\nWhile I'm thinkin of a fool to select\nTo give the victim the verdict so for the verdict a victim\nSlammin my vocals on a dance with the rest then I kick them\nTell'em they're guilty, and beep out the bailer\nAnd get a new track o' drums so I can play with\nPercussion; pumpin it loud when I perform\nYo, you wanna play in my game, put on a uniform\nIt ain't a rule in the book you have to go by\nHey, coz when it comes to cheatin yo you should know I\nFor fear in the hearts coz it's the hearts full of fear\nCoz what you hear in your ear is something funky and clear\nThe hump was incredible yo but Ren he was super\nBut now I'm ruthless, a civilian and not a trooper\nBut a soldier with a top rankin\nGivin dope material, the hell with the gankin\nSo play like an airplane and just jet\nAnd keep your blood pressure low coz I'm a [??], if not\nI'm afraid of the show\nThat you're a sucker and you're too nervous to go\nIf it ain't ruff it ain't me [Yo Ren]\n[The gangsta's black and he's about to attack]\nIf it ain't ruff it ain't me [Yo Ren]\n[The gangsta's black] If it ain't ... If it ain't\n(scratching)", "year": null}, {"artist": "N.W.A", "album": "100 Miles and Runnin'", "title": "Just Don't Bite It", "lyrics": "God damn, now lick my balls, oh shit\n[Bitch] You like that?\nPut 'em off\n[Bitch] It's good?\nOuch, shit, godamn bitch you bit' my damn\nShit I said suck the mothafucka, you're bitin' it, shit!\n\n[Narrator]\nHas this ever happened to you?\nDoes her teeth get in the way while she's sucking your dick?\nDoes she know how to suck a dick?\nWell, I had that same problem until my bitch went out and bought N.W.A's new book entitled \"The Art of Sucking Dick\"\n\n[Bitch]\nLesson 1 - First you grab the dick\nNext you gently lick it up and down, then insert it into the mouth\nTake it slow, don't rush it, and before you know it ..\nSPLASH!\n\n[Eazy-E]\nIt goes one for the treble, two for the bass\nShe got nut all over her face\nKick kick it ...\n\n[Verse 1: MC Ren]\nSlow is the tempo, and Ren is gonna flow\nAs I produce and illustrate you to a ho\nCaught on the late night, stamping on the base-pipe\nShe's a hype to get you on the late flight\nBut back in school she was a cutie, yo\nThen after graduation started giving up the booty\nIn school, stuck her head in a feather\nEvery time I asked her what's the time\nIt was never ever what she would talk to the Ren I'm sayin'\nI wanted a date, she wouldn't even be my friend\nBut now in the 1990's, I'd be praying that the bitch don't find me\nCause she's got a gang o' kidz nappy-heads and all dirty\nAnd she's getting pimped by a nigga that's thirty\nI saw her hanging in an alley\nRaggin to her friends how she's ho'in' in the valley\nAll by herself, doin' on the ho stroll\nComin back home late night with the bankroll\nYou know a bitch like that makes me sick\nBut I've heard that she sucks a good dick!\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Verse 2: MC Ren]\nAt a high school dance, me and the niggas bailed in\nI saw her sittin' with her friends, with the clan\nSo sexy, thought she was all that\nShe wouldn't even look at us because we wore the black hat\nShe was a stuck-up bitch on the public floor\nBut an instant prostitute behind closed doors\nOn the streets she's a late night feature\nWalking home from school, I saw her sucking a nigga's dick under the bleachers\nShe saw me and she ran and tried to hide her face\nBut a bitch full of nut couldn't escape in the chase\nA disgrace, If I ever ever saw one\nThere wasn't a nigga on the block late at night not getting done\nSo she begged me not to tell a soul\nThen I said of course, cause my dick, yo, it's harder than a totem pole\nThen again it don't concern me\nCause there's a slight chance if I fuck she might burn me\nAnd then I might have to shoot the ho\nI mean checking with the quickness just to let her know\nBut to prevent from getting sick -\nI would just prefer to let her come and suck my dick\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Verse 3: MC Ren]\nNow I was at a club on a late late Sunday\nPeeping at the bitches 'till the next day Monday\nHad a couple of drinks, so I was feeling good\nAnd suddenly I saw this bitch  that lives in my neighborhood\nShe went to church every week so now I lucked up\nShe was at the end of the bar gettin' fucked up\nBack at the house she was bitch n' be ignoring\nAnd when she start to talk the ho' was kinda boring\nYo, but now I got to dawn, see\nNow she's dancing on the floor with a skirt and no panties on\nShaking that ass like a salt shaker\nI already got my plans -\nJust while I'm a take her to a room\nBut yo I mean a rest room\nAnd stick my dick in her mouth like a wet broom\nSo I grabbed her hand and she's wit(h) it\nSo when she turns sober, she'll never admit it\nSo while she's dropped I'd better get it quick\nAnd see for myself if she sucks a good dick!\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Outro]\n\"So there you have it - a job well done (She swallowed it)\nBut for now let me get back to what I was doing\" (She swallowed it)\nGet it\nWhat the fuck suck this dick bitch\nYeah, here comes\nOoh shit, goddamn\nGoddamn\nGet it all baby, get it all\nSuck this dick, suck this dick, suck this dick for daddy baby\nSuck this dick\nYou know you like it\nSuck it\nOh she swallowed it\nShe swallowed, oh shit, get it all, get it all, suck this dick, suck this dick, suck this dick for daddy ..\nWait till I tell the fellas how you sucked this dick\nHey matter of fact, I want you to suck Dre's dick\nThen I want you to suck Yella dick\nYou already sucked Ren's dick\nYOU BOYS ARE DISGUSTING!\nJust suck my dick bitch... cause I'm a nigga wit an attitude!", "year": "1990-08-14"}, {"artist": "N.W.A", "album": "100 Miles and Runnin'", "title": "Kamurshol", "lyrics": "[The D.O.C.]\nTake me to commercial\n\n[Dr. Dre]\nThe World's most dangerous group..\n\n[MC Ren]\nOnce again; beating on your motherfucking eardrums\nIt's the niggas in black; ready to attack\nSee, y'all know what time it is\n\n[Dr. Dre]\nWhat mothafuckin time it is!\n\n[MC Ren]\nYou have witnessed, you have heard\nSo we're gonna take time out for commercial break\n\n[Dr. Dre]\nBe on a look out for the new N.W.A. album\n\n[MC Ren]\nLadies and gentlemen\nThe name of the new album is.. efiL4zaggiN\nThe name of the new album is.. efiL4zaggiN\nThe name of the new album is.. efiL4zaggiN\n\n[Eazy-E]\nYEEEEEEEEEAAAAAAAAAAHHHHHHHHHHHH MOTHERFUCKERS!!\nTHAT'S WHAT THE FUCK WE'RE TALKING ABOUT!!\nSO GO ON OUT AND BUY THAT GODDAMN ALBUM\nSTUPID MOTHERFUCKERRRRRRRRRRRRRRRS!!\n\n[DJ Yella impersonating The Boogie Man]\nHAHAHA HAHAHA HAHHA\nBUY THE FUCKIN ALBUM BITCH!!\nEfil4zaggin!!\n\n[MC Ren]\nFour bad motherfuckers\nGet off the dick motherfucker\nYo, yeah, we're back in this motherfucker\nControlling the 1990s\nSo you better step the fuck back\nIf you know; it's good for your motherfucking ass\nYo, you know what? - we're outta here..", "year": "1990-08-14"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "L.A. Is The Place", "lyrics": "[Intro: The D.O.C.]\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. is the place!\n\n[Eazy-E]\nI'm not a renegade but you wish I would\nJust because I like to hang with boys in the hood\n\n[Ron-De-Vu]\nLive in L.A. always chill on the west coast\nA Tilly Mogul got it close just I mean to boast\n\n[Eazy-E]\nI said what's up, we'll be who riding on you\nNickname Eazy-E, and I'm down with the crew\nYou come talking that trash, we'll pull your card\nIt's not the Bronx, it's L.A. but just as hard\nDon't get me wrong I like to brag on the city I own\nThe Subway R-T-D, don't ride it alone\nYou might have silly thoughts, that were insane\nBut the city I'm from, let me explain\n\n[Hook: Ron-De-Vu]\nIn L.A. there things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that were too soft\nBut don't play it sweet, or get took off\n\n[Hook: All]\nY'all know the time, it's time to get ill\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nThe city of angels.. Hollywood.. we love it\n\n[Eazy-E]\nI turned you on to the best females in the world\nI wish they all could be California girls\nLike the east where your girls wear too many coats\nBring your clothesie, runny noiseie, with a sore throat\nThat the girls in the south I cannot bust\nBecause the girls are fly and down with us\nIn the valley not the alley, misdemeanor not ball-ey\nEazy-E that's me, always chill in Cali'\n(Hollywood's a bit of beef), where the scene is raw\nOhh yeah, the strip is a trip on (South Crenshaw)\nDon't get me wrong I like to brag on the city I own\n(Boy you walk do what?) don't walk alone\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that were too soft\nBut don't play it sweet, or get took off\n\n[The D.O.C.]\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. is the place!\n\n[DJ Yella Scratches quotes from below]\nBuild with the brothers who build the old school --->\nGet a.. get a.. get a little some of that.. BEAT BOX --->\nGet get get a little some of that beat box --->\n\n[Ron-De-Vu]\nWest coast style from L.A\nYes I gets mine, it's got to be that way\nIt's sunny California that's where I be\nIf you forgot homeboy I chill with E\nIn the west I stand that's where you fall\nFila wearing a punk goes snatching it all\nRhyme by rhyme record by E\nIn the city of angels, with a devil like me\nShe's contaminated where the boys are hard\nAnd people like me don't perpetrate the fraud\nYou want to mess around, you better get wise\nWe'll find your butt, and cut you down to size\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that were too soft\nBut don't play it sweet, or get took off\n\n[Hook: All]\nY'all know the time, it's time to get L\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nCity of angels.. Hollywood.. we love it\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that were too soft\nBut don't play it sweet, or get took off", "year": "1987-11-06"}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Live Intro (1989)", "lyrics": "* Originally Part of N.W.A's concert at Arsenal Hall, California 1989\n\n[Intro: MC Ren]\nAiyyo, this is what we want you to do right now\nWe want y'all to listen up, as we're goin' on somethin' of our Greatest Hits\nFrom Straight Outta Compton, 100 Miles and Running\nAnd our new shit, the greatest shit, Niggas 4 Life..\nJust check this shit out..\n\n(*Plane on final approach over Los Angles Airport*)\n\n(*Plane Landing sound and the L.A. Police Sirens Samples started*)\n\n(*Sample of Press Printing Machines*)\n\nGIVE ME MY PASSPORT!!\nGIVE ME BACK MY PASSPORT!!\n\n[Eazy-E]\nAwww shit, man\nBlack bitches, black gangsters are at it again\n\n[Dr. Dre]\nYou are now about to witness, the strength of street knowledge..\n\n[Laylaw as a Narrator]\nStraight off the streets of Compton, dedicated and by most suckers hated\nWould you put your hands together for.. Eazy-E and N.W.A.? (*Echoes*)\n\n(*Explosion*)\n\n[DJ Yella]\nN.W.A's Straight Outta Compton Video banned by M.T.V\nN.W.A's music banned by most black Radio Stations\nN.W.A. is criticized and for what? - Tellin' it like it is..\n\n[Dr. Dre]\nYo, we ain't sellin' out\nFuck crossing over to them, let them cross over to us\n\n[Ice Cube]\nFuck them!!\nLong as motherfuckers still buyin' it, the Media ain't shit (*Echoes*)\n\n[Eazy-E]\nFuck everybody, let's do it\nYO DRE, KICK IN THE BASS!!\n\n[DJ Yella adapted quotes below over the Dr. Dre's beats]\nNiggas With Attitudes --] Dr. Dre\nNiggas With Attitudes --] Dr. Dre\nNiggas With Attitudes --] Dr. Dre\nNiggas With Attitudes --] Dr. Dre\n\nDJ Yella --] Dr. Dre\nDJ Yella --] Dr. Dre\nDJ Yella --] Dr. Dre\nEVERYBODY FREEZE --] Dr. Dre\nDJ Yella --] Dr. Dre\n\nMake some noise\nMake some noise\nSOMEBODY SCREAM!!\nAWWWWWWWWWOOOOOOOOOOWWWWWWWWWWWWWWWWW\n\nMC Ren, the Ruthless Villain --] MC Ren\nDre, the motherfuckin' Doctor --] Dr. Dre\nMC Ren, the Ruthless Villain --] MC Ren\nDre, the motherfuckin' Doctor --] Dr. Dre\nMC Ren, the Ruthless Villain --] MC Ren\nDre, the motherfuckin' Doctor --] Dr. Dre\nMC Ren, the Ruthless Villain --] MC Ren\nDre, the motherfuckin' Doctor --] Dr. Dre\n\n[Dr. Dre]\nEverybody, put your motherfuckin' hands in the air\nEverybody, put your motherfuckin' hands in the air\nPut your hands in the air\nCome on, get with it..", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Message to B.A.", "lyrics": "[Intro: Dr. Dre]\nA message to Benedict Arnold\nNo matter how hard you try to be...\nHere's what they think about you!\n\n[Answering Machine Messages]\n\n[Female caller 1]\nHello? I was at The Celebrity... and I was wonderin' how that punk Ice Cube got his ass beat by ATL!\n[Beep]\n\n[Male caller 1]\nYo! Dat nigga was sayin' he from Compton, he ain't from Compton\nHe from a planet called: \"Punk!\" It is full of pussy protein and pearl tongue\n[Beep]\n\n[Female caller 2]\nAll I wanna know is why y'all let his punk-ass in the group in the first place, when you knew what kinda bitch he was?\n[Beep]\n\n[Male caller 2]\nYeah, I was in the New Music Seminar in New York!\nAnd I watched that punk muthafucka run... while the rest of his homeboys got they ass beat!\n[Beep]\n\n[Female caller 3]\nHello? I'm callin' to say since Ice Cube was suckin' so much New York dick...can he come and eat sum of this Chicago pussy?\n[Beep]\n\n[Men]\nI smell... [3 sniffs] PUSSY!\n[Beep]\n\n[MC Ren]\nYeah, nigga; when we see yo' ass, we gon' cut your hair off and fuck you with' a broomstick!\n[Beep]\n\n[Outro: Dr. Dre]\nThink about it, punk muthafucka!", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Niggaz 4 Life", "lyrics": "[Opening dialogue]\nWhy you brothers insist on usin' the word nigga?\nDon't you know that's bringin' down the black race?\nNigga nigga nigga that's all I hear you motherfuckers talk about is nigga\nYou can do what you want, just keep it out of my neighborhood\nPersonally I think the lyrics are a bit too harsh\nI ain't no nigga, fuck that shit\nDoes everything come out your mouth got to be a 4-letter word?\nAll over this bullshit, it's just a bunch of fuckin' noise\nThe way you talk about women is bullshit, plain bullshit\nWhat you motherfuckers doin' for the black community anyway?\nMotherfucker I got kids, I don't want 'em listenin' to that bullshit\n{*hospital monitor starts beeping*}\nFuck the niggas!\nMotherfuckers need to stop\nHow can you call yourself a nigga and be proud of it?\n{*monitor stops beeping - R.I.P.*}\n[Orderly] Flatline\n[Dr. Dre] Bullshit!\n\n[Verse 1: MC Ren]\nWhy do I call myself a nigga you ask me?\nWell it's because motherfuckers wanna blast me\nAnd run me outta my neighborhood\nAnd label me as a dope dealer yo, and say that I'm no good\nBut I gave out jobs so niggas wouldn't have to go out\nGave em some dope and a corner so they could show out\nWhen the cops came, they gave a fake name\nBecause the life in the streets is just a head game\nSo therefore, to make more\nA 15-year-old black kid'll go and rob a liquor store\nAnd get shot in the process\nHe ate up a nine bullet and now he's put to rest\n\n[Verse 2: Dr. Dre]\nWhy do I call myself a nigga you ask me?\nI guess it's just the way shit has to be\nBack when I was young gettin' a job was murder\nFuck flippin' burgers, cause I deserve a\nNine-to-five I can be proud of, that I can speak loud of\nAnd to help a nigga get out of\nYo! The concrete playground\nBut most motherfuckers only want you to stay down\nBut I'm a smart motherfucker you see\nOne of the best producers in the rap music industry\nGettin' paid like a motherfucker\nA young brother, who don't give a fuck about another\nYeah\n\n[Verse 3: MC Ren]\nWhy do I call myself a nigga you ask me?\nBecause police always wanna harass me\nEvery time that I'm rollin\nThey swear up and down that the car was stolen\nMake me get face down in the street\nAnd throw the shit out my car on the concrete\nIn front of a residence\nA million white motherfuckers on my back like I shot the President\n\n[Verse 4: Dr. Dre]\nWhy do I call myself a nigga you ask me?\nBecause my mouth is so motherfuckin' nasty\nBitch this, bitch that, nigga this, nigga that\nIn the mean while my pockets are gettin' fat\nGettin' paid to say this shit here\nMakin' more in a week than a doctor makes in a year\nSo why not call myself a nigga?\nIt's better than pullin' the trigger and goin' up the river\nAnd then I get called a nigga anyway\nBroke as a motherfucker and locked away, so\nSo cut out all that bullshit\nYo! I guess I'll be a nigga for life\n\n(\"Niggas, crackers, jews!\"\n\"If there's hell below, we're all gonna go!\")\n\n[Verse 5: Eazy-E]\nNigga nigga nigga nigga nigga nigga, please\nI'm treated like a fuckin' disease\nYou say - why do I call myself a nigga so quick?\nCause I can reach in my drawers and pull out a bigger dick, yo\nNigga say nigga we cool but\nCracker say nigga, nigga knocked the fuck up\nBut I gotta be a fast nigga, to never be the last nigga\nOr I'll have to beat yo' ass, nigga\nIn the city you see action first\nThen hear about it later in a verse I curse\nBecause I'm real with this to keep my shit straight bumpin\nMurder, created by the streets of Compton\nNow get it from the underground poet\nI live it, I see it, and I write it because I know it\nAnd if you think I'm fuckin' your wife\nYou're motherfuckin' right yo, cause I'm a nigga for life\n\n[Bridge]\nI love niggas, I love niggas, I love niggas\nBecause niggas are me\nAnd I should only love that which is me\nI love that you niggas (\"niggas for life\")\n\n[Verse 6: Dr. Dre]\nNigga this, nigga that\nThe actual fact is that I'm black and bound to attract\nThe attention of another, I mean the other\nBut I'm a motherfucker that'll have 'em runnin' for cover\nYou see, I don't give a fuck about nothin'\nExcept gettin' paid, gettin' bitches, and issuin' stitches\nWhich is, all needed to read it and find a rhyme\nAnd then it's time to say, the nigga's here to stay\nBut what about the fake niggas, the house niggas\nTo get paid quick they gotta suck a fat dick\nBut N.W.A. is outta your motherfuckin' range\nWe ain't gonna change a motherfuckin' thang!\n\n[Verse 7: MC Ren]\nI call myself a nigga cause my skin won't lighten\nI call myself a nigga cause the shit that I'm writin\nHypes me, hypes other motherfuckers around me\nAnd that's the reason why they wanna surround me\nAnd ask me - why do I call myself a negro?\nAin't none of their fuckin' business cause I'll let the trigger go\nSo get out my presence and get out of my sight\nCause MC Ren is a nigga for life\n\n[Final dialogue]\nYou're a nigga 'til you die\nIf you're a po' nigga, you're a po' nigga\nIf you're a rich nigga, you're a rich nigga\nBut you never stop bein' a nigga\nAnd if you get to be educated you just an educated nigga\n(\"I can dig it!\")\n\n[N.W.A.]\nIt's plain to see, you can't change me\nCause I'mma be a nigga for life\n\n{*static noise*}\n\n[Eazy-E (singing a jingle)]\nI'm a nigga, he's a nigga, she's a nigga, we some niggas\nWouldn't you like to be a nigga too?", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "N.W.A SA PRIZE", "lyrics": "Artist: N.W.A\nTitle: Sa Prize (Part 2)\nAlbum: 100 Miles And Runnin'\nYear: 1990\n------------------------------------------------------------------------------------------------------------------------------------------------\nIntro  1\n------------------------------------------------------------------------------------------------------------------------------------------------\nLyrics:\n\nChorus:\n\nFuck the police! Fuck fuck fuck the police!\n[Fuck them motherfuckers!]\nFuck fuck fuck the police!\n[Get paid back] You're motherfucking right yo\n\nVerse One: Dr. Dre\n\nFuck the motherfucking police!\nThey don't want peace they want a nigga deceased\nSo he'll cease to be a problem and by the way the perform\nIt seems the Klan gave the white police another uniform\nAnd yo the black police, the house niggas\nThey gave you a motherfucking gun, so I guess you figure\nYou made out, good to go, but you didn't know\nThey would stick your black ass back in the ghetto, yo\nTo kill another nigga, catch him with crack, in fact\nFreebase - they put in the neighborhood in the first place\nBut the brothers ain't stupid, remember that\nYou got a gat, I got a gat, so whassup with that\nA to the motherfuckin K\nThe last words you hear, then the smoke appears\nTears, from your motherfuckin family\nThey're starin at me, but I'm goin gun happy, fuck em!\nShootin everything in sight tonight's the night to get hyped\nAnd fight for what's wrong, fuck what's right!\nAnd by the way, my name is Dre\nSo listen up motherfucker to what I gotta say, yo\n------------------------------------------------------------------------------------------------------------------------------------------------\nINTRO 2\n-----------------------------------------------------------------------------------------------------------------------------------------------\nChorus:\n\nFuck the police! Fuck, fuck, fuck the police\nFuck\nFuck, fuck, fuck the police\n[Now for the first episode]\n\nVerse Two: Eazy-E\n\nEazy E's the name feared by most\nWhen, a lil nigga is thrown in the pen\nBut on the streets there's two kinds of people\nWhite rich fucks and the ones who get harassed like me\nPull over to the side, routine for me\nTearin up my shit, like they lookin for a key of cocaine\nBut they never find the shit\nAin't got nuttin better to do and nobody else to fuck wit\nThinkin everything is stolen\nBut can't face facts that a young black nigga's just rollin\nMaking more money than they ever make\nTaking more shit than they ever take\nYo pigs are made to kill, and no regret and\nKeep your hand on your weapon shoot his ass and start steppin\nCause I'm a nigga that don't give a fuck about nothin\nSo let me explain a lil somethin, yo\n------------------------------------------------------------------------------------------------------------------------------------------------\nINTRO 3\n-------------------------------------------------------------------------------------------------------------------------------------------------\nSee, I got this problem, a big problem...\nCops don't like me, so I don't like motherfucking cops\n\nChorus:\n\nFuck the police! Fuck, fuck, fuck the police\nFuck\nFuck, fuck, fuck the police\n[Fuck the police!]\n\nPolice brutality is common in my neighborhood\nThat's why I hate them motherfuckers\n\nVerse Three: MC Ren\n\nI said fuck the police but with a little more force\nAnd maybe now I get my point across\nIt's a lot here that's goin on, just open your eyes and look\nEveryday a young nigga is took\nOff the face of the street by a police\nIt's like they gotta a nigga chained on a short leash\nYou can't leave out the city that they shacked up\nCause if you do that's the right they got you jacked up\nIt's embarassin because you know they justice, but all you can do\nIs say fuck this, because if you move, that's all she wrote\nSo what? The excuse to shoot, or they rather stomp your head\nTil you're dead with the steel toe boot\nHarassin me with some kind of mind game\nActin like a nigga just was born with a gang-name\nYou call that right but when you're black there's no right\nSome recreational shit was only a gang fight\nSo shootin at the cops was a street thing\nTo waste time have to explain don't do cocaine\nBut everything was done just for peace\nTo retaliate, on the fuckin police, so I'm sayin\n\nChorus:\n\nFuck the police! Fuck, fuck, fuck the police!\nFuck\nFuck the police! Fuck, fuck the police!", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "One Less Bitch", "lyrics": "[Intro: MC Ren + Dr. Dre]\nThe world's most dangerous group\nOnce again beating on your motherfucking eardrums\nDoing much damage for all you slutty ass ho's\n\n[Verse 1: Dr. Dre]\nYo, there was a bitch I knew on the avenue\nShe was good to G-O for a nut or two yo\nI think her name was Clara\nAnd she was guaranteed to give a motherfucka whatever he needs\nTo be perfectly honest, she was a hooker\nSo I took her a hundred yards, to the boulevard\nI told her \"I'll take care of you, you take care of me\nYou've got a P-I-M-P and all I want is the money\"\nShe went to work and the niggas were fiendin'\nYo, she had the biggest ass that you ever seen\nIn fact she was like Medusa, with titties full grown\nOne look and your dick turns to stone, yeah\nKeepin' in mind that she was the kind that would find the time to get mine\nBecause she knows I'm not to be fucked with\nShe ain't crazy\nFuckin' with Dre, she'll be pushin' up daisies\nShe was the perfect ho, but wouldn't you know\nThe bitch tried to gank me, so\nI had to kill her\nYeah, straight hittin'\nNow listen up and lemme tell you how I did it\nYo, I tied her to the bed, I was thinking the worst\nBut yo, I had to let my niggas fuck her first yeah\nLoaded up the forty-fo', yo\nThen I straight smoked the ho\nCause I'm a real nigga, but I guess you figure\nI was soft and she thank me\nCoughed to the boss and got tossed\nOne less bitch you gotta worry about\nShe's outta here and that's how it turns out\n\n[Verse 2: Dr. Dre]\nNow Vicky Vicky Vicky, she's very tricky\nShe put her hickey on top of my dick, sick betsy\nShe told me she loved me and she wanted to keep me\nIf only she can have the dick weekly\nI said I'm with it but baby you gotta hold up\nIf I was happy with somethin' that I could fold up\nWe can do this - she said her husband was rich\nThen I knew I had the bitch\nYo she wrote a check, many a check\nIn the name of a bitch who was strugglin' at the same game\nAll I wanted to do was get P-A-I-D\nJust a little somethin' for fuckin' me\nYo Everything was cool but Vicky concerned me\nHer husband was the District Attorney\nSo, before he found out he was crossed up\nBy his bitch I was fuckin' I had her tossed up\nAnd put to sleep, so a nigga never forgets\nA dead bitch can't tell a nigga shit\nOne less bitch you gotta worry about\nShe's outta here and that's how it turned out\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!\n\n[Verse 3: Dr. Dre]\nThinkin' about money, and lookin' at a prostitute\nThe bitch was cute, so now I had to execute\nAnd shoot game like a real nigga\nWith a steel trigga\nConvince her to move up to somethin' bigga\nI think I had a flashback though\nCause I said \"fuck it\"\nLoped and choked and smoked to the ho' like this:\n\"Bitch, it's all about Dre\nThe money, money, money and this all I gotta say\"\nOf course she came with me and remained with me\n'Till the bitch felt lamed and ashamed to be\nWorkin' that trick shit\nCause niggas knew that she was short one\nA little later though she caught one\nIn the chest and I knew that it was commin'\nBy who and how the all act would be done?\nSo what? One less bitch I gotta worry about\nBut that ain't how it turned out..\n\n[Verse 4: MC Ren]\nYo, there was a bitch named her out and shot her\nStraight to the muthafuckin' trigger and said \"I got her!\"\nBut I had better plans to give her the blues\nLike dumpin' her in the river with cement shoes\nI knew my money was comin' up short\nAnd the thought that the stupid bitch thought she'd never get caught\nCame home early and straight bust her ass\nOn the couch with her other nigga countin' my cash\nI should've known she was like them other hoes\nI told the two motherfuckaz to take off their clothes\nButt naked, nothin' left but the shoes\nI had up a nine so they couldn't refuse\nI shot the nigga, he was outta there\nAnd tied up the bitch to the motherfuckin' chair\nNow there's one less bitch I gotta worry about\nEverybody out, that's how it turns out\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!\n\n[Outro: Eazy-E]\nIn reality, a fool is one who believes that all women are ladies\nA nigga is one who believes that all ladies are bitches\nAnd all bitches are created equal\nTo me, all bitches are the same\nMoney-hungry, scandalous groupie hoes\nThat's always ridin' on a nigga's dick, always in a nigga's pocket\nAnd when the nigga runs out of money the bitch is gone in the wind\nTo me, ALL BITCHES AIN'T SHIT!\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "Panic Zone", "lyrics": "[Intro: Egyptian Lover]\nPanic Zone, don't get your girl in here\nA way out in here, a way out in here\nA way out in here, a way out in here\nA way out in here, a way out in here\nA way out in here, a way out in here\nPanic Zone, don't get your girl in here\nPanic Zone, don't get your girl in here\nPanic Zone, don't get your girl\n\n[Verse 1: Arabian Prince]\nIt's called the panic zone (the panic zone)\nThat's right, the panic zone\nSome people call it torture\nBut it's what we call home\n(We are the renegades of this territory\nAnd you're the prey)\nI'm the Arabian Prince (and we're N.W.A.)\nDon't interfere with the sound you here\n'Cause it's a dangerous groove\nI'm in control of your mind and soul\nDon't be afraid, just bust a move\nSo far from home\nYou're on your own\nIn the land of the unknown\nIt's the darkside, the darkside\nIt's called the panic zone\n\n[Interlude: Dr. Dre]\nDo not attempt to adjust your radio\nThere is nothing wrong\nThe underworld is taking control\nYou're not only in dimension of sight and sound\nBut of mind\nThere's a sign post up ahead, and it reads\n\"The Panic Zone\"\n\n[Verse 2: Arabian Prince]\nNow the party is at its peak\nSo we suggest you move your feet\nN.W.A. create the groove\nAnd Dr. Dre create the beat\nSo if you got the juice\nAnd you're feelin' loose\nLet the music take your mind\nThe freaks are here\nDon't interfere, our world is one of a kind\nThis place is called the west\nWest-Coast of the USA\nThe Panic Zone's home base\nIn a place we call L.A\nSo ladies, all the ladies\nIf you're all alone\nJust call Arabian Prince\nIn the panic zone (pa-pa-panic zone)\n\n[Hook: Vocoder Box sound by Egyptian Lover]\nA way out in here, a way out in here\nA way out in here, a way out in here\nA way out in here, a way out in here\nA way out in here, a way out in here\n\n[Arabian Prince]\nIce Cube is from L.A\nHe is in the (Panic Zone, Pa-Panic Zone)\nEazy-E is from Compton\nHe is in the (Panic Zone, Pa-Panic Zone)\nArabian Prince from Inglewood\nHe is in the (Panic Zone, Pa-Panic Zone)\nDr. Dre is from Compton\nHe is in the (Panic Zone, Pa-Panic Zone)\nKrazy Dee is from East L.A\nHe is in the (Panic Zone, Pa-Panic Zone)\nRon-De-Vu is from Compton\nHe is in the (Panic Zone, Pa-Panic Zone)\nC.I.A. is from L.A\nThey're in the (Panic Zone, Pa-Panic Zone)\nRappinstine is from Crenshaw\nHe is the (Panic Zone, Pa-Panic Zone)\nThe Wreckin' Cru is from L.A\nThey're in the (Panic Zone, Pa-Panic Zone)\nSmooth Man is from Carson\nHe is in the (Panic Zone, Pa-Panic Zone)\n[?] of west L.A\nHe is in the (Panic Zone, Pa-Panic Zone)\nDonovan the engineer is from the.. (Panic Zone, Pa-Panic Zone)\n\n[Outro: Vocoder Box sound by Egyptian Lover]\nThe Panic Zone, don't get your girl in here\nPanic Zone, don't get your girl in here\nPanic Zone, don't get your girl in here\nPanic Zone, don't get your girl in the Panic Zone", "year": "1987-08-13"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Parental Discretion 1z Advised", "lyrics": "One, two, three, kick it\n\n[Intro: The D.O.C.]\nAiyyo Dre, what's goin on man? What's goin on?\nAy what ch'all gonna do for this last record?\nNah tell me what cha'all gonna do?\nOkay, you want me to do the intro? Aight!\n\n[Verse 1: The D.O.C.]\nParental discretion is advised for the moment\nWhile I'm getting candid, now understand it\nAin't too typical in any way, though the pro\nOn the mic is the D.O. to the C., this is an intro\nI know The D.O.C. makes you want to take a Valium\nSo buy a bucket cause upcoming is my album\nAnd for the record, meaning my record, check it\nListen to the single and you'll be like, yo, I gotta get it\nBut in the meantime, listen to the rhyme\nOf the Dr. Dre played with N.W.A\nYella's on the drum roll, rocking the beat\nAiyyo Dre, where's you gonna take this shit man?\n\n[Verse 2: Dr. Dre]\nAiyyo, let's take it to the street (WORD UP!)\nLet 'em understand perfection\nLet knowledge be the tool for suckers to stop guessing\nCause I don't give a fuck about radio play\nObserve the English I display\nLyrics for the adults, children have been barred\nAnd scarred from listening to something so motherfucking HARD\nDope, pumping that's so my shit will never falter\nYo it's Dre so fuck the \"Mind of Minolta\"\nPsycho like no other motherfucker\nSo step to me wrong, G-O for what you N-O\nBut be warned, never will I leave like a regular\nCause I'm a little better than the regular competitor\nI use to see 'em on stage\nEarning money like a thief, but without a gauge\nUntil I got full, of clocking the lame getting pull\n(They said you wasn't gon' get paid)\nNah that's bullshit! They like it stylistic\nAnd I enchant the crowd like I'm a mystic\n(C-C-C-C) C-C-C-cameras are flashing when I'm in action\nA photo, or fresh with a flair for fashion\nPure simplicity -- see, it's elementary\nYou hear one of the hardest motherfuckers this century\nTry to comprise a word to the wise and the guys\nParental discretion is advised\n\n[Verse 3: MC Ren]\nRen is most extremely high performance\nThe black hat cause I worn this, cause it's like enormous\nSome shit I don't take it, not even in a toilet\nAnd shit from a sucker, put in a pot and I'll boil it\nTurn up the pilot as it burns\nAnd maybe the motherfuckers will learn\nI'm not a sub, cause I speak sensible\nNot considered a prince, cause I'm a principal\nI'm engineering the shit that you're hearing\nCause when it comes to power, I'm power steering\nSilly you say, I say you're silly when you say it\nRushing to the eject, to put my shit in and play it\nIt's like Apollo, but I'm not an amateur\nAnd I'm not giving a fuck while I'm damaging ya\nIt's for the record; so Ren's lyrics is gonna spin it\nAnd if there was a trophy involved, I'd win it\nPossession is mine and I'm the holder\nCause a nigga like Ren don't give a fuck cause I'm older\nSo for you to step off would be wise\nAnd say fuck it, parental discretion is advised\n\n[Verse 4: Ice Cube]\nI be what is known as a bandit\nYou gotta hand it to me when you truly understand it\nCause if you fail to see, read it in Braille\nIt'll still be funky -- so what's next is the flex\nOf a genius, my rapid-stutter-stepping if you seen this\nDope, you hope that I don't really mean this\nBut if Play made a greater high-top fade\nIt's not my trademark when I get loose in the dark\nYou guess it was a test of a different style\nIt's just another motherfucker on the pile\nDriving your ass with the flow of the tongue\nYou hung yourself shortly after knowledge was brung\nTo your attention, by the hardest motherfucking artist\nThat is known for lynching any sucker in a minute\nStagger 'em all\nWhen I start flowing like Niagara Falls\nIce Cube is equipped to rip shit in a battle\nMove like a snake when I'm mad; and then my tail rattle\nI get low on the flow so let your kids know\nWhen I bust, parental discretion is a must\n\n[Verse 5: Eazy-E]\nLittle did they know that I would be arriving\nAnd it's surprising, rocking it from where I been\nBut it's the E here to take, no mistake to be made\nIn the trade where funky ass records are being played\nFuck the regular, yo as I get better the\nBitches wanna trick and go stupid up on the dick\nSo I get 'em hot, thinking they're gonna get it\nAs they sit, rubbing their legs like a cricket\nTo you it may be funny, but\nThere's no service of beef without money\nSo slip the C-note, and you can choke\nOn a wing-ding-ding-a-ling down your throat\nForeplay to me ain't shit\nWhen you spread 'em I'm ready, then you can get the dick\nOf the Eaz, if you can deal with the size\nBut if you can't, parental discretion's advised!\n\n[Outro]\nShut the fuck up!", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "Parental Discretion Iz Advised (Edited)", "lyrics": "[Intro: The D.O.C.]\nAyo Dre, what's goin' on man? What's goin' on?\nAy what ch'y'all gon' do for this last record?\nNah tell me what ch'y'all gon' do?\nOkay, you want me to do the intro? Aight!\nParental discretion is advised for the moment\nWhile I'm getting candid, now understand it\nAin't too typical in any way, though the pro\nOn the mic is the D.O. to the C., this is an intro\nI know The D.O.C. makes you want to take a Valium\nSo buy a bucket cause upcoming is my album\nAnd for the record, meaning my record, check it\nListen to the single and you'll be like, yo, I gotta get it\nBut in the meantime, listen to the rhyme\nOf the Dr. Dre played with N.W.A\nYella's on the drum roll, rocking the beat\nAyo Dre, where's you gonna take this ---- man?\n\n[Verse 1: Dr. Dre (The D.O.C)]\nAyo, let's take it to the street (word up!)\nLet 'em understand perfection\nLet knowledge be the tool for suckers to stop guessing\nCause I don't give a damn about a radio play\nObserve the English I display\nLyrics for the adults, children have been barred\nAnd scarred from listening to something so [censored] hard\nDope, pumping that's so my rhymes will never falter\nYo it's Dre, forget the \"Mind of Minolta\"\nPsycho like no other dumb brother\nSo step to me wrong, G-O for what you N-O\nBut be warned, never will I leave like a regular\nCause I'm a little better than the regular competitor\nI use to see 'em on stage\nEarning money like a thief, but without a gauge\nUntil I got full, of clocking the lame getting pull\n(They said you wasn't gon' get paid)\nNah that's bull, yo, they like it stylistic\nAnd I enchant the crowd like I'm a mystic\n(C-C-C-C) C-C-C-cameras are flashing when I'm in action\nA photo, or fresh with a flair for fashion\nPure simplicity, see, it's elementary\nYou hear one of the hardest young brothers this century\nTry to comprise a word to the wise and the guys\nParental discretion is advised\n\n[Verse 2: MC Ren]\nRen is most extremely high performance\nThe black hat cause I worn this, cause it's like enormous\nSome trash I don't take it, not even in a toilet\nAnd trash from a sucker, put in a pot and I'll boil it\nTurn up the pilot as it burns\nAnd maybe the stupid suckers'll learn\nI'm not a sub, cause I speak sensible\nNot considered a prince, 'cause I'm a principal\nI'm engineering the funky sound that you're hearing\n'Cause when it comes to power, I'm power steering\nSilly you say, I say you're silly when you say it\nRushing to the eject, to put my tape in and play it\nIt's like Apollo, but I'm not an amateur\nAnd I really don't care while I'm damaging ya\nIt's for the record, yo, so my lyrics is gonna spin it\nAnd if there was a trophy involved, I'd win it\nPossession is mine and I'm the holder\nCause a brother like Ren don't really care cause I'm older\nSo for you to step off would be wise\nAnd say forget it, parental discretion is advised\n\n[Verse 3: Ice Cube]\nI be what is known as a bandit\nYou gotta hand it to me when you truly understand it\nCause if you fail to see, read it in braille\nIt'll still be funky, so what's next is the flex\nOf a genius, my rapid-stutter-stepping if you seen this\nDope, you hope that I don't really mean this\nBut if play made a greater high-top fade\nIt's not my trademark when I get loose in the dark\nYou guess it was a test of a different style\nIt's just another dope brother on the pile\nDriving around with the flow of the tongue\nYou hung yourself shortly after knowledge was brung\nTo your attention, by the hardest rapping artist\nThat is known for lynching any sucker in a minute\nStagger 'em all\nWhen I start flowing like Niagara Falls\nIce Cube is equipped to rip it up in a battle\nMove like a snake when I'm mad; and then my tail rattle\nI get low on the flow so let your kids know\nWhen I bust, parental discretion is a must\n\n[Verse 4: Eazy-E]\nLittle did they know, that I would be arriving\nAnd it's surprising, rocking it from where I been\nBut it's the E here to take, no mistake to be made\nIn the trade where funky dope records are being played\nDamn the regular, yo as I get better the\nGirls wanna trick and go stupid up on the tip\nSo I get 'em hot, thinking they're gonna get it\nAs they sit, rubbing their legs like a cricket\nTo you it may be funny, but\nThere's no service of beef without money\nSo slip the C-note, and you can choke\nOn a wing-ding-ding-a-ling down your throat\nForeplay to me ain't it\nWhen you spread 'em I'm ready, then you can get a hit\nFrom the Eaze, if you can deal with the size, but if you can't\nParental discretion's advised!", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Prelude", "lyrics": "[Dr. Dre]\nThe motherfucking saga continues\n\n[KMG]\nAll hail to those believin in the real gangsta shit\nCause when it comes to the real niggas\nIt makes the shit that much harder to deal with\n\n[Cold 187um]\nYeah, Above The Law up in this motherfucker\n\"Black Mafia\" for life\nDown with the real niggas for life! Ha ha\nYo Sweet Talk, tell 'em what the fuck we here for!\n\n[Kokane]\nWell alright y'all, USC, Compton, Watts\nThe Woods! All across the motherfuckin USA\nYe though I walk through the the valley of real niggas\nI should fear no man or motherfuckin Klan, hear me one\nCause I been to the mountaintops, y'all\nAnd I done seen through the eyes of a real nigga\n(Yo, what you think about the real niggas 187?)\n\n[Cold 187um]\nYo, they make some of the coooooooolest shit I done never heard!\n\n[Km.G]\nYo, for me Km.G I must give it up\nTo the Ruthless motherfuckin gangsters\nFear no mob!\n\n[Admiral Dancehall]\nBecause you're scared mon, you're scared!\nDem de pussy runnin at y'all scared mon\nBend dem silly bumba claat barber 'til de pussy claat run\nBO! BO! BO! BO! BO! Keep Baby-lon on the run, seen!\n\n[Verse 1: MC Ren]\nThe real niggas is back, cause there's too many bullshit records out\nNiggas fiendin for what we put out\nBut you don't have to wait no longer\nBecause the new album is out and the shit is much stronger\nSo many groups made three albums or more\nAnd that weak-ass shit is still sittin in the record store\nThey wonder why it never sold\nNiggas rappin since the 70's and still never went gold\nOur first record sold two million copies\nThat's because you other motherfuckers are sloppy\nYou came out street and crossed over\nAnd after that your career is fuckin over\nBecause of that you're not around\nSo shut the fuck up and witness the sound of some real niggas\n\n[Interlude: Eazy-E]\nYeah, motherfuckers!\nKeepin' all you busters on the run in '91\nKick that shit, Ren\n\n[Verse 2: MC Ren]\nMost niggas can't understand\nAnd never will if they ain't part of the Ruthless mafia clan\nNiggas is dedicated to the streets\nWith hype fuckin lyrics and the dope-ass beats\nThe songs will never come soft, because I come off\nSo don't get in my way cause motherfucker you'll get cut off\nAnd it's somethin you can move your lips to\nTo wrap around my dick and suck if it fits you\nAnd let me now if you wanna ride the D-I-C-K\nAll day that's with no play\nCause ain't no rap group out that I know\nThat make me wanna listen to the radio\nAll I hear is motherfuckers tryin to make a comeback\nWith lovesongs, and that shit is wack\nAnd that's why your ass ain't around\nCause you don't have the motherfuckin sound\nOf a real nigga\n(YEAH MOTHERFUCKERS!!!!)", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Protest", "lyrics": "[Interlude]\n[Female]\nHi!\n[ovation] [static]\n[Female]\n... and it gets excited!\n[static]\n[Female]\n... balance and illustration\n\n[Male New Archor 1]\nAnd that's tomorrow's forecast. Back to you Jim\n\n[Male New Archor 2]\nThanks, Dick! Now have a man, Hale Anderson LIVE at the arena for tonight's N.W.A\nConcert. What's goin' on down there, Hale?\n\n[Crowd]\nNo more NWA!\n\n[Reporter]\nWell, Jim the riders has getting pretty round a here\nI think we will has some fights here, and here the authorities coming on their way because they appears to me...\nSome people in black has standin' on the roof...\n[automatic gunshots]\nI hear gunshots!!\n\n[girl shouting]\n(oh my god oh my god oh my god)\nThere Please, stop! Stop!\nThere they go! Oh, wait, wait! (oh police get the police)\nTake the fuckin' camera on! 'Ey, Hart, stop!\nSTOP THE FUCKIN' CAMERA!\nI MEAN, HELP!\nSHUT THAT, SHUT THAT SHIT OFF!\nFUCK! CHARLES, TURN THE FUCKIN' CAMERA OFF, YOU MOTHAFUCKA... [beep]\n\n[Outro: Dr. Dre]\nHahahahahahaha!", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Quiet On Tha Set", "lyrics": "[Intro]\nEazy-E: Yo Ren\nMC Ren:  What up?\nEazy-E: Take one\nMC Ren: Yo\nEazy-E: Hit it\n\n[Verse 1: MC Ren]\nRuthless, plenty of that and much more\nSo at the party, Ren is controllin the floor\nThat you step and do your dance routine\nIt ain't a dream my man, you're in a gangsta scene\nWith a villain doin damage on a 24 track\nWith no confusion to finish my conclusion\nRythymatic rhymes from a radio cat\nYou can't take what I got coz I'll be takin it right back\nRuthless gangsta - Cold killin\nYou wanna know what it's means? - Definition villain\nWith the stupid dope rhyme\nSo once you hear one line you can tell it's mine\nWith a baseball cap that's black that I'm wearin\nAnd a look that keeps you all starin\nAnd wondering why I'm invincible\nBut when you hear my rhyme, it's convincible\nI don't take no shorts while I'm constructing the ground\nThat makes y'all move around to my hell of a sound\nGirls drool on me like a diamond\n(Yo Ren, tell them what they do when you start rhymin)\nI go to the party, I hip, I hop the spot\nI dunno what it is, but the girls get hot\nPerspirin' like they're on fire and\nTheir so-called boyfriends with'em are retirin\nAnd for this reason I'm a walkin threat\nSo when I'm on stage I want quiet on tha set\n\n\"Light, camera, action\" (N.W.A. take two)\n\n[Verse 2: MC Ren]\nNow to get started with my musical profession\nA gangsta or villain in mine is in session\nThe way that I'm referrin' to this makes ya move ya butt\nBut don't stand in a daze, yeah you should know what's up\nAnyway I keep em clappin' along\nCoz' nothing bad could go wrong because this song is so strong\nI'm like Toyota, who could ask for anything more\nWhen N.W.A. is cold rockin' the floor\nLike stupid, actin like a retard\nWaitin' for a bumrush, gettin' to the good part\nIt tempts me so with temptation\nWritin' my lyrics with this hyped information\nThis is a section of my creation\nSo don't say shhh! with an exclamation\nJust look at the center of the stage where the spotlight shines\n(Boy you should have known by now) It's mine!\nUnpredictable, keepin you extremely enjoyed\nIt's irresistable, meaning that you can't avoid\nAnd while I'm on stage, look forward to sweat\nBut after I rip it up I want quiet on tha' set\n\n\"Light, camera, action\" (N.W.A. take three)\n\n[Verse 3: MC Ren + Eazy-E]\nI can be loud as hell, think I will? Never\nQuiet on tha' set - Yeah I like that better\nCause what I can do I think I earn respect\nAnd if I didn't from you, that's what I expect\nCause if it ain't ruff it ain't me\nSo who really cares how you want me to be\nSee, I'm just mean staying at the top of the pile\nAnd doin' soft note tunes it ain't my style\nAnd this concludes our program\nOf how N.W.A. makes a ruthless jam\nNow first we take an average drum\nGive it to Dre, and the boy gets dumb\nIt's no secret, that I sit alone at night\nPick up a pad and pen and begin to write\nAll kinda lyrics that's promised to play\nTo make everybody say\n\n[Sample]\n\"They can be cold and ruthless no question about that\nBut sometimes it's more complicated\"\n\n(Yo Dre)\n(You know what I want you to do?)\n(Bring that beat back, bring that beat back)\n\n[Verse 4: MC Ren]\nNow MC Ren is here working like super glue\nNo matter what I do, I'm gonna stick it to you\nCause I'm the pusher, supplying the fix\nAnd this jam's so dope, it don't need a remix\nBut I'm making obstacles of enemy traps\nTo catch any MC's with the weakest raps\nCrucifyin in vain like just for usin my name\nThe definition is pain, but that's the thing o' the game\nIf they try to retreat, I catch'em one at a time\nCoz they're comittin a crime, and still promotin a rhyme\nSo, you in the back of me just listen and learn\nBecause you'll all get a chance or maybe a turn\nNow my assignment was to give a preview\nSo at my next concert I wanna see you there\nNot sittin in a chair standin on both feet, with yo hand in the air\nNow I'm about to jet out but I'll be back\nBut next time expect a more funkier track\nDeep down for your enjoyment to hear more percussion\nWith lyrics that's smooth to start some discussion\nThe prove that I'm hype and you know that's bet\nNow continue to dance coz I'm thru with tha set", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "100 Miles and Runnin'", "title": "Real Niggaz", "lyrics": "[Intro: Dr. Dre + Laylaw]\nYo, what’s up niggas and niggettes?\nN.W.A is back in this motherfucker\nAnd this is only the single\nWait until the motherfucking album comes out\nWe gone have some more of that good shit\nThe shit you just can’t fuck with\nBut yo, we ain’t finished, tell ‘em what’s up man\nYo man, there’s a gang of motherfuckers out there on the dick, man\nIn every motherfuckin' state\nWanna be like, wanna look like, wanna act like\nWanna dress like, wanna sound like muthafuckin' style stealin'\nClone ass N.W.A bitin' ass motherfuckin' everywhere man\nNon-reality seein', non-reality feelin'\nNon-reality livin' ass motherfuckers man\nHey, I don’t know, reality, it’s important to me, man\nSo fellas man, tell these niggas what it’s like in the minds of real niggas\n\n[Verse 1: MC Ren]\nPrisoner like a hostage\nYo, you should of covered your muthafucking head like an ostrich\nDeep in the dirt cause you's a sucker\nAnd you ass up high so I can kick the muthafucker\nDon’t try to hang, you best avoid\nCause my foot will be so far up your ass you’ll get hemorrhoids\nBefore you try to fuck wit Ren\nI'll put two in your ass and you'll be shitting a size 10\n\n[Verse 2: Dr. Dre]\nFirst come, first serve, whoever's got the nerve\nStep up and get what you deserve\nFrom the word of a muthafucking hip-hop maniac\nBrainiac, so what you oughta do is step the fuck back\nNow how the fuck you think a rap will last?\nWit your ass saying shit that is said in the past\nYo, be original, your shit is sloppy\nGet off the dick you muthafucking carbon copy\n\n[Verse 3: MC Ren]\nFalling deep in the drums so many of styles\nIs one of the reasons a nigga ran a hundred miles\nCheating and now beating, the crowd I kept seating\nBut weak muthafuckas biting off and they kept eating\nStyles that kept them full of bull\nCause the vocals were local in nightclubs and not getting paid in full\nThey got the nerve to cuss\nOnly reason niggas pick up your record is cause they thought it was us\n\n[Verse 4: Dr. Dre]\nYo, giving what I gotta give, doing what I gotta do\nYou don't care for me, so who gives a fuck about you\nYou can't harm me, alarm me\nCause we're the generals in this fucking hip-hop army\nThe niggas wit attitudes if you didn't know\nWe blow, flow and getting loose slow from the get go, yo\nTry us and take it\nYo, fuck this shit, Yella, kick the break in\n\n[Hook]\nIt's the real thing, you are now real, real niggas, niggas\n\n[Verse 5: MC Ren]\nYou can run, but you can’t hide, you know I'mma find'cha\nCause a nigga like Ren's only 2 steps behind'cha\nDon’t look back because you’re shaking and all scared\nA nigga in black can be your scariest nightmare\nSo sleep wit the lights on, forget that the mic's on\nDon't step on my muthafucking stage without nike's on\nDon’t say it’s psycho and then you just might go\nMentally fucked up when I let the right blow\n\n[Verse 6: Dr. Dre]\nAll these niggas wit the jibber jabber\nBut couldn't kill a fly wit a muthafucking sledge hammer\nGangstas in black are out there\nBut only because, yo, it’s the shit that we wear\nOn my muthafucking dick\nBut I'mma love it when you drop like a muthafucking brick\nSo, yo, step off, go to bed, cause if you're mislead\nYou get a muthafucking bullet in your forehead\n\n[Verse 7: Eazy-E +  MC Ren ]\nBlack, the good, the bad, the ugly, you see\nA little streetwise nigga, you know me\nRolling wit some real niggas playing for keeps\nBut you muthafuckas know who run the streets\nWit that hardcore hip-hop rap shit\nNow how much harder can another nigga get?\nTrying to be like us, sound like us, dress like us\nAshes to ashes and dust to dust\nSo nigga, nigga, nigga, nigga, nigga, nigga, please\nSince you're on the dick why don't you drop to your knees\nCause I'm a muthafucka that's out to kill\nEazy-E, a nigga that's real\n\n[Interlude: DJ Yella]\nReal niggas, straight off the streets of Compton\nQuick to get in your shit without second thought\nAnd if your ass get smoked, it's my bullet you caught\nSo if you're talking shit about the niggas in black\nBow down to the Kings in Raider hats\n\n[Verse 8: MC Ren]\nThey played out, that's what niggas were chanting\nOne nigga left and they said we ain't happening\nPeople had thought we was finished and then done wit\nBut if you think about it, yo, we really ain't done shit\nYet, so cover your ears and wipe your tears\nAnd quit sniffing all over my dick for new ideas\nAnd when the new record comes, I’ll come like a fucking bomb\nAsking for fucking money, don't buy you a fucking crumb\nYou're on the dicks of four niggas not one\nAnd when it comes to dicks, you don't even have one\nSo brace yourself to make sure you don't get fucked up\nCause if I let you slide, it’s just cause you lucked up\nDon’t come in my face again, because I'mma floor ya\nAnd if you're a bitch, I'm a fucking ignore ya\nBecause my attitude's a little bigga\nCause MC Ren is one of the real niggas\n\n[Verse 9: Dr. Dre]\nLost in a muthafucking world of madness\nSadness, but Dre is just a nigga that glad there's\nSucka muthafuckas like you, making wack jams\nBecause it only shows you how dope I am\nNever try to ignore us\nWhen I'm expressing, stand still like you're full of rigor mortis\nCause I'm a real nigga, but I guess you figure\nYou can break me, take me, but watch me pull the trigger\nDre is just a nigga with heart, a nigga that’s smart\nA nigga that’s paid to say what others are scared to play\nWe started out wit too much cargo\nSo I'm glad we got rid of Benedict Arnold\nYo, N.W.A, criticize for what we say\nBut I'm a do the shit anyway\nCause I'm the muthafucking doctor, never faking\nYo, Yella, kick the muthafucking break in\n\n[Outro: MC Ren]\nN.W.A, straight outta muthafucking Compton\nTaking over shit in all of the 1990's\nYo, Dr. Dre, DJ Yella, Eazy-E\nAnd I am MC Ren, yo, N.W.A taking over this muthafucka y'all", "year": "1990-08-14"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Real Niggaz Don't Die", "lyrics": "[Intro]\nDie nigga! We are born to die nigga\nYou've been dyin for 400 years\nNiggas know how to die\nNiggas don't know nothin else, but dying\nNiggas dream about dying\n\n[Bridge: MC Ren]\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\n\n[Verse 1: Dr. Dre]\nI got a case, of spittin in a motherfucker's face\nSo me and my ace, we got a taste\nOf a motherfucker's billy club, he took his gun and\nPut it to my head and said, \"Nigga start runnin\"\nSo tell me what's the next episode?\nIs he crazy, does he want to chase me or waste me?\nI thought, \"Run nigga run\", but I caught myself\nBecause my secondary thought was death\nI've got head and heart real, but still a motherfucker said\n\"I want another black motherfucker dead\nNiggas ain't good for shit to me\"\nCause it's a race for second class, so get your ass\nUp against the wall bitch, and then he tried\nTo jump me but the punk became a victim of a walkby\nFuckin with Dre, you get a foot up in your asshole\nIt's just another way to let you know\nNigga send them, nigga send them, nigga send them\nPunk can't fuck with me - Real motherfucking G\nStraight from the streets of the CPT\nTelling you why, real niggas don't die\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Verse 2: MC Ren]\nReal niggas don't die cause they eventually multiply\nThe niggas I'm with, they take an eye for an eye\nBecause the times are so wrong, gotta stay so strong\nNiggas gotta keep it goin on and on\nAnd don't let no paleface throw your ass in a snail race\nHave your residence occupyin a jail space\nThat's what they want to do cause the system is fucked around\nI try to let you know with the records that's underground\nThey don't give a fuck about a nigga, they would rather pull the trigger\nAnd have you in front of a barrel smilin sayin \"Cheese!\"\nSo nigga get smart and rebel back\nI'm not with that black shit so I'm not gonna yell that\nAll I see is niggas getting harassed\nAnd can't do nothin about it but get a foot in they ass, yo\nBut if every nigga grabbed a nine\nAnd started shootin motherfuckers it would put 'em in line\nAnd that's how it's supposed to be\nWhen a pussy-ass nigga try to fuck with me\nYo, because it's useless to try\nTo kill a nigga cause nigga a motherfuckin real nigga don't die!\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Interlude]\nDie nigga, everywhere you go\nNiggas dying, niggas been dyin for 400 years\n\n[Bridge: MC Ren]\nI'm a motherfuckin nigga  (with an attitude)\n\n[Verse 3: Eazy-E]\nOnly the good die young, so that makes me young and bad\nPuttin ass-kickings on the niggas that never had\nSo I guess that makes me tough shit\nStraight up gangsta, wrong nigga to fuck with\nSo how can a nigga die, when he's causin the bloodshed\nBy shoot motherfuckers in the head\nTryin to make a nigga extinct because they fear me\nBut never wanna hear me\nSo I'mma let 'em know how a nigga's livin\nTakin from motherfuckers cause nobody ain't givin\nA damn thang! To a nigga, a real nigga\nSo I'm living by the motherfuckin trigger\nCause a nigga ain't afraid of bein locked up\nI'm out of luck, so why should I give a fuck?\nBut they still want to try\nTo kill a nigga like me but motherfuckin real niggas don't die!\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Outro: MC Ren]\nYeah, a real nigga don't die!\nYeah motherfuckers!\n(\"Die, nigga!\")", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "Real Niggaz (LP Version)", "lyrics": "[Verse 1: MC Ren]\nPrisoner like a hostage\nYo, you should've covered your muthafucking head like an ostrich\nDeep in the dirt cause you's a sucker\nBend ya ass up high so I can kick the muthafucker\nDon't try to hang, you best avoid\nCause my foot will be so far up you ass, you'll get hemorrhoids\nBecause if you try to fuck wit Ren\nI'll put two in your ass and you'll be shitting a size 10\n\n[Verse 2: Dr. Dre]\nFirst come, first serve, whoever's got the nerve\nStep up and get what you deserve\nFrom the word of a muthafucking hip-hop maniac\nBrainiac, so what you oughta do is step the fuck back\nNow how the fuck you think that rap would last\nWit your ass saying shit that is said in the past\nYo, be original, your shit is sloppy\nGet off the dick you muthafucking carbon copy\n\n[Verse 3: MC Ren]\nFalling deep in the drums of so many of styles\nIs one of the reasons a nigga ran a hundred miles\nCheating and not beating, the crowd I kept seating\nBut weak muthafuckas biting off and they kept eating\nStyles that kept them full of bull\nCause the vocals were local in nightclubs and not getting paid in full\nThey got the nerve to cuss\nOnly reason niggas pick up your record is cause they thought it was us\n\n[Verse 4: Dr. Dre]\nYo, giving what I gotta give, doing what I gotta do\nYou don't care for me, so who gives a fuck about you\nYou can't harm me, alarm me\nCause we're the generals in this fucking hip-hop army\nThe niggas wit attitudes if you didn't know\nWe blow, flow and getting loose slow from the get go, yo\nTitles are takin'\nYo, fuck this shit, Yella, kick the break in\n\n[Hook]\nIt's the real thing\nYou are now\nReal, real niggas, niggas\n\n[Verse 5: MC Ren]\nYou can run but you can't hide, you know I'm a find ya\nCause a nigga like Ren's only two steps behind ya\nDon't look back, cause you're shaking and all scared\nA nigga in black can be your scariest nightmare\nSo sleep wit the lights on, forget that the mic's on\nDon't step on my muthafucking stage without Nike's on\nDon't say it's psycho and then you just might go\nMentally fucked up when I get the right flow\n\n[Verse 6: Dr. Dre]\nAll these niggas with the jibber jabber\nBut couldn't kill a fly wit a muthafucking sledge hammer\nGangstas in black are out there\nBut only because, yo, it's the shit we wear\nOn my muthafucking dick\nBut I'm a love it when you drop like a muthafucking brick\nSo, yo, step off, go to bed, cause if you're mislead\nYou get a muthafucking bullet in your forehead\n\n[Verse 7: Eazy-E + MC Ren]\nBack, the good, the bad, the ugly, you see\nA little streetwise nigga, you know me\nRolling wit some real niggas playing for keeps\nBut you muthafuckas know who run the streets\nWith that hardcore hip-hop rap shit\nNow how much harder can another nigga get?\nTrying to be like us, sound like us, dress like us\nAshes to ashes and dust to dust\nSo nigga, nigga, nigga, nigga, nigga, nigga, please\nSince you're on the dick why don't you drop to your knees\nCause I'm a muthafucka that's out to kill\nEazy-E, a nigga that's real\n\n[Interlude: DJ Yella]\nReal niggas, straight off the streets of Compton\nQuick to get in your shit without second thought\nAnd if your ass get smoked, it's my bullet you caught\nSo if you're talking shit about the niggas in black\nBow down to the Kings in Raider hats\n\n[Verse 8: MC Ren]\nThey played out, that's what niggas were chanting\nOne nigga left and they said we ain't happening\nPeople had thought we was finished and then done wit\nBut if you think about it, yo, we really ain't done shit\nYet, so cover your ears and wipe your tears\nAnd quit sniffing all over my dick for new ideas\nAnd when the new record come, I'll come like a fucking bomb\nAsking for fucking money, don't buy you a fucking crumb\nYou're on the dicks of four niggas not one\nAnd when it comes to dicks, you don't even have one\nSo brace yourself to make sure you don't get fucked up\nBecause if I let you slide, it's just cause you lucked up\nDon't come in my face again, because I'm a floor ya\nAnd if you're a bitch, I'm a fucking ignore ya\nBecause my attitude's a little bigga\nCause MC Ren is one of the real niggas\n\n[Verse 9: Dr. Dre]\nLost in a muthafucking world of madness\nSadness, but Dre is just a nigga that glad its\nSucking muthafuckas like you, making wack jams\nBecause it only shows you how dope I am\nNever try to ignore us\nWhen I'm expressing, stand still like you're full of rigor mortis\nCause I'm a real nigga, but I guess you figure\nYou can break me, take me, but watch me pull the trigger\nDre is just a nigga with heart, a nigga that's smart\nA nigga that's paid to say what others are scared to play\nWe started out wit too much cargo\nSo I'm glad we got rid of Benedict Arnold\nYo, N.W.A - criticized for what we say\nBut I'm a do this shit anyway\nCause I'm the muthafucking doctor, never faking\nYo, Yella, kick the muthafucking break in\n\n[Hook]\nIt's the real thing\nYou are now\nReal, real niggas, niggas\nYeah, motherfucker, it's the real thing\nYou are now\nReal, real niggas, niggas\n\n[Outro: MC Ren]\nN.W.A, straight outta muthafucking Compton\nTaking over shit in all of the 1990's\nYo, Dr. Dre, DJ Yella, Eazy-E\nAnd I am MC Ren, yo, N.W.A taking over this muthafucka y'all", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "N.W.A. Greatest Hits", "title": "Real Niggaz (New Version)", "lyrics": "* a different version than all previous releases\n\n[Intro: DJ Yella]\nEvery motherfucker always asks: how did N.W.A. get started!!\nWe don't know how it got started\nFuck that question, you know what I'm saying?\nIt's the same bullshit over and over\nHow did we get started?\nHow did we first meet?\n\n[MC Ren]\nPrisoner like a hostage\nYo, you should've covered your motherfucking head like an ostrich\nDeep in the dirt cause you was a sucker\nAnd your ass up high so I can kick the motherfucker\nDon't try to hang, you best avoid it\nCause my foot will be so far up your ass, you'll get hemrroids\nBefore you try to fuck with Ren\nI'll put two in your ass and you'll be shitting the size 10\n\n[Dr. Dre]\nFirst come, first serve, whoever's got the nerve\nStep up and get what you deserve\nFrom the world of the motherfucking Hip-Hop maniac\nBrainiac, so what you ought to do is step the fuck back\nBut how the fuck you think your rap would last?\nWith your ass saying shit that is said in the past\nYo, be original, your shit is sloppy\nGet off the dick, you motherfucking carbon copy\n\n[MC Ren]\nFalling deep in the drums for many of styles\nIs one of the reasons a nigga ran the hundred miles\nCheating and not beating, the crowd are kept seating\nBut weak motherfuckers biting off and they kept eating\nStyles that kept them full of bull\nCause the vocals were local in nightclubs and not getting paid in full\nAnd got the nerve to cuss\nOnly reason niggas pick up your record is cause they thought it was us\n\n[Dr. Dre]\nYo, giving what I gotta give, doing what I gotta do\nYou don't care for me, so who gives a fuck about you?\nYou can't harm me, alarm me\nCause we're the generals in this fucking Hip-Hop army\nThe niggas with attitudes, if you didn't know\nWe blow, flow and then move slow from the get Go\nYo, tie us to take it\nYo, fuck this shit, Yella, kick the break in\n\n[Chorus: Eazy-E]\nIt's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\n\n[MC Ren]\nYou can run but you can't hide, you know I'm a find you\nCause a nigga like Ren, is only two steps behind you\nDon't look back, because you're shaking and all scared\nA nigga in black, can be your scariest nightmare\nSo sleep with the lights on, forget that the Mic's on\nDon't step on my motherfucking stage without Nike's on\nDon't say it's psycho, and then you just might go\nMentally fucked up, when I let the right blow\n\n[Dr. Dre]\nAll these niggas with the gibber gabber\nBut couldn't kill a fly with a motherfucking sledge hammer\nGangsters in black are out there\nBut only because, yo, it's the shit that we wear\nOn my motherfucking dick\nBut I'ma love it when you drop like a motherfucking brick\nSo, yo, step off, go to bed, cause if you're mislead\nYou'll get a motherfucking bullet in your forehead\n\n[Eazy-E]\nBlack, the good, the bad, the ugly, you see\nA little street wise nigga, you know me\nRolling with some real niggas playing for keeps\nBut you motherfuckers know who run the streets\nWith that hardcore Hip-Hop rap shit\n[MC Ren] Now how much harder can another nigga get?\nTrying to be like us, sound like us, dress like us\n[MC Ren] Ashes to ashes and dust to dust\nSo nigga, nigga, nigga, nigga, nigga, nigga, please\nSince you're on the dick, why don't you drop to your knees?\nCause I'm the motherfucker that's out to kill\nEazy-E, a nigga that's real\n\n(Timed bomb count down*)\n\n[Break: DJ Yella]\nReal niggas, straight off the streets of Compton\nQuick to get in your shit without a second thought\nAnd if your ass get smoked, it's my bullet you caught\nSo if you're talking shit about the niggas in black (*Explosion*)\nBow down to the King's and Raider hats\n\n[MC Ren]\nThey played out, that's what niggas were chanting\nOne nigga left and they said: we ain't happening\nPeople had thought, we was finished and then done wit\nBut if you think about it, yo, we really ain't done shit\nYet, so cover your ears and wipe your tears\nAnd quit sniffing all over my dick for new ideas\nAnd when the new record comes, I'll come like a fucking bump\nAsking for fucking money, don't buy you a fucking crumb\nYou're on the dicks of four niggas not one\nAnd when it comes to dicks, you don't even have one\nSo brace yourself to make sure you don't get fucked up\nBecause if I let you slide, it's just cause you lucked up\nDon't come in my face again, because I'm a floor you\nAnd if you're a bitch, I'ma fucking ignore you\nBecause my attitude is a little bigger\nCause MC Ren is one of the Real Niggas\n\n[Dr. Dre]\nLost in a motherfucking world of madness\nSadness, but Dre is just a nigga that gladdest\nSucking motherfuckers like you, making whack jams\nBecause it only shows you how dope I am\nNever try to ignore us\nWhen I'm expressing, standstill like you're full of Rigor Mortis\nCause I'm a real nigga, but I guess you figure\nYou can break me, take me, but watch me pull the trigger\nDre is just a nigga with heart, a nigga that's smart\nA nigga that's paid; to say what others are scared to play\nWe started out with too much cargo\nSo I'm glad we got rid of Benedict Arnold\nYo, N.W.A., criticized for what we say\nBut I'ma do the shit anyway\nCause I'm the motherfucking doctor, never faking\nYo, Yella, kick the motherfucking break in\n\n[Chorus: Eazy-E]\nIt's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\nYeah, motherfucker, it's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\n\n[Hook: MC Ren w/ echoes]\nN.W.A. - Straight Outta motherfucking Compton\nTaking over shit in all of the 1990s\nYo, Dr. Dre, DJ Yella, Eazy-E and I am MC Ren\nYo, N.W.A. taking over this motherfucker y'all", "year": null}, {"artist": "N.W.A", "album": "100 Miles and Runnin'", "title": "Sa Prize (Fuck Tha Police - Part 2)", "lyrics": "[Intro]\n*Phone rings*\nSgt. Kickass: Police Department, Sgt. Kickass speaking\nThe D.O.C.: Yeah, uh, Kickass, hey it's me again\nSgt. Kickass: Hold on... hold on a fuckin' minute!\n*door opens, then closes*\nSgt. Kickass: What the fuck is your problem? I told you not to call me here! This better be some good shit\nThe D.O.C.: Yeah, yeah, yeah, I got a big one, it's going down tonight. B-B-B-But it's gonna cost you two thousand\nSgt. Kickass: Wha, you cluckerin' motherfu--\nThe D.O.C.: Listen if you wanna make the deal, you fat motherfucker! It's at 477 Savona Way, 4 A.M.! And don't fuck me!\n*phone hangs up*\n[Police 1]\nHey I don't feel good about this one man\n[Police 2]\nHey we been fuckin' doin' this for 10 years and we haven't been caught yet\n[Police 1]\nYeah I just don't know about this one\n[Police 2]\nHey just shut the fuck up and pass me a donut\n\n*phone rings*\n[Dr. Dre]\nYeah, what's happening?\n[D.O.C]\nHey what's up Dre?\n[Dr. Dre]\nAyo Doc, what's happenin' man, you hook that shit up with 5-0?\n[D.O.C]\nOh I hooked that shit up man, this shit's jumpin' off tonight\nIt oughta be happenin' at 4 in the morning\n[Dr. Dre]\nAh alright, we got somethin' for their ass\n[Police 1]\nQuiet... quiet... Sgt. said this was gonna be pretty easy\n[Police 2]\nYeah, but never underestimate those fucking niggers\n[Police 1]\nAlright are you ready?\n[Police 2]\nYeah, I'm as ready as I'll ever be\n[Police 1]\nAlright, on 3\n1... 2... 3!\n*door busts open*\n[Both Police 1 and 2]\nFREEZE MOTHERFUCKERS!\n[Eazy-E]\nShoot that motherfucker!\n[Dr. Dre]\nThat's mothafuckin' police\nPunk mothafunka\n\nSA PRIZE NIGGAZ!\n\n[Hook]\nFuck the police! Fuck, fuck, fuck the police!\n[Fuck them motherfuckers!]\nFuck, fuck, fuck the police!\n[The big payback] You're motherfucking right, yo\n\n[Verse 1: Dr. Dre]\nFuck the motherfucking police!\nThey don't want peace, they want a nigga deceased\nSo he'll cease to be a problem, and by the way the perform\nIt seems the Klan gave the white police another uniform\nAnd yo the black police, the house niggas\nThey gave you a motherfucking gun, so I guess you figure\nYou made out, good to go, but you didn't know\nThey would stick your black ass back in the ghetto, yo\nTo kill another nigga, catch him with crack, in fact\nFreebase - they put in the neighborhood in the first place\nBut the brothers ain't stupid, remember that\nYou got a gat, I got a gat, so whassup with that\nA to the motherfuckin K\nThe last words you hear, then the smoke appears\nTears, from your motherfuckin family\nThey're starin at me, but I'm goin gun happy, fuck 'em!\nShootin everything in sight tonight's the night to get hyped\nAnd fight for what's wrong, fuck what's right!\nAnd by the way, my name is Dre\nSo listen up motherfucker to what I gotta say, yo\n\n[Hook]\n\n(Now for the first episode)\n\nYeah that shit's hittin man, where the volume at?\nHold-up, hold-up, hold-up, one-time, one-time, one-time\nPut the joint out! Put the joint out!\nHey you motherfuckers want to step out of the car?\nDon't you know it's against the law to play music so god damn loud?\nShut the fuck up! Go to jail? Or gimme that shit you was just smoking\n\nMotherfuckers from high crime areas view the police as a threat\nAnd that's some shit you betta not forget\n\n[Verse 2: Eazy-E]\nEazy E's the name feared by most\nWhen, a lil nigga is thrown in the pen\nBut on the streets there's two kinds of people\nWhite rich fucks and the ones who get harassed like me\nPull over to the side, routine for me\nTearin' up my shit, like they lookin for a key of cocaine\nBut they never find the shit\nAin't got nuttin better to do and nobody else to fuck wit\nThinkin' everything is stolen\nBut can't face facts that a young black nigga's just rollin\nMaking more money than they ever make\nTaking more shit than they ever take\nYo pigs are made to kill, and no regret and\nKeep your hand on your weapon shoot his ass and start steppin\nCause I'm a nigga that don't give a fuck about nothin\nSo let me explain a lil somethin, yo\n\nSee, I got this problem, a big problem...\nCops don't like me, so I don't like motherfucking cops\n\n[Hook]\n\nEpisode Two:\nGet out of the fuckin car!\nWait a god damn minute what the hell did I do?\nHey just shut the fuck up black bitch\nWait a minute, you ain't gotta be pullin me by my motherfuckin hair! Let\nGo of my motherfuckin hair!\nHey just step the fuck back and shut up!\nGet your motherfuckin' hands off of me!\nCalm down, calm down now... listen, we're gonna go around this corner, and\nYou're gonna suck me and my partner's dicks, or you're gonna\nBe one black dead nigga bitch\n\n[The D.O.C.]\nPolice brutality is common in my neighborhood\nThat's why I hate them motherfuckers\n\n[Verse 3: MC Ren]\nI said fuck the police but with a little more force\nAnd maybe now I get my point across\nIt's a massacre goin on, just open your eyes and look\nEveryday a young nigga is took\nOff the face of the street by a police\nIt's like they gotta a nigga chained on a short leash\nYou can't leave out the city that they shacked up\nCause if you do that's the right they got you jacked up\nIt's embarassin because you know they justice, but all you can do\nIs say fuck this, because if you move, that's all she wrote\nSo what? The excuse to shoot, or they rather stomp your head\nTil you're dead with the steel-toe boot\nHarassin me with some kind of mind game\nActin like a nigga just was born with a gang-name\nYou call that right but when you're black there's no right\nSome recreational shit was only a gang fight\nSo shootin at the cops was a street thing\nTo waste time as we slanged off the cocaine\nBut everything was done just for peace\nTo retaliate, on the fuckin police, so I'm sayin\n\n[Hook]\n\n(The final episode)\n\nEpisode Three:\nHey Juan, look at the piece of ass man\nWatch out watch out watch out homes!\nOh shit man you fucked up, you hit a police car\nI didn't see that piece of caca!\nBetter act like you don't speak ingles homes\nWhat the fuck? Get your ass out of there, I've had enough\nOf your raggedy ass motherfucking shit!\nOh man no me pegues! por que me pegas? No! por favor no! No! Por que?\n\n[Hook x2]\n\nChinga tu pinche madre, pinche policias weys, pendejos, salvajes, culeros…", "year": "1990-08-14"}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "She Swallowed It", "lyrics": "[Intro: Woman]\nLesson 2 : Gently place the balls into the mouth and\nHmmmmmmmmm..\n\n[Hook]\nGet it all baby\nGet it all baby\nGet it all baby\n(What you want me to do with it?)\nDon't matter just don't bite it\n(\"She swallowed it\")\nSuck this dick for daddy\n(\"She swallowed it\")\nJuicin' at the lips\n(\"She swallowed it\")\nIt's the world's biggest dick\n(What do you want me to do with it?)\nDon't matter just don't bite it\n\n[Verse 1: MC Ren]\nSlow is the tempo - now talkin' but a nympho\nSo peep it out here goes the info\nThis is a bitch that did the whole crew\nShe get it so much we make bets on who the ho would love to go through\nAnd for the shit that she does, give her a drum roll\nBecause the dumb bitch licks out the asshole\nAnd she'll let you videotape her\nAnd if you got a gang of niggas, the bitch would let you rape her\nShe likes suckin' on dicks, and lickin' up nut\nAnd they even take the broomstick up the butt\nJust to say that she did it with a rapper\nBut the pussy was more fishy than red snapper\n\"But how many licks would it take,\" she asks\n\"To make MC Ren start gooshin' up vanilla shakes?\"\nShe took her tongue out her mouth, put it on top\nLike a cherry, started movin' it like a snake and it was very irresistable\nI couldn't pay the bitch to quit\nCuz the ho' was doin' some ol' crazy shit\nThat made me start havin' a fit'\nCuz the bitch sucked a hellified dick [suck this dick]\n\n[Hook]\n\n[Verse 2: MC Ren]\nNow one night I was at a drive-in\nAnd a car full of niggas straight drove in\nI thought they wuz commin' to start trouble but no\nFive niggas in the bucket with the neighborhood ho'\nNow what do you expect they're gonna dogg her like a doggy\nThirty minutes later and the windowz all were foggy\nAnd I'm off in my car havin' a fit cuz the bitch that I'm with\nSaid no fuckin' on the first date, shit\nAnd I'm like Damn! I wish I was in the bucket\nTo be the sixth nigga with the ho' and I can fuck it\nSo I told the bitch I was with that I'm goin' to the snack bar\nAnd got the fuck out the car\nWent to the bucket and I looked through the window\nIt was some niggas that I knew they let me in yo\nAnd my turn was like next\nI couldn't see her face, all I saw was her pussy and her chest\nI wanted to see the face, I felt I oughtta\nPeep over the seat, Oh shit! It's the preacher's daughter!\nAnd she's only 14 and a ho'\nBut the bitch sucks dick like a specialized pro\nShe looked at me, I was surprised\nBut wasn't passin' up the chance of my dick gettin' baptized\nI told the bitch to do it quick\nYou little ho' hurry up and suck my dick!\n\n[Hook]\n\n[Verse 3: MC Ren]\nNow I'm a break it down with a fact\nSince the last \"Just don't bite it\" girls don't know how to act\nSayin' that they never would suck a dick\nBut when they've tried it they couldn't quit\nCuz ninety percent of the bitches today they love that shit\nAnd those are the main ones that say they don't do it\nBut MC Ren knows the bitches are used to it\nSo fellas, next time they try to tell a lie\nThat they never suck a dick, punch a bitch in the eye\nAnd then the ho' will fall to the ground\nThen you'll open up her mouth\nPut your dick in and move the shit around\nAnd she'll catch on and start doin' it on her own\nActin' like she's tryin' to suck the meat off a chicken bone\nAnd then she won't let go\nBecause bitches suck nut out of a dick just like Drano\nGet the last drop, unclogging the pipe\nThen the stupid bitch is out doing that same shit the next night\nBecause she just can't quit\nCuz she's addicted, addicted, she's addicted, addicted\nShe's addicted to suck a good dick\n\n[Hook]", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Something 2 Dance 2", "lyrics": "Yo give me somethin' to dance to\n\nCalling the police, Calling the g-men\nCalling all americans to war on the underworld\n\n[Verse 1: Arabian Prince, Dr. Dre and Eazy-E]\nArabian Prince, back wit' a style that's hype\nNot slow and low, it's the fast type\nGetting dumb, can you hear the drums?\nYo Dre why don't you pump it up some\nI pumped it up so now what's up\nYo Yella boy, add a little cut\nWhat the hell, you think we need some bells\nYeah, homeboy, might as well\nThere it is, so now what's next\nA little ssssssssss - So find me a --\nHold it, wait a minute\nYou need somethin' else in it\nThis is what I want you to do\nFeel the groove, bust a move\nYo, yo, I'm tired, what about you?\nMan this is somethin' to dance to\n\nMan that's wack, everybody used that\nYo, why dont you bring back the other track\nYeah there you go that's what I'm sayin\nI like it when that dope stuffs playin\nReal loud, in ya ear hole\nMan let's go, I think my feet are swoll' from dancin' so damn much\nMaaaaaan, I don't give a what\nYou wanna leave? With all these females pullin on my sleeve\nI bet, you can jet, homeboy, no sweat\nThis is what I want you to do\nFeel the groove, bust a move\n(here I come to save the day)\nThis is somethin' to dance to\n\nLet the bass kick\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to\nTh-th-this is somethin ta dance to", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Something Like That", "lyrics": "[Dre]\nAh yeah, yo Ren, yo ready to do this shit ?\n[Ren]\nYeah, Dre, let's rip shit up\n[Dre]\nHey, yo Yella Boy, why don't you kick me one of them\nFunky ass beats ?\n[Ren]\nYo, we got my homeboy Eazy E in the house\n[Dre]\nCompton's definitely in the house. Yo Ren, whatta we gonna\nCall this ? Tell'em what yo name is ?\n[Ren]\nYeah something like that\n[Dre]\nAllright, let's kick this shit on the one\nKick it\n\n[Verse 1: MC Ren & Dr. Dre]\nBack by demand, now it's big as fuck\nBecause you as the public, you should know what's up\n\"Compton's in the House\" was more than gold, it was a hit\nCause it was based on some crazy shit\nSo our final conclusion has been permitted\nPunks made us a target and knew that we'd hit it\nBut that was a part of showbizz\n\n[Dr. Dre]\nHey yo homeboy, why don't you tell'em what your name is\n\n[Verse 2: MC Ren]\nWell for the record it's Ren, and for the street it's villain\nAnd strapped with a gat, it's more like Matt Dillon\nOn \"Gunsmoke\", but not a man of the law\nI'm just the baddest motherfucker that you ever saw\nSee, I peep and then I creep on a fool\nGet my bloodpressure high but still stay cool\nDig a grave of a nigga lookin' up to me\nThat really had the nerve that he could fuck with me\nWho was the man in the mass, while I was waitin' to axe\nYou know, it's MC Ren kickin' mucho ass\nGettin' respect in showbizz\nHey yo homeboy\n[Dre:]\nWhassup ?\nWhy don't you tell'em what yo name is ?\n\n[Verse 3: Dr. Dre]\nDre, the motherfuckin' doctor, bitch hopper\nThe sucker-motherfucker stopper\nBack with a vocal track that's a fresh one\nSo now, let's get the motherfuckin' session\nGoin', flowin'. It's time to start throwin' - rhymes\nSo keep in mind all the suckers I'm blowin'\nCause I'm a start showin' the time\nNever sayin' I'm the best and just goin' for mine\nUnlike a lotta suckers who claim they're gettin' busy\nWhen their records only make good frisbees\nYou need to quit runnin' off the mouth\nStop and think before you put some whack bullshit out\nIt's not difficult, in fact it's kinda simple\nTo create something funky that's original\nYou either talkin' 'bout the place to be\nWho you are, what you got, or about a sucker MC\n\n[Dre]\nOh yeah, that's what I'm talkin' about, Ren\nYou know what I'm sayin' ?\n[Ren]\nYeah, I know what you're sayin', Dre, but you\nStill ain't told'em enough, man\n[Dre]\nAllright, Allright\nWell, let's kick one more verse right here, allright\nKick it\n\n[Verse 4: MC Ren & Dr. Dre]\nThis is portable, something to fuck with yo ear\nRen and Dre will appear when the sound is clear\nTo fuck it up like we always do, and that's the trick\nSayin' some shit to make the bitches wanna suck our dicks\nBut it's an everyday thang\nCommunicating to y'all with the Compton slang\nCompton's back in the house and your appartment\nSo open your door, by the way, so we can start it\nTest the monitors and call this mic\nCause the way we feel, we're gonna fuck it up tonight\nI got my mic in my hand, with a hell of a grip\nBitches screamin' and shit, now it's a trip\nWaitin' for the grand finale, or the end\nOr stupid rhymes set by Dre and Ren\nWell, like a kid, we get new shoes and go faster\nSmilin', like hell, as we move past the\nSuckers, the motherfuckers with the ego hype\nWell we're positive and they're on a negative type\nAnd if think we're about to quit...\nMotherfucker you ain't heard shit\n\n[Dre]\nYeah, that shit was funky, you know what I'm sayin', Ren ?\n[Ren]\nI know what you're sayin', this is MC Ren and Dr.Dre\nCold kickin' it in the place\n[Dre]\nAh yeah, my mellow Eazy E in the house\nYella Boy in the house\nMy boy Ice Cube\nArabian Prince cold rockin' shit\n[Ren]\nOh yeah, hey, I'm a say whassup to my homeboys from CMW\n[Dre]\nYeah, hey, yo Ren, whatta we gonna call this shit?\n\"Tell'em what yo name is?\"\n[Ren]\nYeah something like that...", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Straight Outta Compton", "lyrics": "[Intro: Dr. Dre]\nYou are now about to witness the strength of street knowledge\n\n[Verse 1: Ice Cube]\nStraight outta Compton, crazy motherfucker named Ice Cube\nFrom the gang called Niggas Wit Attitudes\nWhen I'm called off, I got a sawed-off\nSqueeze the trigger and bodies are hauled off\nYou too, boy, if you fuck with me\nThe police are gonna have to come and get me\nOff your ass, that's how I'm going out\nFor the punk motherfuckers that's showing out\nNiggas start to mumble, they wanna rumble\nMix 'em and cook 'em in a pot, like gumbo\nGoing off on the motherfucker like that\nWith a gat that's pointed at your ass\nSo give it up smooth\nAin't no telling when I'm down for a jack move\nHere's a murder rap to keep y'all dancin'\nWith a crime record like Charles Manson\nAK-47 is the tool\nDon't make me act a motherfucking fool\nMe you can go toe to toe, no maybe\nI'm knocking niggas out the box, daily\nYo, weekly, monthly and yearly\nUntil them dumb motherfuckers see clearly\nThat I'm down with the capital C-P-T\nBoy, you can't fuck with me\nSo when I'm in your neighborhood, you better duck\n‘Cause Ice Cube is crazy as fuck\nAs I leave, believe I'm stompin'\nBut when I come back boy, I'm coming straight outta Compton\n(Compton Compton Compton)\n\n[Interlude: Eazy E (MC Ren)]\nYo, Ren! (Whassup?)\nTell 'em where you from!\n\n[Verse 2: MC Ren]\nStraight outta Compton, another crazy ass nigga\nMore punks I smoke, yo, my rep gets bigger\nI'm a bad motherfucker, and you know this\nBut the pussy-ass niggas won't show this\nBut I don't give a fuck, I'ma make my snaps\nIf not from the records, from jacking or craps\nJust like burglary, the definition is jacking\nAnd when I'm legally armed it's called packing\nShoot a motherfucker in a minute\nI find a good piece of pussy and go up in it\nSo if you're at a show in the front row\nI'ma call you a bitch or dirty-ass ho\nYou'll probably get mad like a bitch is supposed to\nBut that shows me, slut, you're composed to\nA crazy motherfucker from the street\nAttitude legit, ‘cause I'm tearing up shit\nMC Ren controls the automatic\nFor any dumb motherfucker that starts static\nNot the right hand, ‘cause I'm the hand itself\nEvery time I pull an AK off the shelf\nThe security is maximum, and that's a law\nR-E-N spells Ren, but I'm raw\nSee, ‘cause I'm the motherfucking villain\nThe definition is clear, you're the witness of a killin'\nThat's taking place without a clue\nAnd once you're on the scope, your ass is through\nLook, you might take it as a trip\nBut a nigga like Ren is on a gangsta tip\nStraight outta Compton\n(Compton Compton Compton)\n(Straight outta Compton)\n\n[Interlude: Dr. Dre]\nEazy is his name, and the boy is coming…\n\n[Verse 3: Eazy E]\n…Straight outta Compton\nIs a brother that'll smother your mother\nAnd make your sister think I love her\nDangerous motherfucker raising hell\nAnd if I ever get caught, I make bail\nSee, I don't give a fuck, that's the problem\nI see a motherfucking cop, I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see a punk pass, I smile\nTo me it's kinda funny, the attitude showing a nigga driving\nBut don't know where the fuck he's going, just rolling\nLooking for the one they call Eazy\nBut here's a flash, they'll never seize me\nRuthless, never seen, like a shadow in the dark\nExcept when I unload\nYou see a spark and jump over hesitation\nAnd hear the scream of the one who got the lead penetration\nFeel a little gust of wind and I'm jetting\nBut leave a memory no one'll be forgetting\nSo what about the bitch who got shot? Fuck her!\nYou think I give a damn about a bitch? I ain't a sucker\nThis is an autobiography of the E\nAnd if you ever fuck with me\nYou'll get taken by a stupid dope brother who will smother\nWord to the motherfucker, straight outta Compton\n(Compton Compton Compton)\n(Straight outta Compton)\n\n[Outro]\nDamn, that shit was dope!", "year": "1988-07-10"}, {"artist": "N.W.A", "album": null, "title": "Straight Outta Compton 2015", "lyrics": "Verse 1: (Backy Boo Boo)\nOh no here we go again. I am the man who is always there for you. Boy you know I am the one who makes the best lyrics because I can do so. My rap still is so ill and my gf is on the pill. Oh no wait who said that? I wanted to make a chocolate cake but you know that it is hard to make. YEAH HAHA YOU KNOW WHO IT IS\n\nChorus:\nRap to the left. But im on the right. I want to go for a ride in my car\nBut I have no money for gas. So here we go again. HAHA YEAH BOY!\n\nVerse 2: (Timmy Bear)\nOh yeah you know who I am. Timmy Bear on the track and Im eating a donut and cheese pie. Rapping because I am the man who made this song. Oh no Timmy Bear you didn't just say that because I might have to hit you for that because I am the gods true brother. I am the one who made this song and you we gon sing this all night till the morning and then maybe tomorrow. So. YEAH HAHA YOU KNOW WHO IT IS\n\nChorus:\nRap to the left. But im on the right. I want to go for a ride in my car\nBut I have no money for gas. So here we go again. HAHA YEAH BOY!\n\nBridge:\nOh no my boy is here for the true dogs on this track im gonna make it baby. I love how I am so dope when I want to top the rest. Woo woo woo woo like a bird in the sky. So here we go again\n\nChorus: x4\nRap to the left. But im on the right. I want to go for a ride in my car\nBut I have no money for gas. So here we go again. HAHA YEAH BOY!\n\nAnd you know how we bake the car", "year": null}, {"artist": "N.W.A", "album": "Straight Outta Compton (Clean)", "title": "Straight Outta Compton (Clean)", "lyrics": "[Intro: Dr. Dre]\nYou are now about to witness the strength of street knowledge\n\n[Verse 1: Ice Cube]\nStraight outta Compton, it's a crazy brotha named Ice Cube\nFrom the stupid-dope gang wit a attitude\nWhen I'm called off, I gotta sawed-off\nKick knowledge and bodies are hauled off\nYou too boy if you get with me\nThe police are gonna have to come and get me\nOff yo back, that's how I'm going out\nFor the sucka dumb brothas that's showing out\nSome start to mumble, they wanna rumble\nMix em and cook em in a pot like gumbo\nGoing off on everybody like that\nWith bass that's droppin' in your face\nSo give it up smooth\nAin't no telling when I'm down for a jack move\nHere's a murder rap to keep you dancing\nWith a crime record like Charles Manson\nYo Dre, what's the sound of my tool?\nNow you know that I'm about to act a fool\nMe you can go toe to toe, no maybe\nI'm knocking suckas out the box, daily\nYo weekly, monthly and yearly\nUntil the whole damn world see clearly\nThat I'm down with the capital C-P-T\nBoy, you can't step to me\nSo when I'm in your neighborhood, you better duck down\nCause Ice Cube will damn sure buck 'em down\nAs I leave, believe I'm stomping\nBut when I come back boy, I'm coming straight outta Compton\n\n[Eazy E]\nYo Ren\n\n[MC Ren]\nWhassup\n\n[Eazy E]\nTell em where you from\n\n[Verse 2: MC Ren]\nStraight outta Compton, a brotha with his finger on the trigger\nMore punks I take out, my rep gets bigger\nI'm a ruthless villain and you know this\nBut the suckas in the public won't show this\nBut I don't really care, I'mma make my snaps\nIf not from the records, from jacking the craps\nIt's like burglary, the definition is jacking\nAnd when illegally armed it's called packing\nKnock a fool out in a sec\nI find somebody talkin' trash and put em in check\nSo if you're at a show in the front row\nI'mma call you a sucka if you don't go with the flow\nYou'll probably get mad like a punk is supposed to\nBut that shows me, yo, you're composed to\nA crazy young brotha from the street\nAttitude legit cause I'm ready to hit\nMC Ren controls the automatic\nFor any fool in my way that starts static\nNot the right hand cause I'm the hand itself\nEvery time I pull a AK off the shelf\nThe security is maximum and that's a law\nR-E-N spells Ren but I'm raw\nSee, cause people know me as a villain\nThe definition is clear, you're the witness of a killing\nThat's taking place without a clue\nAnd once you're on the scope, you know you're through\nLook, you might take it as a trip\nBut a brotha like Ren is on a gangsta tip\nStraight outta Compton\n\n[Dr. Dre]\nEazy is his name and the boy is coming\n\n[Verse 3: Eazy E]\nStraight outta Compton\nIs a brother that'll smother your mother\nAnd make your sister think I love her\nDangerous young brotha raising hell\nAnd if I ever get caught, I make bail\nSee I don't really care, that's the problem\nWhen I see a police, I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see the punk pass, I smile\nTo me it's kinda funny, the attitude showing suckas driving\nBut don't know where the hell they going, just rolling\nLooking for the one they call Eazy\nBut here's a flash, they never seize me\nRuthless\nNever seen like a shadow in the dark\nExcept when I unload\nYou see I'll get over the hesitation\nAnd hear the scream of the one who got the lead penetration\nFeel a little gust of wind and now I'm jetting\nAnd leave a memory no one'll be forgetting\nSo what about the girl who got shot [garbled]\nYou think I give a damn about a girl, I ain't a sucker\nThis is the autobiography of the E\nAnd if you ever mess with me\nYou'll get taken by a stupid dope brother who will smother\nWord to the mother, yeah!\nStraight outta Compton\n\n[Dre]\nThat's the way it goes in the city of Compton, boy", "year": "1988-08-08"}, {"artist": "N.W.A", "album": "Straight Outta Compton", "title": "Straight Outta Compton [Extended Mix]", "lyrics": "[Intro: Dr. Dre]\nNiggas Wit' Attitudes\nNiggas Wit' Attitudes\nNiggas Wit' Attitudes\n\n[Refrain: Ice Cube]\nI'm comin' straight outta Compton\n\n[Refrain: Ice Cube]\nWhen somethin' happens in South Central, Los Angles\nNothin' happens. It's just another nigga dead (dead)\n\n[Verse 1: Ice Cube]\nStraight outta Compton, crazy motherfucker named Ice Cube\nFrom the gang called Niggas Wit' Attitudes\nWhen I'm called off, I got a sawed off\nSqueeze the trigger, and bodies are hauled off\nYou too, boy, if you fuck with me\nThe police are gonna have to come and get me\nOff your ass, that's how I'm goin' out\nFor the punk motherfuckers that's showin' out\nNiggas start to mumble, they wanna rumble\nMix them and cook them in a pot like gumbo\nGoin' off on a motherfucker like that\nWith a gat, that's pointed at your ass\nSo give it up smooth\nAin't no tellin' when I'm down for a jack move\nHere's a murder rap to keep you dancin'\nWith a crime record like Charles Manson\nAK-47 is the tool\nDon't make me act the motherfuckin' fool\nMe you can go toe to toe, no maybe\nI'm knockin' niggas out the box, daily\nYo', weekly, monthly and yearly\nUntil them dumb motherfuckers see clearly\nThat I'm down with the capital C-P-T\nBoy, you can't fuck with me\nSo when I'm in your neighbourhood, you better duck\n'Cause Ice Cube is crazy as fuck\nAs I leave, believe I'm stompin'\nBut when I come back, boy, I'm comin' straight outta Compton\n\n[Interlude: MC Ren]\nY'all, a-oh, a-oh\n\n[Interlude: DJ Yella]\nCity of Compton!\nCity of Compton!\n\n[Eazy-E & Mc Ren]\nYo, Ren\nWhat's up?\nTell them where you from!\n\n[Verse 2: MC Ren]\nStraight outta Compton, another crazy ass nigga\nMore punks I smoke, yo, my rep gets bigger\nI'm a bad motherfucker and you know this\nBut the pussy ass niggas won't show this\nBut I don't give a fuck, I'ma make my snaps\nIf not from the records, from jackin' the crops\nJust like burglary, the definition is jackin'\nAnd when I'm illegally armed, it's called packin'\nShoot a motherfucker in a minute\nI find a good piece of pussy, I go up in it\nSo if you're at a show in the front row\nI'ma call you a bitch or dirty-ass ho'\nYou'll probably get mad like them bitches are 'posed to\nBut that shows me, slut, you're composed to\nA crazy motherfucker from the street\nAttitude legit, 'cause I'm tearin' up shit\nMC Ren controls the automatic\nFor any dumb motherfucker, that starts static\nNot the right hand 'cause I'm the hand itself\nEvery time, I pull a AK off the shelf\nThe security is maximum and that's a law\nR-E-N spells Ren but I'm raw\nSee, 'cause I'm the motherfuckin' Villain\nThe definition is clear, you're the witness of a killin'\nThat's takin' place without a clue\nAnd once you're on the scope, your ass is through\nLook, you might take it as a trip\nBut a nigga like Ren is on a gangster tip\nStraight outta Compton!\n\n[Interlude: DJ Yella]\nCity of Compton!\nCity of Compton!\n\n[Dr. Dre]\nEazy is his name and the boy is coming;\n\n[Verse 3: Eazy-E]\nStraight outta Compton, is a brother that'll smother your mother\nAnd make your sister think I love her\nDangerous motherfucker raising hell\nAnd if I ever get caught, I make bail\nSee, I don't give a fuck, that's the problem\nI see a motherfuckin' cop I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see a punk pass, I smile\nTo me it's kind of funny, the attitudes showin' a nigga drivin'\nBut don't know where the fuck he goin', just rollin'\nLookin' for the one they call Eazy\nBut here's a flash, they never seize me\nRuthless! Never seen like a shadow in the dark\nExcept when I unload, you see, it's about to over the hesitation\nAnd hear's the scream of the one, who got the last penetration\nGive a little gust of wind and I'm jettin'\nBut leave a memory no one'll be forgettin'\nSo what about the bitch who got shot? Fuck her!\nYou think I give a damn about a bitch? I ain't a sucker!\nThis is the autobiography of the E, and if you ever fuck with me\nYou'll get taken, by a stupid dope brotha' who will smother\nWord to the motherfucker, straight outta Compton\n\n[Outro: DJ Yella]\nCity of Compton!\nCity of Compton!", "year": "1989-03-27"}, {"artist": "N.W.A", "album": null, "title": "Straight outta compton - extended version", "lyrics": "[Ice Cube]\nI'm comin' straight outta Compton\nWhen something happens in south of central Los Angeles\nNothing happens, it's just another n**** dead\n\nVerse One: Ice Cube\nStraight outta Compton, crazy motherf***er named Ice Cube\nFrom the gang called n****z With Attitudes\nWhen I'm called off, I got a sawed off\nSqueeze the trigger, and bodies are hauled off\nYou too, boy, if ya f*** with me\nThe police are gonna hafta come and get me\nOff yo a**, that's how I'm goin out\nFor the punk motherf***ers that's showin out\nN****z start to mumble, they wanna rumble\nMix em and cook em in a pot like gumbo\nGoin off on a motherf***er like that\nWith a gat that's pointed at yo a**\nSo give it up smooth\nAin't no tellin when I'm down for a jack move\nHere's a murder rap to keep yo dancin\nWith a crime record like Charles Manson\nAK-47 is the tool\nDon't make me act the motherf***in fool\nMe you can go toe to toe, no maybe\nI'm knockin n****z out tha box, daily\nYo weekly, monthly and yearly\nUntil them dumb motherf***ers see clearly\nThat I'm down with the capital C-P-T\nBoy you can't f*** with me\nSo when I'm in your neighborhood, you better duck\nCoz Ice Cube is crazy as f***\nAs I leave, believe I'm stompin\nBut when I come back, boy, I'm comin straight outta Compton\n\nChorus:\n[City of Compton, City of Compton]\n[Eazy E] Yo Ren\n[MC Ren] Whassup?\n[Eazy E] Tell em where you from!\n\nVerse Two: MC Ren\nStraight outta Compton, another crazy a** n****\nMore punks I smoke, yo, my rep gets bigger\nI'm a bad motherf***er and you know this\nBut the p**** a** n****z won't show this\nBut I don't give a f***, I'ma make my snaps\nIf not from the records, from jackin the crops\nJust like burglary, the definition is 'jackin'\nAnd when illegally armed it's called 'packin'\nShoot a motherf***er in a minute\nI find a good piece o' p****, And go up in it\nSo if you're at a show in the front row\nI'm a call you a b**** or dirty-ass ho\nYou'll probably get mad like a b**** is supposed to\nBut that shows me, slut, you're composed to\nA crazy muthaf***er from tha street\nAttitude legit cause I'm tearin up s***\nMC Ren controls the automatic\nFor any dumb muthaf***er that starts static\nNot the right hand cause I'm the hand itself\nEvery time I pull a AK off the shelf\nThe security is maximum and that's a law\nR-E-N spells Ren but I'm raw\nSee, coz I'm the motherf***in villain\nThe definition is clear, you're the witness of a killin\nThat's takin place without a clue\nAnd once you're on the scope, your a** is through\nLook, you might take it as a trip\nBut a n**** like Ren is on a gangsta tip\nStraight outta Compton...\n\nChorus:\n[City of Compton, City of Compton]\n[Dr. Dre] Eazy is his name and the boy is comin...\n\nVerse Three: Eazy-E\n...straight outta Compton\nIs a brotha that'll smother yo' mother\nAnd make ya sister think I love her\nDangerous motherf***er raises hell\nAnd if I ever get caught I make bail\nSee, I don't give a f***, that's the problem\nI see a motherf***in cop I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see a punk pass, I smile\nTo me it's kinda funny, the attitude showin a n**** drivin\nBut don't know where the f*** he's going, just rollin\nLookin for the one they call Eazy\nBut here's a flash, they never seize me\nRuthless! Never seen like a shadow in the dark\nExcept when I unload, see I'll get over the hesitation\nAnd hear the scream of the one who got the last penetration\nGive a little gust of wind and I'm jettin\nBut leave a memory no one'll be forgettin\nSo what about the b**** who got shot? f*** her!\nYou think I give a damn about a b****? I ain't a sucka!\nThis is the autobiography of the E, and if you ever f*** with me\nYou'll get taken by a stupid dope brotha who will smother\nWord to the motherf***er, straight outta Compton\n\nChorus:\n[City of Compton, City of Compton]\n[And that kind of s*** you can't sweep up under no rug you know]", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "The Dayz Of Wayback", "lyrics": "[Intro]\nWhat we gonna do right here is go back\n\n[Verse 1: MC Ren]\nNow this is some shit that's from the days of wayback\nWhen niggas in Compton first started to jack\nWhen the bitches wouldn't give you no pussy if you wasn't sellin' drugs\nSo many bitches in my neighborhood got mugged\nThey always loved that shit, they want a nigga that's sellin' keys\nBut nowadays they workin' at Mickey D's\nBut in the days of wayback, I couldn't be laid back\nBecause I needed ends and I made that\nI get the nine from my nigga that he lend me and\nStart robbin' muthafuckas, just like cowboys and indians\nAnything it took to get paid\nA nigga like Ren already had the plan made\nAnd I was in it to win it and not to lose\nAnd shit, it start blowin' up, once I lit the fuse\nAnd police couldn't touch me because I was payin'em\nBut not with no money, yo, I was sprayin' 'em\nAnd never get caught because nobody is snitch\nBut one ho did - so Ren had to shoot the bitch!\nNow she's in a coffin and my life is better off and\nCause everybody knows who's the bossin':\nThat black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\nSo listen to me as I reminisce the days of wayback\nSo check it out y'all\n\n[Verse 2: Dr. Dre]\nIt was once a time in the days of wayback\nWhen niggas was gettin' jacked\nIn fact it was one I used to pass through up\nAnd kickin' ass through up\nMuthafuckin' Compton Massacre...\nNow let me tell you a little something about Compton\nWhen I was a kid and puttin' my bid in\nYo, Compton was like still water - just strictly calm\nNow it's like muthafuckin' Vietnam\nEverybody killin', tryin' to make a killin'\nNiggas stealin', muthafuckas willin' to dealin'\nWith so many ways to come up\nThe average nigga didn't give a fuck\nAbout another muthafucka in this game and\nClaimin' what he claimin'\nLivin' like he livin'\nKillin' after killin'\nMurder was a dirty job. To rob a dead man\nWas the best plan cause a dead man never ran\nBut now your best friend is your worst friend\nGreed, cash the fee. Make a me more some of what you holdin'\nSo now your shit is stolen\nAnd you and your niggas start rollin'\nYo, to get your shit back ain't a word of\nMuff? It's more murder, more murder, more murder\nThey wanna make you think that it's a crack thang\nOr a black thang\nOr some niggas in a muthafuckin' gang...\nBut guns and money they go together like the Ku Klux Klan\nA nigga brung up and strung up\nWhy do I call myself a nigga you ask me?\nRememberin' the days that's past me...\nYo, never givin' niggas a chance to rest\nThe ghetto is like a fuckin' survival test\nAnd number one way for you to pass\nYo, get treated like a king and they'll crown your ass\nThey never in the wrong though\nSo I made a song so\nMuthafuckas would know\nIf your livin' situations make you wanna get a gat...\nThat's cause you livin' in the Dayz of Wayback...\n\n[Outro]\nSurprise, niggas!\nYou don't think i can do it again, bitch... Another album... The jokes on you Jack... We did it again... Let's go, LL...", "year": "1991-05-28"}, {"artist": "N.W.A", "album": null, "title": "To Kill a Hooker", "lyrics": "{Dr. Dre} man I need sum muthafuckin pussy. {MC Ren} hell yea get sum bitches around dis muthafucka {Eazy-E} I don't need shit (Dr. Dre) bust a left up here on sunset (MC Ren) iight. Check it out there go sum bitches right there. (Dr. Dre) just pull over just pull over (Dr. Dre) a yo bitch cum here let me talk to you foe a minute. (Hooker) huh? What? U talkin tah me? (Eazy-E) nah ya mama bitch, u kno who da fuck we talkin bout. (Dr. Dre) get yo muthafuckin ass ova here. (Hooker) watchu want big boy (MC Ren) wassup wassup (Hooker) watchu mean wassup what kinda money you talkin bout. (MC Ren) money? Bitch you betta open up yo mouth and suck my dick. (Hooker) yo dick ill----- (MC Ren) grab dat bitch grab her grab dat bitch (Dr. Dre) get yo muthafuckin ass in the car fuck dat muthafucka. (Hooker) let me go let me go (Eazy-E) I ain't fuckin dis bitch (3x gunshots) fuck dis bitch man. (MC Ren) fuck wrong wit you man shootin dis bitch in my shit (Eazy-E) u shoulda neva put da bitch in the goddamn car anyway. (MC Ren) shit all ova da seats man. (Dr. Dre) man fuck dat bitch man there go sum mo bitches ova there blow tha muthafuckin horn", "year": null}, {"artist": "N.W.A", "album": "Niggaz4Life", "title": "To Kill a Hooker (Interlude)", "lyrics": "Dr. Dre: Yo man I need some muthafucking pussy\nMC Ren: Hell yeah, bitches around this muthafucka\nEazy-E: I don't need shit\nDr. Dre: Bust a left up here on Sunset, aight\nMC Ren: Yo check it out, there go some bitches right there, you want me to pull over?\nDr. Dre: Yeah pull over, pull over\nDr. Dre: Ayo bitch come here, let me talk to you for a minute\nHooker: What? You talkin to me?\nEazy-E: Nah ya mama bitch, you know who the fuck we talking bout\nDr. Dre: Get yo muthafuckin' ass over here\nHooker: Well what you want big boy?\nMC Ren: Ey wassup, wassup\nHooker: What you mean \"wassup\", what kinda money you talking bout?\nMC Ren: money? Bitch you better open up yo mouth and suck my dick\nHooker: What kinda money you talkin about  black ass or keep walking on now wassup baby?\nMC Ren:  suck dick bitch\nMC Ren: grab dat bitch, grab dat bitch\nDr. Dre: get yo muthafuckin ass in the car\nMC Ren: grab dat grab dat bitch  (wha wha) fuck that motherfucker in the a fuck that motherfucker in the a\nHooker: let me go let me go come on let me go\nEazy-E: I ain't fuckin this bitch (3x gunshots) fuck this bitch man\nMC Ren: fuck wrong wit you man shootin' this bitch in my shit\nEazy-E: u shoulda never put the bitch in the goddamn car anyway\nMC Ren: shit all over the seats man\nDr. Dre: aye man fuck that bitch man now throw ya mothafucking hands out there go sum mo bitches over there blow the muthafuckin horn", "year": "1991-05-28"}, {"artist": "N.W.A", "album": "N.W.A. And The Posse", "title": "Tuffest Man Alive", "lyrics": "[The D.O.C.]\nThis ain't no basic hip-hip you make up in your garage\nI'm down for showing all you hoes who the hell's in charge\nA cold lethal rap warrior, I'm on the attack\nCutting ducks no slack so keep your bitch ass back\nDeadly, yeah kicking it, the solo style\nOn top of the pile, the reigning chump worthwile\nHanging tough I'm the leader, ain't no need to pretend\nLike an elevator up, I mean I'm on the ascend\nI ain't no east coast rapper, this is a southerner's song\nBe warned, it's hard to try and hold a project born\nSaying shit that you like, never wearing no Nike\nFucking it up and all I need is my goddamn mic\nAnd a micstand, I don't need no band to play\nWith a DJ like Rock and a partner like K in effect y'all\nFucking suckers up like five\nIt's Fila Fresh and I'm the toughest man alive!\n\n[DJ Rock]\nNa-na-na-na-na-naaaaa-nah\n[Fresh K]\nYo, yo nigga you know you can't even fuck with this\nDo it, do it\n[DJ Rock]\nNa-na-na-na-na-naaaaa-nah\n[Fresh K]\nYo, fool, you know you need to jet the fuck off\nGet the fuck out my face\n\n[The D.O.C.]\nDown from the beginning, hitting hard I'll admit\nThey keep offering me money and I keep taking the shit\nAnd coolin' cool at the crib cause being cool's how I live\nBut bucking up will get you rocked if you're a bullshit kid\nI like it stylistic, c'mon let's get with it\nComing up with fresh new rhymes like I'm a mystic\nYou see the D.O.C. and all the Fila I be splurging\nYeah, I know it, you think that I'm encouraging\nYou to step wrong boy, so I can go off\nA quick run and when I'm done you bet not cough\nI'm an annihilator, standing a full 6'3\"\nAnd I really don't think you wanna fuck with me\nBut then there's always those, clocking all your shows\nGetting all out of line trying to impress they hoes\nI know some niggas like that round the way who won't quit\n\"It's the old top\" Man shoot that muthafucking shit\nI'm physically tough, physically able I qualify\nDon't try that gangster bullshit here, this ain't no I Spy\nYou better chill out, that's if you wanna survive\nIt's Fila Fresh and we're the toughest men alive\n\n[Fresh K]\nYeah, for all you suckers who thought I was down, that's right\nKicking that bullshit, yeah we in effect, that's right\nHolmes, we in effect so get your bitch ass back before you\nBe floating up a creek, know what I'm sayin?\n\n[DJ Rock]\nFloat, float on...\n\n[Fresh K]\nYeah, and if you want your beast to be deaf, call Dre before Monday!", "year": null}]