[{"artist": "Eazy-E", "album": null, "title": "24 Hours To Live (Remix)", "lyrics": "[Verse 1: MC Ren]\nNigga give me 24 more\nI take my shit and villain be out the fucking door\nThe only thing I can to is grab my nuts slow\nWhile y'all be chasing pussy, wasting time, getting blown\n\n[Verse 2: Eazy-E]\nSky diving, scuba diving\nTo Evel Knievel stunt car drivin'\nBungee cord jumpin' off a bridge\nIt's hard to breathe with a fractured rib\nI can't take this shit\nLet me see how much more time I got to spend\nHit more skins\nBack up in her pussy\nUp in the butt\nI gotta let off\nA few more nuts\nI'm starting to panic\nI'm starting to sweat\nCause I don't really wanna die yet\nDizzy spells, flashbacks in my head\nNiggas ain't want me to bein' happy when I'm dead\nBut I ain't goin' out unless 30 niggas die\nI'm dying anyway so I'm thinking suicide\nRun into a crowd of niggas dyin' by the pistol\nTook the motheruckin' whistle\n\n[Verse 3: MC Ren]", "year": null}, {"artist": "Eazy-E", "album": "Ruthless Records 10th Anniversary: Decade of Game", "title": "24 Hrs to Live", "lyrics": "24 hours to live...\n24 hours to live...\n\nSeven-thousand, four hundred, twenty three grains\nOf sand drop from the hourglass\nIt's how much time I got left on this planet\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born\nToo late, big mistake in '72\nIt's '92, now the year of code blue\n15 hours..11 minutes..30 seconds\nI'm a motherfuckin' wreck\nGonna pay back niggas who did me wrong in the past\nMy days ain't long\nI'm comin' strong and fast\nLock up 8 niggs..kill up 10 pigs\nInnocent and fuckers are also dyin, too\nNow what else can I do?\nFuck, fuck, fuck and plant my seeds\nLeavin' kids in this world like me\nThe lunatic psycho mutherfucka Eazy-E\n\nChorus (sang)\n24 hours to live\nBut I don't wanna die\n24 hours to live\nOh why, oh why?\nMust die\n\nSky diving, scuba diving\nTo Evel Knievel stunt car drivin'\nBungee cord jumpin' off a bridge\nIt's hard to breathe with a fractured rib\nI can't take this shit\nLet me see how much more time I got to spend\nHit more skins\nBack up in her pussy\nUp in the butt\nI gotta let off\nA few more nuts\nI'm starting to panic\nI'm starting to sweat\nCause I don't really wanna die yet\nDizzy spells, flashbacks in my head\nNiggas ain't want me to bein' happy when I'm dead\nBut I ain't goin' out unless 30 niggas die\nI'm dying anyway so I'm thinking suicide\nRun into a crowd of niggas dyin' by the pistol\nTook the motheruckin' whistle\n\nChorus\n\nTo sweep with the feet when he hit the concrete\nChop him up, dice him up and sacrifice his meat\nDrag him by his ankles to the cemetary\n(Screams)\nShut the fuck up nigga\nCause you ain't seen shit\nI'm 'bout to take this blade and staight up grip\nI'm holdin' the neck of the devil and drink his blood\nAllowing my soul to be polluted by his evil root\nAnd now I'm mad insane, red as rose as I strain for my hearbeat\nTo thumpety-thump to pump, it might burst\nFalse alarms, and no harm that will commit to the E\nBut now I'm down to an hour 23\nTime is moving fast, but not that slow\nI thought I had an hour, but it's seconds left the go\nI ran into the office\nNo more time is left\nI ran up to the doctor with a bomb to my (BOOM)\n\nChorus\n\nSpoken:\nAs I lay me down to sleep\nI pray the lord my soul to keep\nAs time winds down to it's last 24 hours\nIn an earth that weighs 60 trillion tons\nTravelling 1,037 1/3 mph, how do you define time?\nWhat is a minute?\nHow important is an hour when 24 hours becomes a lifetime\n\nOooooh, so define how do we define time?\nNow you choose\nHow will you spend your last 24 hours?\nC'mon..talk to me\n\n3X Chorus (\"must die\" is faded into next chorus loop)", "year": "1998-03-24"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "2 Hard Mutha's", "lyrics": "[Intro]\nEazy-E: Yo Dre, where's the goddamn drum machine?\nDr. Dre: Ah shit, I left the motherfucker with Pooh\nEazy-E: You dumb motherfucker what the fuck we gon' do now?\nDr. Dre: I don't know\nYella: Hey man I got some drums in the back\nDr. Dre: What the fuck is he talking bout\nMC Ren: Do we look like we can play some fucking drums?\nYella: Man I can play the drums\nEveryone: Bullshit!\nYella: Man I used to fuck it up at Compton High\nEazy-E: You motherfucking high\nMC Ren: You fat guy\nYella:  Bullshit!\nMC Ren: Give this nigga some sticks\n*Drum roll*\nMC Ren: Yo, fuck it up Yella\n\n[Verse 1: MC Ren]\nYo we're two hard motherfuckers\nTaking out any punk ass suckers\nCan you believe this? if so be frightened\nWe're strong as fuck, with the power of a titan\nSetting a mark of destruction get it\nSo don't front, and say you ain't with it\nYou wanna rumble with us you can't hang\nBecause we're something like a two man gang\nStarting some shit is what we do best\nJust care about ourself and say fuck the rest\nSo yo Eazy (wassup), bust it and shoot to kill\nAnd tell these stupid motherfuckers the deal\n\n[Verse 2: Eazy-E]\nI look you dead in the eye then I spit (yeah)\nI tell you to your face punk you ain't shit (you ain't shit)\nI don't give a god damn about feelings\nI'm just happy just as long as I'm killing\nA 187's in progress, nigga\nJust as soon as I pull this trigger\nAutomatic heavily, I start firing\nAnd the kids on the block, I'm the one they're admiring\nA bad mouth nigga on the violent tip\nI catch you talking some shit and I'mma bust your lip\nNow who you gonna tell that I'm making you soft\nThe police ain't shit cause I'm paying 'em off\nI move slow, always ready to go so fuck it (so fuck it)\nAnd bitches on my dick, they know that they can suck it\nI'm a hardhead, always having a fit\nWhen I'm not allowed to tear up shit\nI'm a hard motherfucker (I'm hard motherfucker)\n\n[Hook]\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\n\n[Verse 3: MC Ren + Eazy-E]\nNow look at me I'm a crazed bitch\nWith a gangster profanity pitch\nRen is a nigga that don't give a fuck\nTo a pussy ass fool trying to press his luck\nI'm ready to scrap that's if you're ready to go\nI'll take you out going toe to toe\nE will start a conversion and hit you from the back\nWhile you getting fucked by a ruthless jack\nCritical condition is what you receive\nThinking of some back up to go and retrieve\nBut Eazy tell what would happen my man\nThey would get fucked up by a ruthless clan\nSo it's simple, we don't give a fuck, right?\nSo you and your boy can get the fuck out my sight\nI'm on tilt with class getting ready to blast\nCause I'm a hard motherfucker\n\n[Hook]\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\n\n[Verse 4: Eazy-E + MC Ren]\nEazy and Ren is fucking it up again\nScheming up a plot before we begin\nBecause niggas like to stare like a bitch sometimes\nThey say how could them niggas have some hell of a rhymes\nIt's simple tell 'em what we mean\nWhen the two baddest motherfuckers step on the scene\nNow this is some shit -  Yo what are you saying\nYou stupid motherfuckers, they think I'm playing\nTalking all kind of shit of shit but I'm cracking it up\nI can afford to laugh cause I'm backing it up\nI'm not a buster I'm more like a hitman\nSo if you don't wanna throw then you can get down\nYou don't like the fuck away from me\nSo you can stop the shit, trying to fuck the E\n\n[Verse 5: MC Ren + Eazy-E]\nYou heard what he said and it's the truth so whats up\nSo if you want me to go well I'm about to nut up\nThe two baddest motherfuckers alive\nSo I don't think that you and your boys can survive\nYou gotta girl, well if she's good to go\nI bet me and E already fucked the ho\nA train was in effect and your bitch was rocked\nBy a hell of a nigga that was hard to stop\nYo Ren lets jet let's get the fuck on out\nBecause everybody knows what we're talking about\nWe're two hard motherfuckers\n\n[Hook]\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\nTwo of the hardest motherfuckers\n\n[Outro: MC Ren]\nLike that like that\nBreak it down again, come on Yella break it down\nCan I get a another role (one time)\nIt little simple for you\nBreak it down to break shine\nLet me get a funky role right here\nAight on the 3, on the 2\nAh yeah here we go y'all, break it down on the 1\nHere we go, let me get a funky role right here\nTwo times, two time, two time..", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": null, "title": "8-Ball", "lyrics": "I dont drink *** monkey\nLike the beat funky\nNick name Eazy-E\nYo 8-Ball Junkie\nBass drum kickin\nTo show my sh*t\nRappin holdin of my d*ck\nBoy I dont quit\nCrime rappin mutha f*cka\nFrom around the way\nI gotta sick shooter\nYo mean hombre\nRollin through the hood\nTo find the boys\nKick dust and cuss\nCrank up some noise\nPolice on my drawers\nI have to pause\n40 ounce in my lap\nAnd it's freezin my balls\nI Hooked a right turn\nLet the boys go past\nAnd I say to myself\n'They can kiss my a**'\n** Get drunk got the 8 in my lips\nPut in the old tape\nMarvin Gayes Greatest hits\nTurn the shit up\nHave the base cold rompin\nCrusin through the East Side\nSouth of Compton\nSee a big a**\nAnd I said 'word'\nI took a look at the face\nAnd the bitch was to the curb\nHoe on my tipp\nFor the title I'm holdin\nEazy-E's F*cked up\nAn got the 8-Ball rollin'\nCourus\n(I was)\nWho Kickin' a**?\n(I was)\nRaised in LA\n(I was)\nCrusin down the street in my 6-4\n(to much posse)\nRidin Los Loses\nLookin for Crenshaw\nTurned down the sound\nTo diss the law\nStopped at a light\nAnd had a fit\nCause a Mexican almost\nWreaked my shit\nFlipped his a** off\n** to the floor\nBottle was empty\nSo I went to the store\nNigga on tilt\nCause I was drunk\nSeen a sissy a** punk\nHad to go in my trunk\nReached inside\nCause it's like that\nCame back out\nWith a silver gat\nFired at the punk\nAnd it was all because\nI had to show the nigga\nWhat time it was\nPut up the Jam\n\nIt ends like a mirage\nA sissy like that\nGot out of dodge\nSuckers on me\nFor the title I'm holdin\nEazy-E's F*cked up\nAnd got the 8-Ball rollin\n(F**k It Up ya'll) x6\n(YEAH)\nOld East 800\nCause thats my brand\nTake it in a bottle\n40, Quart, or Can\nDrink it like a mad man\nYes I do\nF**K the police\nAnd a 502\nStepped in the party\nI was drunk as hell\nThree b**ches already said\n'Eric yo breath smells'\n40 ounce in hand\nThats what I got\n(Yo man you see Eazy hurlin in a parking lot)\nStepped on yo foot\nCold dissed yo hoe\nAsked her to dance\nAnd she said 'hell no'\nCalled her a b**ch\nCause thats the rule\nBoyz in the hood\nTryin to keep me cool\nYou tell my homeboy\nYou wanna kick my but\nI walked in your face\nAnd we get them up\nI start droppin the dogs\nAnd watch you fold\nStraight dumb fulla cum\nGot knocked out cold\n(Made you look sick\nYou snotty nosed prick\nNow yo fly b**ch\nIs all over his d**k)\nPunk got dropped\nFor the title I'm holdin\nEazy-E's f*cked up\nAnd got the 8-Ball rollin\nCourus\nPass the brew M*tha F*ckas\nWhile I trash shit up\nAnd yall listen up close to role call:\nEazy-E's in the place\nI got money and juice\nRondevues with me\nAnd we make the duce\nDre makes the beat\nSo g*d damn funky\nDo the old 8\nF*ck the Brass Monkey\nIce Cube writes the rhymes\nThat I say\nHail to the niggas\nFrom CIA\nCazy beat/D is down\nAnd in effect\nWe make hard core jams\nSo f**k respect\nMake a toast toast puppy punk\nTo the title I'm holdin\nEazy-E's f*cked up\nAnd got the 8-Ball rollin", "year": null}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Any Last Werdz", "lyrics": "[Intro]\n1999\nThe world's at its end\nFuck it\nWe want the money and the power\nAnd go out with a bang\n\n[Hook: Cold 187um]\nCause it's the end of the world\nAnd still niggas ain't got no satisfaction\nSo I take my 9 put it on my chest bust some cop in his head\nNow I'm blastin'\nCause I'm known as a G\nAnd I'm coming from the C-P-T\nAnd you should know\nBitch ass niggas runnin' back\nCan't fuck with Eazy\n[w/ Kokane - several times]\nWet 'em up\n\n[Verse 1]\nThis is a real life jack in progress\nNigga, give up your shit or take two to the chest with the cripness\nCause I ain't fuckin' around, G\nSo take a look at a real live nigga that's crazy\nAnd get ready to die, loc\nAny last words\nBefore your ass gets smoked, it ain't a joke\nBecause my pockets is broke my friend\nThat's why I gotta do you in\nGive up your ends and your gold and your brand new Nike's\nAnd anything else I might like\nAnd then I'm off in the wind again\nTo catch the next sucker\nSlippin' takin' two to the chin\nI'm on a role two niggas in one night\nDidn't even have to fight\nJust pulled out my 9 to end another's life\nThat's real life so forget the silly shit you heard\nNow nigga tell me, do you have any last words\n\n[Hook]\n\n[Verse 2]\nAnother murder I committed made front page\nA nigga dead from a drive-by, did him with a 12 gauge\nThe first stage of insanity\nPeople say it ain't wise, to get faded of the St. Ides\nA mother cries, another son lies in a casket\nLife was fun while it lasted\nThat silly bastard had to get caught\nTrippin' and set trippin'\nYou should have seen that niggas blood drippin'\nTo many lives took\nTo many hearts broke\nBut you don't hear me, you just see my fuckin' gun smoke\nSome ask why do I take so many lives from\nThe innocent little ones\nBut where I come from\nWe take shit real\nYou peel caps so you get your fuckin' cap peeled\nGrab your steel, forget about what you heard\nIt's do or die, nigga\nAny last words\n\n[Hook]\n\n[Verse 3]\nI got the 9 and I'm pullin', straight creep\nFeel I need to take anothers life, so I peep\nCheckin' the scene but stayin' low\nSo I'm not seen, case I gotta get away\nGotta make the shit clean, G\nSo I'm lookin' for a victim\nGotta be right took my time and I picked him\nScoped shit, then I licked him\nNow I'm back in the news no clues but yet another murder\nYou should have heard the nigga squill when I stuck his ass\nI had to grin cause it's funny, nigga, fuck his ass\nHe ain't the last and surely ain't the first, G\nBut his monkey ass rolled away in a hearse, G\nSo I'm feelin' some what relieved\nJust another day in the life of the Eazy\nA real G, so forget the silly shit you heard\nIt's do or die, Eazy-E gets that last word\n\n[Hook]", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": null, "title": "Automobile", "lyrics": "[Intro:]\nYo Dre man, I take this bitch out to the movies and shit man we're kissin'\nAnd grindin' and shit, so we hop in the back seat, you know man, this bitch\nRubbin' all over my dick and frontin' like she's gonna give me the pussy\nMan, and the bitch said three words, man:\nStop, No and Don't\n\nI said BIIIITTTTTCCHH\n\n[Verse 1:]\nYou don't have to front on me dear\nSo why don't you just give that pussy here?\nIf you'd be good to me\nOh I'll be good to you\nAnd we'll both ride home in my automobile\n\nAll that I want is a little puss\nAll that I want is just a little head\nIf you'd be good to me\nOhh I'll be good to you\nAnd we'll both ride home in my automible\n\n[Verse 2:]\nYou don't have to front on me bitch\nDon't be afraid - it's only a dick\nGive up the pussy soon\nAll I want is a little\nOr get your groopy ass out my hotel room\nOr get your groopy ass out my hotel room\n\nAll I want is the pussy\nAll I want is the pussy\nAll I want is the pussy\nAll I want is the pussy\nIf you'd be good to me\nOh I'll be good to you\nAnd we'll both ride home in my automobile\nWe'll both ride home in my automobile", "year": "1991-05-28"}, {"artist": "Eazy-E", "album": null, "title": "Back to the Set as I Jet", "lyrics": "[Intro: Unknown News Reporter]\nRapper Eazy-E has full-blown AIDS, according to a written statement released on Thursday. Eazy-E, whose real name is Eric Wright, was a founding member of the multi-million selling rap group N.W.A.  He's currently in a critical condition in the intensive care ward of a Los Angeles hospital. The 31-year-old rapper had complained breathing problems but had no idea that he had AIDS before he was diagnosed, 3 weeks ago\n\n[Verse 1: Eazy-E]\nBack to the set as I jet, not giving a (damn) about the (fool) that I wet\nThat's what he gotta shout for acting like a trick\nNow he's 6 feet deep and I'm deep in his (trick)\nCreepin' creepin' creepin' on the marks that be sleepin'\nCatch you slippin' slap the clip in, buck 'em every weekend\nA scandalous lil' (villain) wit no heart to feel remorse\n(DIg up the fool's corpse), leave it on his momma's porch\nDon't give a (damn) about shit, that's why I'm mellow\nOr maybe it's the fact that I'm into the devil\nA psychopathic (thriller), that's always quick to fill a\n(fool) for a lick cause I'm a sick-ass killer\nThrilla from Manilla though I'm shorter than the average\nTry to test your luck and get bucked by a (downright savage)\n\n[Hook: Eazy-E]\nBack to the set as I jet, (damn) about the (fool) that I wet (X4)\n\n\n[Bridge]\nThe 31-year-old rapper had complained breathing problems but had no idea that he had AIDS before he was diagnosed, 3 weeks ago\n\n[Verse 2: Eazy-E]\nLater on that night as I'm rollin'\nLooking for a (sucker) I can gat and pack a hole in\nStoppin' at a light in the late night\nFire up a Philly Blunt to get my head right\nSee some (tricks) slippin' at a burger stand\nAnd in my mind all I'm thinking is a murder plan\nCreepin' through the drive-through kinda slow\nI got my high beams on the back of the '4, yo\nSmokin' on chronic with the rag down\nNot knowin' I'm about to lay their ass down\nReach for who was fool, made my move\nLeaned out my jeep and I creep kinda smooth\nWith the gat to the [?] dome now he sleeps\nOne shot to the top body flopped on the seat, peep\nI dumped on the lil' skinny passenger\n(the trick) is screamin' in a rage, so I blasted her\nSmashed and I got about 5 blocks\nBefore I got stopped by punk ass cops\n\nPoliceman: hey, step out of the car\n\n[laughter & whispering]\n\n(Break it down, baby)\n\n[Hook: Eazy-E]\nBack to the set as I jet, (damn) about the (fool) that I wet (X10)", "year": null}, {"artist": "Eazy-E", "album": "Ruthless Records 10th Anniversary: Decade of Game", "title": "Black Nigga Killa", "lyrics": "[Chorus x4]\nYEAH!\nBlack niggaaaaaaaaaa\nYEAH!\nKilla killa killa killa\n\n[Verse 1: Eazy-E]\nBlack nigga killa\nHate brought death\nAround the block as the hollow points bust though the punks back\nRaising gang feel no pain  as I penetrate\nNiggas fly deep as I strike a quick pace\nI got the evil of a dead nigga trapped in my mind\nSo my soul is a threat to my mankind\nBorn to kill I'm wicked by nature\nCause the streets of my neighborhood breed young hell raisers\nI'm 30 ot 6 with the scope\nI make a skinhead brain bust all across the West Coast\nMotherfuckers catchin heat\nAs I bring anger\nAnd release more danger from my chamber\nThe evil in my blood is possessed\nSo I creep low from the back slow and puts lead in that nigga's flesh\nAin't no hope, every nigga wants to be the nine milla on the trigga\nThe black nigga killa\n\n[Chorus x4]\n\n[Verse 2: Eazy-E]\nDeep from the death as I crept\nI can feel his Glock in the back of my neck\nI'm thinkin to myself \"what the fuck\" as I pause\nI can feel my heart thumpin from my balls\nUp against his gun what the fuck could I do?\nIf I make a wrong move, the nigga might shoot\nMy pops always warned me when I was comin up\nIf I play pussy, I'm bound to get fucked\nThough bein broke as hell it be drivin me crazy\nHooked up with my niggas start jackin niggas daily\nFat sacks of dough, to Dayton's, I got em\nSlang em dirt cheap cause everything was profit\nNow I got his nine on the back of my mind\nAs I watch my life pass right before my eyes\nThe shit that I done, is all in my face\nReflections of death as I step with my 38\nThe black nigga killa\n\n[Chorus x4]\n\n[Verse 3: Eazy-E]\nWhich bitch made the statement?\nAbout the nigga busting caps sporting all black Ben Davis\nI'm out the door\nMy pager's blowin up I check my gat twice\nCause niggas like to jack on a late night\nAnd as I'm livin like a criminal\nI try my best to keep my gang tight and stay away from punk niggas\nStrikin down Broadway\nI caught some niggas out of bounds from the\nUpper MLK\nSlowly crept from the cut at a quick pace\nAin't no love in my heart all I feel is hate\nSo 25 with that L might be mando\nCause nigga I'm killing for them gold things with that Zapco\nI watch the terror in eyes as he backed up\nEase of the break pop that clutch and watch his chest bust\nWide open as I bounce in the night quicker\nFrom the nine milla trigga\nThe black nigga killa\n\n[Chorus x10]", "year": "1998-03-24"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Boyz-N-Tha Hood (G-Mix)", "lyrics": "[Intro: Dresta]\n\"Yeah, Gangsta Dresta done stepped in this, motherfucker. And this one goes out to all the O.G.'s out there. And I can't forget the baby gangstas, what's up, niggas? My nigga they came back with some of that old school original west coast shit, nigga. That got all of y'all on his dick in the first place, yeah. So run that shit, E, yeah.\"\n\n[Verse 1: Eazy-E]\nCruisin' down the street in my '64\nJockin' the freaks, clockin' the dough\nWent to the park to get the scoop\nKnuckleheads out there cold shooting some hoops\nA car pulls up, who can it be?\nA fresh El Camino rolling Kilo G\nHe rolls down his window and he started to say\nIt's all about making that GTA\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash, we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 2: Eazy-E]\nDonald B's in the place to give me the pace\nHe said, \"My man JD is on freebase\"\nThe boy JD was a friend of mine\n'Til I caught him in my car trying to steal a Alpine\nChased him up the street to call a truce\nThe silly cluck-head pulls out a deuce-deuce\nLittle did he know, I had a loaded 12 gauge\nOne sucker dead, LA Times front page\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 3: Eazy-E]\nBored as fuck and I wanna get ill\nSo I went to a place where my homeboys chill\nNiggas out there making that dollar\nI pulled up in my '64 Impala\nThey greet me with a 40 and I start drinking\nAnd from the 8-ball my breath start stinking\nLeft to get my girl to rock that body\nBefore I left I hit the Bacardi\nWent to her house to get her out of the pad\nDumb ho said something that made me mad\nShe said something that I couldn't believe\nSo I grabbed the stupid bitch by her nappy ass weave\nShe started talking shit, wouldn't you know?\nReached back like a pimp, slapped the ho\nHer father jumped up and he started to shout\nSo I bombed on pops, knocked his ol' ass out\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 4: Eazy-E]\nNow I'm rolling hard, now under control\nThen wrapped the '64 'round a telephone pole\nI looked at my car and I said, \"Oh, brother\nThrow it in the gutter and go buy another\"\nWalking home and I see the G ride\nNow Kat is drivin Kilo on the side\nAs they busted a U, they got pulled over\nA undercover cop in a dark green Nova\nNow Kat got beat for resisting arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doing the crime\nFourth offense on the boy, he'll do some time\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit\n\n[Verse 5: Eazy-E]\nI went to get them out, but there was no bail\nMy niggas caused a riot in the county jail\nTwo days later in municipal court\nKilo G on trial straight cut a fart\nDisruption of a court, said the judge\nOn a six-year sentence, my man didn't budge\nBailiff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out, \"Fire,\" then came Suzy\nThe bitch came in with a sub-machine Uzi\nPolice shot the girl, but didn't hurt her\nBoth upstate for attempted murder\n\n[Hook: Eazy-E]\nCause the boys in the hood are always hard\nYou come talking that trash we'll pull your card\nKnowing nothing in life, but to be legit\nDon't quote me, boy, cause I ain't said shit", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": "Ruthless Records 10th Anniversary: Decade of Game", "title": "Boyz-n-the Hood", "lyrics": "[Verse 1]\nCruisin' down the street in my 6-4\nJockin' the freaks, clockin' the dough\nWent to the park to get the scoop\nKnuckle-heads out there cold-shootin' some hoops\nA car pulls up, who can it be?\nA fresh El Camino rollin' Kilo G\nHe rolled down his window and he started to say\nIt's all about makin' that GTA\n\n[Hook]\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\n[Scratches]\nYo, man!\nGet the fuck out!\nPump that bass!\nMothafucker, say what?\n\n[Verse 2]\nDonald B's in the place to give me the pace\nHe said my man JD is on freebase\nThe boy JD was a friend of mine\n'Til I caught him in my car tryin' to steal an Alpine\nChased him up the streets to call a truce\nThe silly cluckhead pulls out a deuce deuce\nLittle did he know I had a loaded 12-gauge\nOne sucker dead, LA Times front page\n\n[Hook]\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\n[Scratches]\nYo, Leroy!\nBeer drinkin', breath stinkin', sniffin' glue\n\n[Verse 3]\nBored as hell and I wanna get ill\nSo I went to a place where my homeboys chill\nThe fellas out there makin' that dollar\nI pulled up in my 6-4 Impala\nThey greet me with a 40 and I started drinkin'\nAnd from the 8-ball my breath started stinkin'\nLeft to get my girl to rock that body\nBefore I left I hit the Bacardi\nWent to her house to get her out of the pad\nDumb ho said somethin' that made me mad\nShe said somethin' that I couldn't believe\nSo I grabbed the stupid bitch by her nappy-ass weave\nShe started talkin' shit, wouldn't you know?\nReached back like a pimp, slapped the ho\nHer father jumped up and he started to shout\nSo I threw a right cross, cold-knocked him out\n\n[Hook]\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\n[Scratches]\nWho do you think you are, Mr. big stuff?\nRock this mothafucker like Three the Hard Way\n\n[Verse 4]\nI'm rollin' hard, now I'm under control\nThen wrapped my 6-4 around a telephone pole\nI looked at my car and I said \"Oh, brother.\"\nI throw it in the gutter, and go buy another\nWalkin' home, I see the G ride\nNow Cat is drivin', Kilo on the side\nAs they busted a U, they got pulled over\nAn undercover cop in a dark green Nova\nCat got beat for resistin' arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doin' the crime\nFourth offense on the boy he'll do some time\n\n[Hook]\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\n[Scratches]\nL.A. playa\nBig Drum Beater\n\n[Verse 5]\nI went to get them out, but there was no bail\nThe fellas causin' a riot in the county jail\nTwo days later in the municipal court\nKilo G on trial cold cut a fart\n\"Disruption of the court,\" said the judge\nOn a six-year sentence, my man didn't budge\nBaliff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out \"Fire!\", then came Suzy\nThe bitch came in with a sub-machine Uzi\nPolice shot the girl but didn't hurt her\nBoth upstate for attempted murder\n\n[Hook]\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\n[Scratches]\nGet busy, y'all!\nAw\nYou mothafucker!", "year": "1987-03-03"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Boyz-n-the Hood (Remix)", "lyrics": "[Intro]\nDr. Dre: Hey, yo, remember that shit Eazy did a while back?\nMotherfuckers said it wasn't gonna work.\nIce Cube: That crazy shit?\nDr. Dre:  Yeah, the stupid shit, man.\nMC Ren:  That shit was dope.\nDr. Dre:  Hey yo, Eazy!\nEazy-E: Wassup?\nDr. Dre: Hey man, why don't you come off the piano for a minute and bust this crazy shit?\n\n[Verse 1]\nWoke up quick at about noon\nJust thought that I had to be in Compton soon\nI gotta get drunk before the day begins\nBefore my mother starts bitchin' about my friends\nAbout to go and damn near went blind\nYoung niggas at the pad, throwin' up gang signs\nRan in the house and grabbed my clip\nWith the MAC-10 on the side of my hip\nBailed outside and pointed my weapon\nJust as I thought, the fools kept steppin'\nJumped in the fo', hit the juice on my ride\nI got front and back and side to side\nThen I let the Alpine play\nBumpin' new shit by N.W.A\nIt was \"Gangsta Gangsta\" at the top of the list\nThen I played my old shit, it went somethin' like this\nCruisin' down the street in my six-fo'\nJockin' the bitches, slappin' the hoes\nWent to the park to get the scoop\nKnuckleheads out there, cold-shootin' some hoops\nA car pulls up, who can it be?\nA fresh El Camino rollin', Kilo G\nHe rolled down his window and he started to say\nIt's all about makin' that GTA\n\n[Hook]\n'Cause the boyz n tha hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nYo, man!\nGet the fuck out!\nPump that beat!\nMothafucka, say what?\n\n[Verse 2]\nDonald B's in the place to give me the pace\nHe said my man J.D. is on freebase\nThe boy J.D. was a friend of mine\n'Til I caught him in my car, tryin' to steal my Alpine\nChase him up the street to call a truce\nThe silly motherfucker pulls out a deuce-deuce\nLittle did he know I had a loaded 12-gauge\nOne sucker dead, LA Times front page\n\n[Hook]\n'Cause the boyz n tha hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nYo, Leroy!\nBeer drinkin', breath stinkin', sniffin' glue\n\n[Verse 3]\nBored as hell and I wanna get ill\nSo I went to a spot where my homeboys chill\nThe fellas out there makin' that dollar\nI pulled up in my 6-4 Impala\nThey greet me with a 40 and I start drinkin'\nAnd from the 8-ball my breath starts stinkin'\nLeft to get my girl, to rock that body\nBefore I left I hit the Bacardi\nWent to her house to get her out of the pad\nDumb ho said somethin' that made me mad\nShe said somethin' that I couldn't believe\nSo I grabbed the stupid bitch by her nappy-ass weave\nShe started talkin' shit, wouldn't you know?\nReached back like a pimp, slapped the ho\nHer father jumped up and he started to shout\nSo I threw a right cross and knocked his old ass out\n\n[Hook]\n'Cause the boyz n tha hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin nothin' in life but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nWho do you think you are, Mr. Big Stuff?\nRock mothafucka, like the hard three the hard way\n\n[Verse 4]\nI'm rollin' hard, now I'm under control\nThen wrapped the six-fo' round a telephone pole\nI looked at my car and I said, \"Oh, brother\nI'll throw it in the gutter and go buy another.\"\nWalkin' home and I see the G ride\nNow Cat is drivin' Kilo on the side\nAs they busted a U, they got pulled over\nAn undercover cop in a dark green Nova\nCat got beaten for resistin' arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doin' the crime\nFourth offense on the boy, he'll do some time\n\n[Hook]\n'Cause the boyz n tha hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nL.A. playa\nBig Drum beater\n\n[Verse 5]\nI went to get them out, but there was no bail\nThe fellas caused a riot in the county jail\nTwo days later in municipal court\nKilo G on trial cold cut a fart\n\"Disruption of the court,\" said the judge\nOn a six-year sentence, my man didn't budge\nBailiff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out \"Fire!\", then came Suzy\nThe bitch came in with a sub-machine Uzi\nPolice shot the bitch but didn't hurt her\nBoth upstate for attempted murder\n\n[Hook]\n'Cause the boyz n tha hood are always hard\nYou come talkin' that trash, we'll pull your card\nKnowin' nothin' in life but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nYeah, I kicked a little ass\nBut that was a blast from the past, mothafucka\nGet busy, y'all y'all y'all y'all!", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Cock the 9", "lyrics": "[Verse 1: Eazy-E]\nHere's the latest\nFrom the king of badness\nI got the shit that makes niggas wanna flip\nG'd up all better wit beanies\nSweatin' all the bitches to blow our weanies\nNiggas all getting drunk, and smoking a bum bud\nOh wait here's a punk, pop the trunk\nCuz it's a gang of jackers in the front smoking\nAll the hump, some shit was said about blue and red\nBut I'm colour blind and I gotta nine\nThrew up the sign I cock the 9, I cock the 9\n\n[Verse 2: Loco S.A.B]\nWell nigga pop the 9 and let it holla\nTest drive wit a neighbourhood's scholar\nBlack Impala, blue chucks on gettin outta\nSucks on hip hop thugsta get the fuck on\nNiggas looking shifty, do they wanna diss me, lick me\nShow me love or peel my cap quickly\nMy six sense won't let me slip don't puff wit the draggin' em\nI'm still toe taggin' em, hit the spot wit a don still baggin' em\nIt's the low call, S.A.B on the vocal, blast my way out Eazy pay\nThe way, all you bitch niggas stay out\n\n[Hook]\nI cock the 9, I cock the 9, I cock the 9 ( and everything is fine)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\n\n[Verse 2: Phalos Mode]\nIt's like dice game, dice game niggas get they roll'on\nEverything's all good till niggas getting sold on\nHere we all get together and shoot, fuck\nI grab my gun then I picked up my loot\nBut I didn't lose shit so it's all good\nLeavin' pumpin' Eazy-E \"Boyz n the Hood\"\nCuz I'm a gangsta so I can relate\nMost of these niggas is fake and tryin' to hate\nI put a buster in his place, I put one in his face\nObey my first and give him the taste\nThat's how I duz it, that's how I do it\nAnd the murder weapon that I use you know I threw it\nHe kept persuading so I had to do it, 'uh' play\nFor keeps that's the rule of the streets 'uh'\n\n[Verse 3: Loco S.A.B]\nDick Tracy all on my nuttz like Cagny and Lacy\nAnd don't faze me, Ruthless is the label that pays me\nBut this one H.K weighs a ton, words are yellow wit\nThe porno freaks on a run, bring ya condom in the kingdom\nHuh ho from the ceilin' to the floor, info red at ya window\nPlus the E go hangin' out the beamer though\nDrop shit like a seagull, for the people\nHo's make a contribution, but y'all don't hear me tho\n\n[Hook]\nI cock the 9, I cock the 9, I cock the 9 ( and everything is fine)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\n\n[Verse 4 : Eazy-E]\nTuck ya legs to my dick with the wrap em real tight\nJust in case its on and a nigga gotta fight\nOr a Nigga gotta bust, but who in the fuck said in god we trust\nThe shit wen't down everybody start runnin'\nBitches screamin' and the bullets kept comin'\nRan into a nigga tryin' to save mine, reach for my gun ahh shit!!\n\n[Hook]\nI cock the 9, I cock the 9, I cock the 9 ( and everything is fine)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9\nI cock the 9, I cock the 9, I cock the 9 (my homey pop the 9)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)\nI cock the 9, I cock the 9, I cock the 9 (*gun shot*)", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Creep N Crawl", "lyrics": "[Intro]\nStraight off the streets of mothafuckin' Compton\nIt's the downest nigga I know\nEazy mothafuckin' me\n'Bout to kick your ass in '93\n(Creep with me, as I crawl through the hood)\n\n[Hook]\nI creep and I crawl\nAnd I creep and I crawl\nAnd I creep and I crawl, creep creep\nI said I creep and I crawl\nAnd I creep and I crawl\nAnd I creep and I crawl, creep creep\nI got my niggas from Grape Street, Watts\nI got my niggas from the C-P-T\nI got my niggas all across the mothafuckin' land\nThat's down with the E-A-Z-Y-E\n\n[Verse 1]\nNow, early in the mornin' I awake\nThinkin' about this dead fool's life that I had to take\nFrontin' on a true name, I peep game at point-blank range\nFuck 'em! (\"Mothafuckin' right, y'all.\")\nBack to the set as I jet\nNot givin' a fuck about the nigga that I wet\nThat's what he gotta shout for actin' like a trick\nNow he's six feet and I'm deep in his bitch\nCreepin', creepin', creepin' on the marks that be sleepin'\nCatch you slippin', slap the clip in, buck 'em every weekend\nA scandalous lil' nigga with no heart to feel remorse\nDig the nigga's corpse, leave it on his momma's porch\nDon't give a fuck about shit, that's why I mellow\nOr maybe it's the fact that I'm kin to the Devil\nA psychopathic nigga that's always quick to fill a\nNigga full of lead, 'cause I'm a mothafuckin' killer\nThrilla from Manila, though I'm shorter than the average\nTry to test yo' luck and get bucked by a mothafuckin' savage\n\n[Hook]\nI creep and I crawl\nAnd I creep and I crawl\nAnd I creep and I crawl, creep creep\nI said I creep and I crawl\nAnd I creep and I crawl\nAnd I creep and I crawl, creep creep\nI got my niggas from Grape Street, Watts\nI got my niggas from the C-P-T\nI got my niggas all across the mothafuckin' land\nThat's down with the E-A-Z-Y-E\n\n[Verse 2]\nNow, later on that night as I'm rollin'\nLookin' for a nigga I can gat and pack a hole in\nStoppin' at a light on the late night\nFire up a Philly blunt to get my head right\nSee some niggas slippin' at a burger stand\nAnd in my mind all I'm thinkin' is a murder plan\nCreepin' through the drive-through kinda slow\nI got my hot beams on the back of the '4, yo\nSmokin' on chronic with the rag down\nNot knowin' I'm about to lay their ass down\nReach for who was fool, make my move\nLeaned out my jeep and I creep kinda smooth\nWith the gat to the nigga's dome, now he sleeps\nOne shot to the top, body flopped on the seat, peep\nI dumped on the lil' skinny passenger\nA bitch is screamin' in a rage, so I blasted her\nSmashed and I got about five blocks\nBefore I got stopped by a punk-ass cop (Shit, fuck 'em!)\n{You can't kill a cop!} FUCK YOU! *shots*\nMothafucker, ha ha ha!\n\n[Hook]\nI creep and I crawl and I creep\nI creep and I crawl and I creep\nI creep and I crawl and I creep\nI creep and I crawl and I creep", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "Da Bring ‘em Real", "lyrics": "[Verse 1]\nAw yeah, let's take a trip\nJust sit back and light a spliff to this and don't step\nOn a funky-ass track jump back\nStrapped with a gat and a sack and a seven-eight lac\nCome clean, gangsta lean, I got green\nBut I serve dubs like it ain't no thing\nI hang with O.G. niggas, don't set trip\nOr you might get a slug in your fuckin' back\nI don't slack when it come to street\nI kick real G shit to a gangsta beat\nIt's so sweet, when you got money to spend\nI got a cool-ass tilt and a fly-ass Benz\nI make ends, spend my dough on no ho\nThat's how it is and that's how it goes\nAct like ya know when I creep real slow\nGivin' love to them niggas that I know is real G's\n\n[Hook: Shaki]\nIf you got love for dem gangstas\nLet me hear you one time if you down for the crime\n(\"That's right, fool\")\nIf you got love for dem hustlas\nLet me hear you say hooo if you makin straight dough *hooooo*\nIf you got love for dem playas\nLet me hear you say ooooh, ladies we want you *ooooooh*\nIf you got love for dem straight G's\nLet me hear you motherfuckers just scream *heeeeeeey*\n\n[Sample]\nThe ruthless network, drive-by expert\nStraight outta Compton, kickin' up dust\nThe ruthless network, drive-by expert\nStraight outta Compton\n\n[Verse 2]\nDump, dump on a nigga with a quickness\nAnd they got no cure for this sickness\nI get paid for the way that I kick this\nLike a G-sta, an O.G.-sta\n(\"Who's that?\")\nA real nigga named Eazy\nAnd I live my life straight crazy\nDon't need no punk niggas payin' me\nAnd broke groupie-ass bitches don't faze me\nI take two step back and release myself\nTo put platinum-ass cuts on the record shelf\nI don't brag but I tell it like it straight up is\nBefore you do a record, nigga, handle your business\nAnd don't get caught slippin' on the under\nOr you might wonder\n(What's up on dem ends, nigga?)\nI call a spade, a spade and get paid\nG's show the way, so I give love to 'em\n\n[Hook]\n\n[Verse 3]\nE-A-Z - why must I\nChase the cat and be a dog, a straight-up hog\nI leapfrog to the sound of a gangsta beat\nSo I can hear my shit bumpin' on a Compton street\nThat O.G., C-R-I-P and S, G and S\nHip-Hop thugsta, so quick to rush ya\nStraight to the dirt, fool I do work\nNobody move, nobody get hurt\nThat's how it is when it come to me\nCause I'm the long dick bust-a-nut nigga named Eazy\nBitches can't see me, hoes say I'm crazy\nBut I don't think so, cause I'm just loco\nI gives a fuck about a skankless bitch\nLet me hit it one time if you suck this dick\nI don't trip, gives my dough to no ho\nThat's how it is, but I gives love to ya\n\n[Hook]", "year": null}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Down 2 tha Last Roach", "lyrics": "[Dr. Dre:]\n\"I still express, yo, I don't smoke weed or sess.\"\nBitch!\n\n[Intro: Eazy-E]\nAh, greetings eartlings\nAnd welcome to the motherfuckin' wonderful\nWonderful, motherfuckin' world of gettin' higher than a motherfucker\nOh me, I'm funk on your mind\nAlias to you motherfuckers Roach Clip\nAnd this here is my Kimosabe dumpin' shit on your ass\nAnd my nigga goes by the name of B.G. Ash Trey\nAnd we 3-65, that means we're fucked up all year round\nAnd our motto is:\n\n[Hook]\nGettin' higher than a motherfucker\nDown to the laaast roach\n\n[Verse 1: Eazy-E & Dirty Red]\nCreepin' through this cloud of smoke\nWith a little bit of funk to make ya choke in\nGangstas come feel good inside\nAs we take you for a ride to another dimension\nDeep from a 40 OZ\nTwo crooked ass niggas on a cosmic journey\nStraight from the planet G\nWhere the real niggas dwell in the realms of Ruthless\nTook a puff of the indo spliff\nHigh like a bird as I creep to the bud spot\nBreak me off a proper piece\nSo I can get fucked up with my nigga Roach Clip\nB.G. Ash Tray, dump that ass Dre\nRuthless family, high as you can be\nSmoke that psychadelically insane\nAnd gettin' higher than a motherfucker\n\n[Hook]\n\n[Verse 2: Shaki & Eazy-E]\nAs I step through the smoke\nDeep from a land broke niggas don't come to\nStraight to Indonesia\nChronic fever\nStep off punk, we don't need ya\nBlaze a blunt to the boogie\nAnd come take a ride on a journey with a real G\nLife is easily explained on a level\nOf smokin' bud with the motherfuckin' devil\nIn my imagination\nSup with these thoughts what a fly creation\nIndo smoke from the land of G's\nLettin' them know they can't handle these, niggas\nStraight from the planet dime\nI have come, to put funk on your mind\nEazy-E better known as Mr. Roach Clip\nSo pass the bud cause we still gettin' higher than a motherfucker\n\n[Hook]\n\n[Eazy-E]\nNow I'm real fucked up yes, high as hell\nRing ding ding do I hear some bells\nOr am I just trippin'\nThinkin' about that 4 that I'm dippin'\nFront, back, side to side\nOn corners that's how a nigga gotta ride\nDip to the, dip to the, dip to the back\nBumpin' Eazy-E on 8 track\nSo blaze up a another skunky, funky, dookie, doobie\nSo we can get loogied\nUp some more, up, up it go\nWhat's my name \"Eazy-E\", yo, the motherfuckin' bud smokin' loc 'n\nWhen I'm high as a kite causing ruckus, yeah\nGettin' higher than a motherfucker\n\n[Hook]\n\n[Dialogue between Eazy and a questioner]\n[Q:] Substance?\n[E:] Mar-a-motherfuckin'-wana\n[Q:] Common slang names?\n[E:] Pot, grass, dope, weed, homegrown, sinsemilla, maui-wowie, thai sticks, joints, roaches, indica, concentrated rezi called hash or hashish. But some niggas call it bud\n[Q:] Active ingredient?\n[E:] Tetrahydrocannabinol ... THC\n[Q:] Source?\n[E:] Cannabis Sativa\n[Q:] Pharmacologic classification?\n[E:] CNS depressive hallucigent\n[Q:] Medical use?\n[E:] Experimental only, oh yeah, we still testin'. And don't forget, we still gettin' higher than a motherfucker\n\n[Hook]", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": null, "title": "Down to Tha Last Roach", "lyrics": "(Dr.Dre: \"I still express yo I don't smoke weed or sess\"\nBITCH!!!\n\nAh, greetings eartlings, and welcome to the motherfuckin'\nWonderful, wonderful, motherfuckin world\nOf gettin higher than a motherfucker\nOhh me?  I'm funk on your mind\nAlias to you motherfucker's roach clip\nAnd this here's my Kimosabe dumpin shit on yo ass\nAnd my nigga goes by the name of BG Ashtray\nAnd we 365, that means we fucked up all the way around\nAnd our motto is..\n\n(Gettin higher than a motherfucker, down to tha last roach)\n\nCreepn through this cloud of smoke\nWith a little bit of funk to make ya choke in\nGangstas come feel good inside\nAs we take you for a ride to another dimension\nDeep from a 4-0 O-Z\nTwo crooked ass niggas on a cosmic journey\nStraight from the planet G\nWhere the real niggas dwell in the realms of Ruthless\nTook a puff of the indo spliff\nHigh like a bird as I creep to the bud spot\nBreak me off a proper piece so I can get fucked\nWith my nigga roachclip, BG Ashtray, dump that ash tray\nRuthless family, high as can be\nSmoke that ?? psychadelically insane\nAnd gettin higher than a motherfucker\n\n(Gettin higher than a motherfucker, down to tha last roach)\n\nAs I step through the smoke\nDeep from a land broke niggas dont come to\nStraight to Indonesia\nChronic fever step off punk we dont need ya\nBlaze a blunt to the boogie\nAnd come take a ride on a journey with a real G\nLife is easily explained on the level\nOf smokin bud with the motherfuckin Devil in my imagination\nSup with these thoughts what a fly creation\nIndo smoke from the land of G'z\nLetting them know they can't handle these\nNiggas, straight from the planet Dime\nI have come to put funk on your mind\nEazy-E better known as Mr. Roach Clip\nSo pass the bud cuz we still gettin higher than a motherfucker\n\n(Gettin higher than a motherfucker, down to tha last roach)\n\nNow I'm real fucked up yes high as hell\nRing ding ding do I hear some bells\nOr am I just trippin\nThinkin about that 4 that I'm dippin\nFront, back, side to side\nOn corners that's how a nigga gotta ride\nDip to the, dip to the back\nBumpin' Eazy-E on 8 track\nSo blaze up a another skunky, funky, dookie, doobie\nSo we can get loogied\nUp some more, up, up it go\nWhat's my name \"Eazy-E\" yo\nThe motherfuckin bud smokin' loc'n\nWhen I'm high as a kite causing ruckus yeah!\nGettin higher than a motherfucker\n\n(Gettin higher than a motherfucker, down to tha last roach)\n\n(Below is asked to E while music is still playing)\n\nQ: Substance\nE. Mar-a-Mutha-Fuckn-Wana\nQ. Common slang names\nE. Pot, grass, dope, weed, homegrown, sinsemilla\nMaui-wowie, thai sticks, joints, roaches, indica\nConcentrated rezi called hash or hashish;\nBut some niggas call it bud\nQ. Active Ingrediant\nE. Tetra Hydro Cannabinol.. THC\nQ. Source\nE. Cannabis Sativa\nQ. Form a callogic classification\nE. CNS Depressive Hallucigent\nQ. Medical Use\nE. Experimental only,oh yeah we still testing...\nAnd don't forget we still gettin higher than a motherfucker\n\n(Gettin higher than a motherfucker, down to tha last roach)", "year": null}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Eazy 1, 2, 3", "lyrics": "[Verse 1: Eazy-E]\nA typical street corner ass nigga\nOnce a nigga always a nigga now a public figure\nBut I can still serve a muthafucka if I have too cause I'm slanging them thangs nigga\nI roll deep with a crew or a posse\nNiggas cuttin' throat, Murder She Wrote for the Eazy-E, fool\nFuck with the veteran, still a better man than the next man, then again\nI can still put a chrome nine to your dome\nBoom nigga boom nigga no Milkbone\nYippie-yi-yay your ass back the fuck on home\nStay the fuck off the sherm and crack and \"Just Say No\"\n\n[Verse 2: Phalos Mode]\nMy definition of a bitch nigga\nAww shit, get pistol whipped, need to sit down when he piss\nCause I beat em treat em fuck em like 1 2 3\nThe legend of gangster rap is Eazy-E\nStill gangsta ruthless, leaving muthafucka's toothless\nI was sign to sky before I do this. a nigga gone\nI guess I see you at the crossroads, a nigga with an attitude, my name from last month\n\n[hook]\nI meet em treat em fuck em Eazy 123\nWe meet em treat em fuck em Eazy 123\nI meet em treat em fuck em Eazy 123\nWe meet em treat em fuck em Eazy 123\n\n[Verse 3]\nThat's where the streets hits the radio\nAnd give the love like he supposed to\nY'all don't wanna death in the studio\nAnother scandal for me and E to handle\nRaised my 64 11 on the roll\nBang, Los Angeles slang\nLike a double barrel, E point right in tha game\nBig lotion ya ass see smoke glower\nNow fucking with legends Eazy with a weapon\nCash is trading killer cross-over\nJump in the game, and bitches slanged my name\nViolent reporter the streets out of order\nProjects corner and gangster were 'fore us\nI hit blocks of a double-shot\nShow my face on the block I give a fuck about a cop\nMale black attitude, nigga fuck you\nStomping niggas from South Central ? Compton\n\n[Hook]\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\n\n[Verse 4: Eazy-E]\nNow what the fuck is worse than 1 punk nigga?\n2 punk niggas, add em up and get the picture\nOne's a fucking fag from the days and one's a busta\nI was born a pimp, a mack daddy and a hustla\nYou can take the nigga off the streets but you can't take the streets out the nigga. Once a nigga still a nigga\nFucking hoes I do mean fucking steadily, I fucked your bitch (ahh) cause she was begging me\nYour bitch ain't nothin' but a piece of cock to me\nShe dropped the drawers when she found out I was Eazy\nShe licked the balls and sucked the dick I came heavily\n(ooh get me ready E, fuck me steadily)\n\n[Verse 5: Phalos Mode]\nWhy these niggas sippin' Haterade\nDrinking on bitch Kool-Aid\nFor the name of Easy niggas get sprayed\nNow I'm in my lowrider and this candy-paint\nStash spot for the Glock\nNigga think I aim, I am with a five full of five gangsta was ?? big, paper drill, on the quest for mills\nNow everybody say they are thugging\nBut when the gun blast see niggas running, I leave no witnesses\n\n[Bridge]\nPunk niggas always tryna hate and they be always talking shit\nBut when they sober they all hesitate cause they don't know who they fucking with\nLong live real gangsta shit and tell your ho get off my dick\nCause we gone finish of the legacy and keep the family so legit\n\n[Hook]\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123\nI meet em treat em fuck em eazy 123\nWe meet em treat em fuck em eazy 123", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Eazy Chapter 8 Verse 10", "lyrics": "(Alright, go)\nThis comes from the E Chapter 8 verse 10, and it reads:\nIt's time to put some niggas in check\nWhen you shoot a gun, hot shells eject\nCatch 'em they get used as evidence\nOnly when they get brushed for finger prints\nYou ask why am I like this\nCause you wanna hear about shit like this\nSo I tell it how I know it, just hope the fuck I don't show it\nNiggas out frontin', loitering and looting\nLet's recreate a drive-by shooting\nMore brothers in a car blocks away\nWaiting to spray, shotgun, Mack-10 and an AK\nThey roll through to a line of niggas\nIt was 9 just like the fuck they figured\nGo around tha corner come back real slow\nLights off, car's in neutral, rollin' at a snail's pace and creepin'\nHoping to catch all of them sleepin'\nA so-called gang, drugs and sex (NWA)\nStart busting a cap and all the others jet, 3 of 'em fall to their doom\nPronounced dead at the scene, with gun shot wounds\n3 dead because Compton is scandalous\nI'd like to tell you, brother, ashes to ashes, dust to dust (Amen)\nDa da da\n(You will now witness the sound of TV Ang-Ang-Angels)\n(We will now pass around the hat)\n(That's good enough)\nNo it ain't, you fucked up, you fucked up (it's cool)\nNo, it ain't", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Eazy Duz It", "lyrics": "[Intro: Michel'le +  Eazy-E]\nHe was once a thug from around the way\nEazy, but you should\nBitch shut the fuck up, get the fuck out of here\nYo, Dre (What's up?) give me a funky ass bassline\n\n[Bridge]\nWhat the fuck is up?\nIn the place to be\nComing on the mic is Eazy-mothafuckin-E\nDre is on the beat, Yella's on the cut\nSo listen up close while we rip shit up\n\n[Verse 1]\nWell I'm Eazy-E, I got bitches galore\nYou may have a lot of bitches but I got much more\nWit my super duper group coming out the chute\nEazy-E, motherfuckers, cold knocking the boots\n'Cause I'm a hip-hop thugster - I used to be a mugster\nIf you heard (Dopeman), you think I own a drugstore\nGetting stupid because I know how\nAnd if a sucker talks shit, I give him a (POW)\n8 ball sipping, the bitches are flipping\nSlow down, I hit a dip and, continue my tripping\nHitting my switches, collect from my bitches\nThe money that I make so I can add to my riches\nFill my stash box and start rubbing my gat\nFeeling good as hell because my pockets are fat\nA hardcore villian cold roaming the streets\nAnd wit a homie like Dre just supplying the beats\n\n[Hook]\nBecause I'm a gangsta having fun\nNever leave the pad without packing a gun\nHitting hard as fuck, I make you ask what was it\nBoy, you should have known by now, Eazy-Duz-It\n\n[Bridge]\n(\"I was\") (\"knocking muthafuckas out\")\n(\"What's your name, boy?\")\n(\"Funky, fresh Eazy-E\")\n(\"Kick, kick that shit\")\n(\"Where you from fool?\") (\"Compton\") (\"Yeah!\")\n\n[Verse 2]\nRolling through the hood, cold tearing shit up\nStick my head out the window and I say what's up\nTo the niggas on the corner cold bumping the box\nBut you know that's an alibi for slanging the rocks\nA dice game started so I said what the fuck\nSo I put my shit in park and had to try my luck\nHard to roll wit my bitch jocking 24-7\nRolled them muthafuckas, ate 'em up, hit 11\nGot another point, I made a ten a fo'\nWas taking niggas money and was itching for mo'\nLaughing in their faces and said you're all making me rich\nTill one punk got jealous, cold slap my bitch\nHe pulled out his gat, I knew he wouldn't last\nSo I said to myself, homeboy, you better think fast\nHe shot (gunshots), Then I shot (gunshots)\nAs you can see, I cold smoked his ass (ha ha)\n\n[Hook]\nBecause I'm a gangsta having fun\nNever leave the pad without packing a gun\nHitting hard as fuck, I make you ask what was it\nBoy you should have known by now, Eazy-Duz-It\n\n[Interlude: Dr. Dre + Eazy-E (MC Ren)]\nWait a minute, wait a minute, who does it\nMuthafuckin' Eazy does it\n(But how does he do it)\n\"Eazy duz it, do it eazy, that's what I'm doing\"\n(\"Stop!\") (Man, whatcha gonna do now?)\n\n[Verse 3]\nNow I'ma break it down just to tell a little story\nStraight out the box from the gangsta category\nAbout a sucker, a sucker muthafucka\nHe's addicted, he's a smoker but in Compton called a clucker\nHe used to have a house car and golden rings\nBut the cooky cooky crack took all those things\nHe must of been starving 'cause he broke in my house\nCaught the nigga on the street and straight took his ass out\nNow I'm wanted for a murder that I had to commit\nYeah I went to jail but that wasn't shit\nGot to the station about a quarter of nine\nCall my bitch to get me out 'cause I was down for mine\nThe bitch was a trip cold hung up the phone\nNow my only phone call was in the ganking zone\nAll the SHIT I did for her like keeping her rich\nI swear when I get out, I'm gonna kill the bitch\nWell by now you should know it was just my luck\nThe bailiff of the station was a neighborhood cluck\nI looked him straight in the eye and said what's up\nAnd said let's make a deal, you know I'll do you up\nNow back on the streets and my records are clean\nI creeped on my bitch wit my Uzi machine\nWent to the house and kicked down the do'\nUnloaded like hell, cold smoked the ho\n\n[Hook]\nBecause I'm a gangsta having fun\nNever leave the pad without packing a gun\nHitting hard as fuck, I make you ask what was it\nBoy, you should have known by now, Eazy-Duz-It\n\n[Outro]\nFrom around the way, born in '73\nHarcore B-boy named Eazy-E\nIt's '88 now, '73's obsolete\nA nigga with a serious ass attitude and a hundred percent street\nAnd if you all wanna hear some more...\nIn one way or the other, I'm a bad brother\nWord to the muthafucka", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": null, "title": "Eazy-E - Niggaz Ain't Dead (Sniper Remix) (Dirty)", "lyrics": "[Eazy-E]\nNow everythings good in my hood\nAnd its on and poppin' Eazy-Muthaphukkin-E\nFrom East Side South Compton\nStr8 givin' up the real\nOn how a nigga feel talk that shit\nMuthaphukkaz caps get peeled\nLayin' low in the cut\nGettin higher than a muthaphuka niggas knows whats up\nI'm that gangsta, gangsta is that what there still yellin'\nNigga G to a T saggin' and bailin'\nLive by the gun you know what I'm sayin' Ren\n\"Yea\"\nSo I guess I'll die by that muthaphukka then\nSo when I die niggas bury me\nMake sure my shit reads Eazy-Muthaphukkin-E\nAnd it's a fact to be exact my tombstone should read:\nHe Put Compton On That Map\nAnd thats how a nigga feel\nWhen I'm givin' up Tha Muthaphukkin Real\n\n[Chorus]\n\n[MC Ren]\nThey say real niggas was dead but this nigga be alive\n[DJ Yella]\nEazy muthaphukkin E, muthaphukkin god father of gangsta rap\n[MC Ren]\nThey say real niggas was dead but this nigga be alive\n[Eazy-E]\nWell I'm Eazy-E I got woman galore (x2)\n\n[M.C. Ren]\nWell it be the real niggas back\nWith that hard street shit\nBitch niggas be pissin a fit\nBut I say fuck 'em, when I buck 'em\nIts that nigga with the cool and mellow shit\nFor your ass takin' niggas back through the past\nAll up on my nutz shit be swingin' like a fist\nCan't even take a piss\nIf I did niggas would cut they wrist\nIn a muthaphukkin candy 4\nBeat that ass with the switch\nThen blast on the bitch\nWho was all in my shit\nIts that nigga Ren back for the 9-5\nThey say real niggas was dead\nBut this nigga be alive\nSo I'm puttin' it down wit that nigga E uh-huh\nFor all of my niggas in the C-P-T\nSo here we go again with part 3 of the script\nMakin bitch made niggas bite they lip, when we dip\nSo tell me how the phuck do it feel\nTah get hit wit Tha Muthaphukkin Real\n\n[Chorus]\n\n[MC Ren]\nThey say real niggas was dead but this nigga be alive\n[DJ Yella]\nEazy muthaphukkin E, muthaphukkin god father of gangsta rap\n[MC Ren]\nThey say real niggas was dead but this nigga be alive\n[Eazy-E]\nWell I'm Eazy-E I got woman galore (x2)", "year": null}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Eazy-er Said Than Dunn", "lyrics": "[Dre]\nYo man I don't think they heard you\nWhy don't you tell 'em what ya name is\n\n[Eazy-E]\nMy name is Eazy yeah this is true\nKeepin' your attention is what I'm gonna do\nHardcore yo I could never be soft\nAskin' me my defin' they say the boy goes off\nFillin' up my memo with the touch of my rhyme\nSuckaz stayin' with me cause they know the time\nQuiet on the set because I'm about to begin\nAnd if you didn't hear me boy I'll tell you again\nMy name is Eazy or just call me E\nBut It doesn't really matter to me\nCause I'm the same person\nWhether serious or rehearsin'\nI just gotta keep cursin'\nThis is for the radio so I better chill\nThey won't play it if I co get ill\nBut I'm like that and thats an actually fact\nBecause the street is where my heart is at\nYo I don't do dope but I'm dope not a dope\nBut I'm doper than anybody who tries to cope\nIf the rhyme I'm displayin'\nAnd the beat that's playin'\nYo you could try all day\nAnd you still won't match up with the Ruthless P.O.W\nCause Eazy's doin it Compton style\nThats the city and you say you could get some\nYo it's Eazy-er Said Than Dunn\n\n[Hook]\nWooooooo!\nWooooooo!\n\n[Eazy-E]\nNow it's easy for me to get my point across\nSo listen up close if ya don't ya might get lost\nI'm not a role model or a Dr. Seuss yo I'm a gangsta\nAnd I'm about to get stupid\nI guess its time for the trama\nWith the E-A-Z-Y-E comma now that's drama\nSo pay attention by the way I must mention\nI'm comin' off hard in the third dimension\nWith the glare\nBut you don't need no glasses to stare\nIt'll probably take you in and it's just like your there\nWith the E on the gangsta tip\nSo if you think I'm a flip or slip don't even trip\nCause I'm a destroyer\nMy homie Dre is a doctor not a lawyer\nDope mc employer on Ruthless and thats my label\nTo get the money, the women, and co bust the fat cable's\nBoy, master rhymers of toys\nI mean str8 while ya suckin' with the girls enjoy\nYou must be sick or ya lonely\nHow ya gonna diss me if ya don't even know me\n(Eazy - E: Yo Ren)\n(M.C. Ren: What sup)\nGet the gat show 'em where it's at\nAnd that's just the sound\nAnd next time I'm peelin ya cap\nTo let ya know where I'm comin' from\nEazy said it and it shall Be Dunn\n\n[Hook]\nWooooooo!\nWooooooo!\n\n[Eazy-E]\nCreating dope jams is a part of the cycle\nEazy-er said than Dunn yeah thats the title\nRubbin' the lady's only the fly ones ya know\n(M.C. Ren: but what if she's ugly)\nEazy come Eazy go\nDon't ask to battle me home boy what's that\nYou wanna battle me boy ya better be strapped\nCause where I'm from it ain't all about that playin'\n[*gun shots*]\nNow that's what I'm sayin'\nSaid before that I was born in '73\nNow everybody want's to know the A-G-E\nGirls on the tip fellaz too it seemed\nHad everybody thinkin' I was only 15\nThe fellaz would annoy me\nThe ladyz would adore me\nAnd what was I to do\nI wishin' nothin' but to let the lady's through\nCause the ladyz I luv 'em\nNice and then soft\nI hate male groupies so just step the hell off\nI'm the real Eazy cause others be fakin'\nTryin' to game fame off the name I'm makin'\nSayin' on your records you could get some\nYo home boy its Eazy-er Said Than Dunn\n\n[Hook]\nWooooooo!\nWooooooo!", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Gangsta Memorial", "title": "Eazy Street", "lyrics": "[Verse 1: Eazy-E]\nNow I'mma Break it down and tell a story\nAbout a nigga in the wrong territory\nSharon and Shide is who he had to meet\nHe made a right turn down the wrong street\nNow whatta, whatta, whatta, what a pity\nA new jack in my motherfuckin' city\n\nCompton that is\nThey say it's niggas pimpin'\nGangsta limpin'\n\nBut back back to the nitty gritty\nBout this nigga slippin' in my fuckin' city\nBy the time that he realized that he fucked up\nThe stupid muthafucka got a foot in his ass\nNow this is how the story goes\nDon't you ever bring your ass\nIn my neiborhood fuckin' my hoes\nCause they my hoes and I knows\nWhen they've been fucked\n\n\"Fellas, I'm ready to get up and do my thing.\"\n\"Doin' it you know.\"\n\n[Eazy-E]\nNow lets get the story about the bitches\nAnd tell how this kid went from right to riches\nNow he's drivin' fancy cars gettin' bitches galore\nHe was a dirty little boy that I knew next door\n\n[Dr. Dre impersonating Mack Romey]\nMack the muthafuckin' Romey\nThe one and only\nMy dick's too hard to be lonely\n\n[Eazy-E]\nNow this muthafucka braggin' on how\nHe got all this and that and he got\nAll these bitches callin' him Big Daddy\nAin't that a bitch how this muthafucka\nGet rich on my muthafuckin' street\nThat's supposed to be my goddamn money\nAnd this bastard is use to wear platform\nShoes, plad pants and nappy-ass hat under\nA fucked up hat now lets kick the story\nAbout that\n\n[Eazy-E]\nWhen the sun falls\nAnd the shit falls down\nSo when people start comin' around\nKnockin' at the door sayin' we want more\nAnd moms wonderin' what the fuck they here for\nRock cocaine, yeah, just as I figured\nBut he can do that cause he's that nigga\nFrom Eazy Street on the road to riches\nMoney, cars, houses, and hoes\nThat's how the story goes\nAnd if the nigga stays up you\nKnow he can't be beat\nAll this shit happens on Eazy Street\n\n[Eazy-E]\nNow back to the story about the bitches\n\n[\"About the what?\"]\n\n[Eazy-E]\nThe bitches, the bitches, the bitches yo\nThe bitches that wanna get with me\nThe E, the A, the Z, the Y, the E\nSo whats up bitch you wanna play\nYo why don't you kiss whats behind the button display\nMy dick gets\n\n[Eazy-E]\nLike Ballpark Franks baby\nPlump when you cook 'em\nYou know what I mean\nMy dick gets\n\n[Dr. Dre]\nHiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiigh up\n\n[Eazy-E]\nHigher than a muthafucka\n\n[Dr. Dre]\nShit thats sure enough funky right there\nYo E, kick some knowledge man explain to 'em\nWhat you mean\n\n[Eazy-E]\nUh oh day\nDay dum day\nCome on baby why don't ya suck it this way\nAaaaah ooooh\n\n[Dr. Dre]\nShit don't find the phillie baby\nLet it all hang out\n\n[Eazy-E]\nI feel it comin' (I feel it comin')\nIt's comin' out (it's comin' out)\n\n[Dr. Dre]\nKick it one more time\n\n[Eazy-E]\nUh oh day\nDay dum day\nCome on baby why don't ya suck it this way\nAaaaah ooooh\n\n[Eazy-E]\nUh oh day\nDay dum day\nCome on baby why don't ya suck it this way\nAaaaah ooooh\n\n[Dr. Dre]\nOh yeah E give me a solo\n\n[Eazy-E]\n[*Talking Weird*]\nIt all happens on Eazy Street\nYou stupid muthafucka!", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Eternal E", "lyrics": "[Intro: Yella talking]\nYo, this is Yella\nAs we wind down to the final song\nI wanted to make this one to remember my lil' nigga E\nI know he wanted this track on his record\nThough he was taken from us too god damn soon\nSo I finished it for him, peace nigga\n\n[Verse 1: Eazy-E]\nWe did a song \"Fuck Tha Police\", you know\nAnd everybody been hearin' fuck sayin'\nFuck tha police for years and years and years\nAnd finally it took a motherfucker to video tape\nA nigga gettin' the shit beat out of him\nFor everybody else to say fuck tha police\nAnd we did fuck tha police, people put us down\nAnd sayed we were ahead of our time, you know it\nTook the video, you know, ya shot by accident\nTo tell the truth and open the world's eyes\nYes, we do have a serious problem in L.A\nAnd other citys true retaliate happens all the time\nPeople tryin' to change things for years but I don't\nThink anything is gonna help the problem is to deep\nN.W.A. is just bein' brutally honest\n\nCity of Compton (x2)\nCity of, city of Compton, baby, baby\n\n[Verse 2: Eazy-E]\nThey swearin' on cable TV it ain't teachin'\nNobody nothin' new cause little kids grow up\nYou know one, two years old hearin' there mother\nSayin' fuck this, you little son of bitch I beat\nThe shit out of you and all this shit and you know\nThey pick up from all the shit and you know so they\nLearn shit, you know, it's not gonna be teachin'\nMotherfuckers nothin' new cause I got some new words\nFor your ass\nNumber one: We don't tell you to go out and gang bang\nWe tell you ya know and our songs is as you\nKnow if you could go out stealin' and killin'\nAnd beatin' up people all day but that person\nEnds up dead or in jail sometimes he gets away\nYou know and we don't have no rags no red no blue\nRags and tellin' we gonna go out and creep or go\nOut and do that other thing or whateva it is\nYou know we ain't tell you to be joinin' no gang\nOr whateva else\n\nRollin Down (x3)\n\n[Yella]\nEazy-muthaphukkin-E\nThe hip-hop thugsta\nFrom the CPT\nCompton style\nReal niggas\nNigga for life\nWe don't die (x3)\nI'd like to send all my love out to his kids\nAnd my Godson Derik, Little D\nTo all his family\nTo his wife and everybody who loved him\nAnd the people that didn't love 'em\nYo E, tell these niggas whats up\n\"I say fuck 'em\"\n*laughing*\nI tried that's right fuck these motherfuckers\nTo all the real niggas out there\nWe still in this, motherfucker\nBeware ... '96 style ... '96 style\nYeah big man, we out\n\n[Eazy-E]\nAs I was sayin' before\nSee ya 'round, buddy boy\nI'm feelin' to fuck all\nGoodbye\n*laughing*\nOooh shit", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Exxtra Special Thankz", "lyrics": "19 muthaphukkin 9-3\nAnd I'm back in this, bitch\nEazy-muthaphukkin-E the hip hop thugsta\nShout goes out to those fake-ass notorious, hahaha\nMuthaphukkin wannabes\nI'd like to say what's up to my bitch Dre, haha\nWhat's up honey\nHo go make E some mo' money, baby\nAnd to that skinny ass, punk muthaphukkin mangy-ass trick\nSnoop Doggy Doggy Dogg, what's up nigga\nDog catchers about to get ya\nMuthaphukkin mutt\nAnd if y'all niggas don't know what's up\nY'all better ask somebody\nY'all better ask somebody\nY'all better ask somebody", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": null, "title": "Final Words", "lyrics": "\"I may not seem like a guy you would pick to preach a sermon. But I feel it is now time to testify because I do have folks who care about me hearing all kinds of stuff about what's up.\"\n\n\"Yeah, I was a brother on the streets of Compton doing a lot of things most people look down on -- but it did pay off. Then we started rapping about real stuff that shook up the LAPD and the FBI. But we got our message across big time, and everyone in America started paying attention to the boys in the 'hood.\"\n\n\"Soon our anger and hope got everyone riled up. There were great rewards for me personally, like fancy cars, gorgeous women and good living. Like real non-stop excitement. I'm not religious, but wrong or right, that's me.\"\n\n\"I'm not saying this because I'm looking for a soft cushion wherever I'm heading, I just feel that I've got thousands and thousands of young fans that have to learn about what's real when it comes to AIDS. Like the others before me, I would like to turn my own problem into something good that will reach out to all my homeboys and their kin. Because I want to save their asses before it's too late.\"\n\n\"I'm not looking to blame anyone except myself. I have learned in the last week that this thing is real, and it doesn't discriminate. It affects everyone. My girl Tomika and I have been together for four years and we recently got married. She's good, she's kind and a wonderful mother. We have a little boy who's a year old. Before Tomika I had other women. I have seven children by six different mothers. Maybe success was too good to me. I love all my kids and always took care of them.\"\n\n\"Now I'm in the biggest fight of my life, and it ain't easy. But I want to say much love to those who have been down to me. And thanks for your support.\"\n\nJust remember: it's YOUR real time and YOUR real life.", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "First Power", "lyrics": "[Eazy-E]\n\"I am the resurrection and the life. He who believes in me though he die, yet shall re-live. And whoever lives and believes in me shall never die. Shhhhhhhh, shut up, bitch. Fear not them which kill the body. Rather fear him that's able to destroy both body and soul in hell. Get thee behind me Satan and push me along.\"\n\n[Satan]\n\"All this power I will give thee, if thou there for will worship me, all shall be thine.\"\n\n[Eazy-E]\n\"Come with me, bitch, as we walk through the door backwards. Heaven in art which father our, our father which art in heaven.\"\n\n(Hey motherfucker!)\n\n*gunshot*\n\n[Eazy-E]\n\"See ya 'round, buddy boy.\"", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "Folsom Prison Gangtaz", "lyrics": "[Verse 1 - Eazy-E]\nAw yeah, let's take a trip\nJust sit back and light a spliff with this and don't slip\nOn a funky-dope track jump back\nStrapped with a fat buddha sack and a 7-8 flak\nCome clean, gangsta lean, I got green\nBut I serve dubs like it ain't no thing\nI hang with OG playaz don't set trip\nOr you might get what we call the rat pack\nI don't slack when it come to street\nI kick real G funk to a gangsta beat\nIt's so sweet, when you got money to spend\nI got a proper big tilt and a fly-ass Benz\nI make ends, spend my dough on no ho\nThat's how it is, and that's how it goes\nAct like ya know when I creep real slow\nGivin' love to them playaz that I know is real Gs\n\n[Chorus - Johnny Cash]\nWhen I was just a baby\nMy mother told me, \"Son, always be a good boy\nDon't ever play with guns\"\nBut I shot a man in Reno\nJust to watch him die\nWhen I hear that whistle blowin'\nI hang my head and cry\n\n[Verse 2 - Eazy-E]\nDump dump on fools with a quickness\nAnd they got no cure for this sickness\nI get paid for the way that I kick this\nLike a g-ster, an OG-ster (Who's that?)\nA real playa named Eazy\nAnd I live my life straight crazy\nDon't need no punk fools payin' me\nAnd broke groupies and hoochies don't faze me\nI take two steps back and release myself\nTo put platinum and gold on the record shelf\nI don't brag, but I tell it like it straight up is\nBefore you do a record, partner, handle your business\nAnd don't get caught slippin' on the under\nOr you might wonder (What's up with them ends, G?)\nI call a spade a spade and get paid\nGs show the way, so I give love to 'em\n\n[Chorus]\n\n[Verse 3 - Eazy-E]\nE-A-Z-Y, must I\nChase the cat and be a dog, a straight up hog\nI leapfrog to the sound of a gangsta beat\nSo I can hear my record bumpin' on the Compton street\nThat OG, P-I-M-P and Loc, G and Loc\nHip-Hop thugsta, so quick to rush ya\nStraight to the dirt, fool I do work\nNobody move, nobody get hurt\nThat's how it is when it come to me\nCuz I'm the short but wicked playa named Eazy\nWomen can't play me, some say I'm crazy\nBut I don't think so, come if you're a loco\nI gives a damn about a skanless trick\nLet me hit it one time and trick that sick\nBut don't trip, gives my dough to no ho\nThat's how it is, I got no love for ya\n\n[Chorus]\n\n[Outro]\nIf you got love for them gangstas\nLet me hear you one time if you down for the crime (That's right fool)\nIf you got love for them hustlas\nLet me hear you say hooo if you makin' straight dough (Hooooo!)\nIf you got love for them playas\nLet me hear you say ooooh, ladies we want you (Ooooooh!)\nIf you got love for them straight Gs\nAnd you wanna be down just scream (Heeeeeeey!)", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Gangsta Beat 4 Tha Street", "lyrics": "[Verse 1: Dresta]\nI got beat for the street\nTo pump in ya jeep\nOr in ya caravan wit' tha homies kinda deep\nSmokin' on a thai stick feelin' kinda high wit'\nYa passenger seat occupied by a fly bitch\nRollin' in your lo-lo\nCutlass, or your M-C\nSlap in the hip-hop\nTo hell with the Temprees\nModern day gangsta from the underground, yeah\nNiggas roll around wit' the boomin' ass sound\nGot the 6-4 kinda low as we bouncing\nOn the Grapevine rollin' deep to Magic Mountain\nHoes on ya jock everytime ya hit a corner\nBecause ya rollin' twisted on the gold Daytonas\nFrontin' on the regular, talkin' on ya cellular\nActin' like ya don't hear the little bitches yellin' ya\nName at the bus stop, ya don't stop\nYa mash on the gas, roll right by they ass\nSlap Dresta in the dash, yeah\n\n[Hook: Dresta]\nGuranteed to hear some sweet, uh\nGangsta beat for the street\nGuranteed to hear some sweet, yeah\nGangsta beat for the street\n\n[Verse 2: Menajahtwa]\nI got beat for the street, drop a ragtop fo'\nGot my strap under the seat, just in case I have to check a ho\nMenajahtwa on the scene, yeah\nRollin' through the C-P-T\nTurn up the hump sounds, we groovin' to the mellow beat\nMad doggin' like bitches, hittin' me up like I'm a banger\nCause niggas can't stand to see us sittin' on some daynas\nPimpin' game on the fools, runnin' the track thinkin' ya gone\n'n if the twizza I ain't tweakin', chump, we puttin' the lock on it, yeah\n\n[Hook x2]\n\n[Verse 3: B.G. Knocc Out]\nBeat for the street\nI love to hear it pumpin' in my lo-lo\nHittin' my switches and runnin' the bitches\nAnd now I'm bustin' mo' hoes\nRoll up to the swapmeet, hop out and hit the chirp chirp\nBail in put on some proper shorts and a proper shirt\nJust clownin' cause hoes are in the house\nRidin' my dick because I got fame and my name is B.G. Knocc Out\nAsking to be in my next video\nGet the 7 digits, slap that ass and said \"See ya, ho\"\nNow I'm off like a G, flee to the C-P-T\nSee my niggas on the block gettin' tipsy\nI pulled up and start tearin' up the street\nAnd guess what's in my motherfuckin' deck\nGangsta beat for the street\n\n[Hook]\n\n[Verse 4: Eazy-E]\nI got beat for the street, to the beach I'll be rollin'\nNever see me strollin'\n40s I be holdin'\nGirls in the Daisies\nDrive Eazy crazy\nRolled up my windows, as I turned on my A/C\nRollin' down Crenshaw see tha hoes jockin'\nSunday night's poppin'\nSee the foes hoppin'\nMy stereos bump at that A-T-L funk\nYou can call it what you want\nEither way that shit bumps\n[Dresta: \"Damn Right!\"]\n\n[Outro x4: Eazy-E]\nBein' a gangsta is so neat, yeah\nGangsta beat for the street", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Gimmie That Nutt", "lyrics": "[Intro]\nCruisin' down the street in my '64\n\n[Verse 1]\nIt's like that and it's like this\nI took her to the pad and we started to kiss\nNow my dick's on hard, you know what I'm thinkin'\nTook the panties off and the pussy wasn't stinkin'\nPulled off my drawers and we started to begin\nNow the pussy's wet so my dick slides in\nOh, Heidi Heidi Heidi you ho\nRidin' from the back so I'm pumpin' kinda slow\nSo fee-fi-fo-fuck-fum\nShe's scratchin' on my back oh here she comes\nNow I gotta get a nut gotta get a nut gotta get it quick\nYou know because I love this shit so\n\n[Hook]\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, Gimmee that, Gimmee that nutt\n\n[Verse 2]\nOkay back back to the fuckin' basics\nYou got yours and mine you want to taste it\nOpen wide oh no don't you waste it\nOh shit all over you face kid\nYou know you know one thing\nYou know me I like to slang\nThat dick you know what so roll over girl while I stick it in ya\nBut I'll trade it all while I'm ridin' that ass scream and shout\nMy name is the same\nJust another pussy that I had to tame soooooooo\n\n[Break]\nUh, get it all baby\nUh, get it all baby\nUh, get it all baby (lick my balls honey)\n\n[Hook x2]\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, Gimmee that, Gimmee that nutt\n\n[Verse 3]\nNow I love pussy\nAnd pussy loves me\nLike a lemon to the lime and the bumble to the bee\nYou know its real good, a nigga can't resist it\nCouldn't be a fruit loop so don't get me twisted\n''Cause in some pussy is the place to be\nAlways fuckin' is the life for me\nSpread them legs open far and wide\nFuck this shit just let me put my dick inside, soooooooo\n\n[Hook x2]\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, Gimmee that, Gimmee that nutt\n\n[Break]\nUh, get it all baby\nUh, get it all baby\nUh, get it all baby (gently put the ballhaaaaa)\n\n[Hook x2]\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, that, that nutt\nGimmee that, Gimmee that, Gimmee that nutt", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Hit the Hooker", "lyrics": "[Eazy-E]\nBig titty chitty bang bang sittin' on a dick\nTryin' to play a pimp by the fifteen tricks\nHoes play with me weekly\nSo I'm down wit ol' ho play with my pee pee\nEazy muthaphukkin' access\nSaggy baggy ass pants for a happy ass bitch\nHo ho ho to the ho in the cold\nSki to the E or piss in the snow\nI take a ho from the show to the mo' to the flo'\nTo the inches below, now the ho has gotta go\nPussy just as hairy as a panda, pinker than pink panther\nPanty expander, tricks lick long while I lap hard long and fast\nWhile I'm pimpin' honey's ass\n\n[Hook]\nThrowin' harder with Barbara\nSeein' sexy with Betsy\nGettin' ready for Betty\nI hit the hooker heavy\nI hit the hooker heavy\nReady to.... (x4)\n\n[Eazy-E]\nUse a finger to wet them real niggas comes to spread'em\nHittin' other peoples bitches so I'm comin' to ya weddin'\nHead and the bill in the dark I begin with my dick\nSo you can say I have a head start\nComin' from the south of the border, cause I'm shorter\nThan ya thought I was your wife, whore, daughter in the order\nFuck all that one-man one-bitch shit\nOne condom, one dick, switch\nTo another after I'm done with the rubber\nYou can lick me like a lover wipe your mouth on the cover\nI never dilly dally pimpin' Susan and Sally\nNow you can find the couchie from Miami to Cali\n\n[Hook]\nThrowin' harder with Barbara\nSeein' sexy with Betsy\nGettin' ready for Betty\nI hit the hooker heavy\nI hit the hooker heavy\nReady to.... (x4)\n\n[Eazy-E]\nBitches comin' with it for doublemint\nLookin' for ya homies\nHoes blow me like they owe me\nI got a strip I hit when I'm lonely\nHit a bitch with a whip and she'll run like Toby\nSo never clown me fool I'm from the true school\nWit true sluts lookin' for a crew screw\nI flip and I flow when they go kinda low\nHo better have my dough so suck silly\nHookers could stay\nOh, you don't touch nuts? Really? Hooker, good day\nAdios, disappear like a smoke, your ejected\nBy a dick that's erect bitch\nSometimes I think I'm losin' it, a lunatic\nWith a lot of automatic shit with clips\nIt ain't no thang to me it's the same ol' slang to me\nI roll with a long size gang with me\n\n[Hook]\nThrowin' harder with Barbara\nSeein' sexy with Betsy\nGettin' ready for Betty\nI hit the hooker heavy\nI hit the hooker heavy\nReady to.... (x8)", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "House Party", "lyrics": "[Verse 1: Eazy-E]\nIt's 1:45 in the morning\nEverything's all good in the hood but it gets boring\nNow I creeps around to the backdo'\nMom's done locked so I bails out the window\nAw home, street home\nAnd there's a house party down the street\nIt's going on\nI bails through the door\nAnd guess who did I see?\nChan Loc, Sylk, Diamond and T-Ski\nAnd it's all goin' down like this you know\nEazy-E, C-P-T\nGo on Sylk, flow....\n\n[Verse 2: Sylk-E. Fyne]\nWell, it's the S, the Y, the L, the K\nNow come on little closer and get played\nStraight bombin'\nPuttin' it down with that little fool from Compton\nSouth Central definitely G.B.M for life\nSo pay the price\nLife's too short, so I gamble\nDon't give a damn so\nI grabs the ammo\nSmoke up that indo n' gotta make that money gotta make that\nTo build the stash\nAin't here to play\nAin't here to stay\nBut I'm here to put it down the ruthless way\nMake my papers with my folks\nThey ??? with my locs\nMuch love to them girls, much love\n\n[Verse 3: T-Ski]\nT-Ski, Loc didn't you know that I\n(...???...)\nTalkin' behind yo back but won't say it to your face\nI gotta break;\nGet bizzy go Chan, get bizzy\n\n[Verse 3: Chan Loc]\nHave you ever seen her\nThat mad bitch that they call Chan\n24/7 with the Glock in my hand\nNow god damn\nI'm ??? up the cental strips\nComin' in the chevy\nHopin' with the heat\nDeep, rolling as we mobb to the beach\nI got the silver gat and the great ????\n[Laugh]", "year": null}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "I'mma Break It Down", "lyrics": "[Verse 1]\nMy eternal jam is the juice of the radio\nTakin' out profanity so they can play it though\nListen to a hell of a kick and the hi-hat\nGoing to the record store say ya gonna buy that\nThe E is connected to the A and the Z ya say Y\nSo that's how the beats stack it up on material made of hits\nTakin' my time of Eastline to make sure it fit\nPush play on the instrumental thats recorded\nStep on stage and I'm suddenly awarded\nSome sort of trophy like a plaque\nAnd some hell of a scream from the girls in the back\nTakin' a bow 'cause I got style\nNever at the bottom of the ways on the top of the pile\nYo it's Eazy on top even though I'm short\nGuarenteed to help when I walk on the court\nSo get up make some noise for the gangsta clap\nDon't attempt the laugh I'm not a pranksta\nI'm serious create sounds so quit playin' around\n'Cause I'ma break it down\n\n[Verse 2: Eazy-E +  MC Ren ]\nLast time I was takin' my time with this\nBut other suckas were makin' a rhyme with this\nI had to change the tempo or make it hyper\nBut they was rotten, I was gettin' riper\nReady to go, like never before\nGivin' you more because I'm ready to score\nRen is my buddy you can tell I said often\nHelpin' me destroy the suckas that soften\nCurin' diseases, my rhyme pleases, throw it a key\nBalls havin' seasons, this is a doctrine\nAnd I'm locked in, and I made up my mind\nAnd I think I'm gonna rock then\nYou got bitches chill and I'ma push ya\nTo freeze after I'll cut ya 'cause I'ma butcher\nAnd say ya have pricin' and then out ya go\n'Cause a percentage on pork bellies are very low\nMessin' with a gun but once ya get hurt\nLike a said before ya get rushed to the dirt\nI'm not a lawman, but I'ma raw man\nBut ya the dopest one I ever saw man\nI keep droppin' it pound for pound\nAnd when I'm on the mic I always throw down\nTo keep y'all dancin' to my funky sound\nSo listen up, 'cause I'ma break it down\n\n[Verse 3]\nNow look at me and not the poster\nAnd you could see right off I got the most of\nThe talent, experience or a trade\nAnd compliments for the rhyme that's made\nTalks over today if this one so\nPick another artist and dis one\nI got the ballet of the chosen vote\n'Cause I don't need water to clear my throat\nComin' from the rain the show is like dancin'\nNasty like and the girls are like glancin'\nWantin' to get wit me this routine\nKeepin' it sprung still stayin' mean\nCan ya dis this man I don't think so\nOnce I start writin' the way I let the ink go\nComin' out with songs like hit after hit\n'Cause this is legit and yours ain't shit\nMakin' it sound so dope 'cause I'm a genius\nBut your amazed with ya happy to see this\nBrother go crazy on wax\nFlowin' away like if I was on a sax\nDoin' a solo in the shade, I'm a spotlight\nRelax and chill while your uptight\nPumpin' up the funky sounds\nYo, you should know it's kinda persist\nThat the E is gonna break it down", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Intro", "lyrics": "Hell yeah hahahhahha\n(tell you niggas wasup)\nHey you thought this shit was over\n(it ain't over motherfucker)\nWe still ruthless mothers\n(mhhahahah yeah)\nIts been more than decade (more than a decade mothafucka)\nEazy mothafuckin e\nThe hip hop thugsta (hip hop thugsta)\n(like a motherfuckin hip royal bitch ass niggas)\n(killas)\n(way back)\nEazy motherfuckin e\n\nI know you niggas is over hahahahahhahah", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "5150 Home 4 Tha Sick", "title": "Intro: New Year's E-Vil", "lyrics": "[spoken by Eazy-E with an evil voice]\nHahahah, 5150\n*LAUGHING*\nThe home for the sick\n*LAUGHING*\nBut I got something I want everybody to know\n*LAUGHING*\nHey buddy boy, hey buddy (pisp) (pisp) buddy boy, hey\nYou know who you are, motherfucker\n*LAUGHING*\nYou thought I couldn't do it with out ya right\n*LAUGHING*\nYou stupid motherfucker, but anyway, buddy, I'm baaaaaaack\n*LAUGHING*\nEat a dick up, motherfucker", "year": "1992-12-15"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "It's On", "lyrics": "[Produced by Rhythm D]\n\n[Movie Sample]\nToday's a good day to die (screaming)\n\n[Intro]\nBow wow wow yippie yo yippie yay\nSuck on these nuts, nigga, suck on these nuts\nI tell 'em bow-wow-wow yippie-yo yippie-yay\nSuck on these nuts, nigga, suck on these nuts\nIt ain't nuthin' but Eazy baby\nHe'll smoke two niggas cause they crazy\nTalk a gang of shit but it dont phase me\nThat punk nigga Dre still pays me\n\n[Verse 1]\nWell, if it's on motherfucker then it's on, G\nNow if it's on motherfucker then it's on, G\nHey mister prankster prankster\nStory book gangsta\nBack in '86 you wore pumps and mascara\nDown with the motherfuckin' Wreckin Cru, bitch\nBut once a bitch, always a bitch and now the fuckin' switch\nFag, with stethescope now you sag\nBody slammin' bitches make Dre a bigger man\nKhaki sportin' loc's in a G ride\nWhat set you from punk what set you from ride\nRip Van Winkle sleepin' nigga woke up and became a G\nBut you still don't impress the Eazy\nSmoke a little sherm now you call that shit the chronic\nNiggas on the westside call it bionic\nI make a mill here, make a mill there\nFuck a bitch here, fuck a bitch there, yeah\n\n[Chorus]\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n\n[Verse 2]\nOld nigga Eazy-E went to the cupboard\nTo get Snoop Doggy Dogg a bone motherfucker\nHere's another G\nOr should I say a H, a I, a J, a K, a L-M-N-O-P\nP for the pussy wussy wuffin' nigga broke\nAs a motherfuckin' joke\nTalkin' about you want to smoke\nThe E to the A-Z-Y\nNigga this east side\nSnoop Doggy Doggy Dogg you wanna try\n187 on the E that ya sing\nBut you cling on my balls when I swing my ding-a-ling\nYeah, you got more juice like a plant of puppy water\nFirst I'm gonna choke ya\nThen I smoke ya, then I'm gonna\nToss ya in the back of my trunk\nWith the other punk\nSmoking Death Row like I smoke a Phillie Blunt\nWell if it's on motherfucker than its on, G\nIf it's on motherfucker than it's on, G\n\n[Chorus]\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n\n\n[Verse 3]\nStill a nigga\nOnce a nigga\nAlways a nigga\nDown from the getgo\nNever let go\nNever flossin\nNever slippin\nNever trippin\nStickin dick and my balls down your throat doggy listen\nNiggas from the LBC\nThey never heard of ya G\nAnd Niggas from the CPT ain't down with D-R-E\nBut ya gave it up\nStill like a trooper\nLet 'em play ya jam shake ya hand and then they shoot ya\nYou can fool the people on the east coast an the mid-west\nBut In LA you still can't pass the test\nSee I can tell a pussy when I see one\nDre wearing lip stick that mean ya have to be one\nYou need to change your sex and your occupation\nYou try to fuck with E nigga Run Run Run\nCause if it's on motherfucker then its on, G\nNow if its on motherfucker then its on, G\n\n[Chorus]\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on\n[Scratched in] Tell ya motherfuckers who you're fuckin' with [Eazy]\n[Eazy-E] Well if it's on motherfucker then it's on", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Just Tah Let U Know", "lyrics": "Eazy ... E , Eazy ... E\nPadapapow... Eazy, padapapow... E\nPadapapow... Eazy, padapapow... E\n\n[Verse 1]\nIt's that man comin' up from that land of tha C-P-T\n(\"What's my motherfuckin' name?\" - Snoop) Eazy-E\nComin' thru with a big lick for '94\nShowin' alla y'all them true-ass gangsta flows\nSo bow-down bow-wow the big dog’s in town\nAnd them guts is the only thing a nigga pound\nLaid back as I blow a fat sack\nHittin' switches for them bitches, been in corners in a Cadillac\nSo take a ride on tha ruthless side\nWith the E to the A-Z-Y\nThat nigga makin' more off yo hits than you do\nYou fools, need to recognize this crew when I roll through\nTryin' to speak up on tha OG, nigga you don't know me\nBreak em off these nuts lil wanna-be\nCause I peel caps if need be\nAnd ain't nothin' you gonna bring don't see me\nJust tah let U know...\n\n[Hook]\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\n\n[Verse 2]\nIt's the E comin' up from the gank\nSo nigga let me ride all the way to the bank\nCoz ain't nuthin' on my mind but them chips\nGotta have a griff, run a nigga dip\nBack to the past on the Compton streetz\nWhere the niggas get beat when us gangstas meet\nAnd fools gettin' mad coz they can't ride like I ride\nFront 'n back, dippin' side to side\nAnd it's been like that since I was BG\n\"It's the E,\" that's what they scream when they see me\nMama said every day is like this\nFools screamin' that I put em in a twist\nThought you had it bad, isn't really all good\nIf the homies only knew in the hood\nThat you was gettin' done like a two dollar ho\nIt's just a lil something from the E tah let U know...\n\n[Hook]\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\n\n[Verse 3]\nIt's still the C-P-T, nuthin' more, nuthin' less\nOn a quest to put that bomb in my chest\nCoz them busta-ass niggas can't see what I'm sayin'\nThey think the E be playin' [What ?]\nBut I ain't givin' up nuthin' but this Glock in yo mouth\nSo recognize that and get yo punk ass knocked out\nSo if you wanna ride nigga jump on in\nSip a cup o' gin. Ain't no friends when it come to ends\nSo no hard feelings when you niggas be dealin'\nWith the original Compton criminal\nCoz the only thing poppin' is a snaps\nAnd ain't no fun when a nigga be tap perhaps\nBut a nigga like the E ain't trippin' though\nI'm just here tah let U niggas know...\n\n[Hook]\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\nOne more time for the rhyme again\nComin' from the C-O-M-P-T-O-N\nJust tah let U know\nJust tah let U know\n\n[Insert]\nYou have your own freedom of choice\nSo you do what the fuck you feel like doin\nTake it from me, that streetwise motherfucker named Eazy E", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "L.A. Is The Place", "lyrics": "L(reprated)\nLa is the place\n\nI'm not a renegade but you wish I was\nJust cuz I like 2 hang wit da boyz n the hood\n\nLive in la always chill on the west coast\nA tilly mogul got it close just I mean to boast\n\nI said whassup we'll who be ridin on you\nNickname eazy-e and I'm down wit da crew\n\nCome talkin that trash\nWe'll burn your car\nHe let the brun(k)(it's not the bronx?)\nIt's la\nBut just as hard\n\nDon't get me wrong I like to brag on the city I own\nSubway rtd don't ride it alone\nYou might have silly thoughts that we're insane\nBut the city I'm from let me explain\n\nIn la there things you do not do\nFirst of all home-boy don't mess wit da crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet or get took off\n\nOne two, it's time to get l\n\nLa Cal I forn ia(3x)\nCity of angels... Hollywood\nWe love it\n\nI turned you on to the best females in the world\nI wish they all could be california girls\nLike the east where you girls where too many coats\nBring your clothesie\nRunny noiseie\nWith a sore throat\n\nThat the girls in the south I cannot bust\nBecause the girls are fly and down with us\nIn the valley not the alley\nIn pina not valley\nEazy-e that's me\nAlways chip and fally\n\nHollywood's a bit of beef\nWhere the scene is raw\nOh yeah the strip is a trip on\nSouth crenshaw\nDon't get me wrong I like to brag on the city I own\nBoy you walk do what?\nDon't walk alone\n\nBecause\nIn la there things you do not do\nFirst of all home-boy don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet or get took off\n\nL(repeated)\nLa is the place\n\nBuild with the brother who build old school\n\nGe'll ge'll lill stuff of that beat box (get get\nGet a little stuff of that beat box)\n\nWest coast style from la\nYes I get's mine, it's got to be that way\nIt's sunny california that's where I be\nIf you forgot I chill with e\nIn the west I stand that's where you fall\nFell it where a punk goes snatching it all\nRhyme by rhyme record by e\nIn the city of l\nWith a devil like me\n\nShe's contaminated where the boys are hard\nAnd people like me don't perpetrate the fraud\nYou wanna mess around\nYou better get wise\nWe'll find your but\nAnd cut you down to size\n\nBecause\nIn la there things you do not do\nFirst of all home-boy don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet or get took off\n\nLa Cal I forn ia(3x)\nCity of angels... Hollywood\nWe love it\n\nBecause\nIn la there things you do not do\nFirst of all home-boy don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet or get took off", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Lickin, Suckin, Fuckin", "lyrics": "[Girl]\nO.k. have to hear it\nLet me hear it\n\n[Eazy-E]\nYou want this baby\nI want it hot and juicy, O.k\nAnd that's the way I like it\nYou know that's right right\nAlright can I kick it\nI mean can I stick it\nSo you want me to slap it\nFlip and rub it down\nAlright I want you to turn\nRound and let me hit it from the back ok\nAlright you like it like that baby\nWho's is it, is it mine baby\nCan I eat it, I mean can I lick it\nCan I stick my tongue all in it\n[*E and the girl going at it*]\n\n[Girl]\nLike it like that, baby\n(You know this feels good)\nYes baby\nRight there Right there uuh\n\n[*moaning*]\n\n[Girl]\nOh yeah baby\nOh yeah\nOh Eric\n\n[-*Cut Off*-]\n\n[Eazy-E Speaks]\nAs I was sayin' before about this other bitch\nThat's fuckin' wit this uh Uncle Tom bitch just\nSayin' that he sexual harassing her so what if the\nMuthafucka sexually harassing her give a nigga some pussy\nKnow what I'm sayin' you know ain't nuttin' wrong wit it\nYou know we did broke him off a little somethin' you know\nBut anyway bitch probably lyin' anyway you know what I mean", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "Lickin, Suckin, Phukkin", "lyrics": "[Girl]\nLet me hear it\n\n[Eazy-E]\nYou want this baby\nI want it hot and juicy\nAnd thats the way I like it\nYou know thats right\nYou know how to kick it\nI mean can I stick it\nSo you want me to slap it\nFlip and rub it down\nAlright I want you to turn\nRound so I can hit it from the back ok\nYou like it like that baby\nWho's is it, is it mine baby\nCan I eat it, I mean can I lick it\nCan I stick my tongue all in it\n[*E and the girl going at it*]\n\n[Girl]\nRight there uuh\n\n[*moaning*]\n\n[Girl]\nOh Eric\n\n[-*Cut Off*-]\n\n[Eazy-E Speaks]\nAs I was sayin' before about this other bitch\nThats fuckin' wit this uh Uncle Tom bitch just\nSayin' that he sexual harassed her so what if the\nMuthafucka sexually harassed her give a nigga some pussy\nKnow what I'm sayin' you know ain't nuttin' wrong wit it\nYou know we did broke him off a little somethin' you know\nBut bitch probably lyin' you know what I mean", "year": null}, {"artist": "Eazy-E", "album": null, "title": "Live at the Roadium Swapmeet (intro)", "lyrics": "[Crackhead:] Ki-ki kick it dre\n\n[Intro: Dr Dre]\nJust in 1-2, 1-2\nRight about now Eazy-E and Dr. Dre is in the motherfucking\nHoooooouuuuuuuuuuuse\n\n[Verse 1: Eazy E]\nTimes are getting crazy\nIt's really hard to choose it\nThe Roadium's about to get funky fresh music\nEazy muthaphuckkin E and my homeboy Dr. Dre\nMC Ren is in effect and you know we don't play\nThe Roadium is hitting but you know you can't leave\nUntil you get a def ass tape from Steve\nOh Steve Oh Steve Oh Steve\nJust gimme just one more tape\nOh Steve Oh Steve Oh Steve\nJust gimme just one more tape\nOh Steve Oh Steve Oh Steve (Dre, Dre scratch)\nJust gimme just one more tape (Dre, Dre scratch)\nOh Steve Oh Steve Oh Steve\nJust gimme just one more tape\n\n[Crackhead speaking:]\nY-yeahh man I came down all the way to the Roadium swapmeet to pick up one of NWA tapes, man ... and I caught the homeboy Steve out there man he said \"I'm fresh outta tapes\", man, how the fuck you fresh outta tapes he said cause they selling like hotcakes an' shit, man ...", "year": "1988-01-01"}, {"artist": "Eazy-E", "album": "Beverly Hills Cop III", "title": "Luv 4 Dem Gangsta'z", "lyrics": "[Verse 1: Eazy-E]\nAw shit, let's take a trip\nJust sit back and light a spliff to this and don't slip\nOn a funky-ass track, jump back\nStrapped with a gat and a sack in a 7-8 'Lac\nCome clean, gangsta lean, I got green\nBud, I serve dubs like it ain't no thing\nI hang with O.G. niggas, don't set trip\nOr you might get a slug in your fuckin' back\nI don't slack when it come to street\nI kick real G shit to a gangsta beat\nIt's so sweet, when you got money to spend\nI got a cool-ass tilt and a fly-ass Benz\nI make ends, spend my dough on no ho\nThat's how it is and that's how it goes\nAct like you know when I creep real slow\nGivin' love to them niggas that I know is real G's\n\n[Hook: Shaki]\nIf you got love for dem gangstas\nLet me hear you one time\nIf you down for the crime (\"That's right, fool.\")\nIf you got love for dem hustlas\nLet me hear you say hooo\nIf you makin' straight dough (*hooooo*)\nIf you got love for dem playas\nLet me hear you say ooooh, ladies, we want you (*ooooooh*)\nIf you got love for dem straight G's\nLet me hear you mothafuckas just scream (*heeeeeeey*)\n\n[Sample]\nThe ruthless network, drive-by expert\nStraight outta Compton, kickin' up dust\nThe ruthless network, drive-by expert\nStraight outta Compton\n\n[Verse 2: Eazy-E]\nDump-dump on a nigga with a quickness\nAnd they got no cure for this sickness\nI get paid for the way that I kick this\nLike a G-ster, an O.G.-ster\n(\"Who's that?\") A real nigga named Eazy\nAnd I live my life straight crazy\nDon't need no punk niggas payin' me\nAnd broke groupie-ass bitches don't faze me\nI take two steps back and release myself\nTo put platinum-ass cuts on the record shelf\nI don't brag, but I tell it like it straight up is\nBefore you do a record, nigga, handle your business\nAnd don't get caught slippin' on the under\nOr you might wonder (What's up on dem ends, nigga?)\nI call a spade a spade, and get paid\nG's show the way, so I give love to 'em\n\n[Hook: Shaki]\nIf you got love for dem gangstas\nLet me hear you one time\nIf you down for the crime (\"That's right, fool.\")\nIf you got love for dem hustlas\nLet me hear you say hooo\nIf you makin' straight dough (*hooooo*)\nIf you got love for dem playas\nLet me hear you say ooooh, ladies, we want you (*ooooooh*)\nIf you got love for dem straight G's\nLet me hear you mothafuckas just scream (*heeeeeeey*)\n\n[Verse 3: Eazy-E]\nE-A-Z – why must I\nChase the cat and be a dog? A straight-up hog\nI leapfrog to the sound of a gangsta beat\nSo I can hear my shit bumpin' on a Compton street\nThat O.G., C-R-I-P and S, G and S\nHip-Hop thugsta, so quick to rush ya\nStraight to the dirt, fool, I do work\nNobody move, nobody get hurt\nThat's how it is when it come to me\n‘Cause I'm the long dick bust-a-nut nigga named Eazy\nBitches can't see me, hoes say I'm crazy\nBut I don't think so, ‘cause I'm just loco\nI gives a fuck about a skankless bitch\nLet me hit it one time if you suck this dick\nI won't trip, gives my dough to no ho\nThat's how it is, but I gives love to ya\n\n[Hook: Shaki]\nIf you got love for dem gangstas\nLet me hear you one time\nIf you down for the crime (\"That's right, fool.\")\nIf you got love for dem hustlas\nLet me hear you say hooo\nIf you makin' straight dough (*hooooo*)\nIf you got love for dem playas\nLet me hear you say ooooh, ladies, we want you (*ooooooh*)\nIf you got love for dem straight G's\nLet me hear you mothafuckas just scream (*heeeeeeey*)", "year": "1994-05-10"}, {"artist": "Eazy-E", "album": "5150 Home 4 Tha Sick", "title": "Merry Muthafuckin' Xmas", "lyrics": "[Dolemite]\nCome on over, honey\nAnd give your uncle Dolemite a kiss\n[*kissing sounds*]\nWell, what you want, baby?\n\n[Baby]\nWould you tell me a story?\n\n[Dolemite]\nYou want me to tell you a story?\n\n[Baby]\nHell yeah!\n\n[Other Baby]\nMe too!\n\n[Dolemite]\nYes honey, I'mma tell you a story\nAbout the bad-ass Eazy-E\nHe was drinking whisky and gin at the age of three\nListen and listen well\nHe's a bad muthafu-\n\n[Mother]\nGimmie that god damn book!\nHere, let me read you this one\nChristmas in Compton\nIt was a silent night, yes, a holy night\nUntil Mr. Claus turned into Santa muthafuckin' Wright\n\n[Carolers]\nDeck the halls with balls of holly\nFa la la la la la la la la\nTis the season to be jolly....\n\n[Eazy-E]\nMerry Christmas, motherfucker!\n[*Gun Shots*]\n\n[Verse 1: Eazy-E]\nMerry muthafuckin' Christmas and a ho ho ho!\nWhile I'm riding that cot under the mistletoe\nNow dashing through the snow\nIn a candy red top 6-4 (hittin' them switches)\nOver the hills I go\nLaughing at this ho\nNuts on her chin ring\nMaking me feel right\nOh what fun it is to know\nThat I'm gonna get this pussy tonight\nSo ring them bells, ring them bells\nShe's taking it all the way\nOh what fun it is to watch her suck my dick this way, hey\nRing them bells, ring them bells\nShe's taking it all the way\nOh what fun it is to nut while she's sucking my dick\nOh yay!\nThis is the season to get bitten\nCompton crime lick and I'm smoking on this shit\n\n[Santa]\nHo ho ho, come sit on my face - I mean lap\nAnd tell me what you want for Christmas, ho ho\n\n[Verse 2: Menajahtwa]\nI want a sleigh ride\nA Christmas Eve stick of rum\nShe said I slide down the chimney and I'm gonna cum\nA VCR on the set with nothing but porno flicks\nGet some Rudolph the red nose reindeer\nGetcha that gum like a everlastin' gobstoper\nGive me a hump for his cock will be the party poppa\nI dig a ho, crack a dough by the nuts oh\nI want to be having a good time fuckin' in tha snow\nI made him drop to his knees\nYeah you know what's up\nI said here's some candy canes eat'em up\nI send him down, they jumping down, swinging by my toes\nSend me some cheese, I want the candy cream and the loot\nI want Santa to send me a little jack horny guy\nI want him to shake me ??\nSo all on the hunt, bon appetite\nAnd a condom in a tree\n\n[Eazy-E]\nAll I want for Christmas is my two front teeth\nMy two front teeth, my two front teeth\nAll I want for Christmas is my two front teeth\nYo wheres ya rhyme tell me Buckwheat\n\n[Buckwheat]\nBuckwheat is a wascal\nThat's no Christmas\nAnd all the toys, boys and girls\nFuck ya wishes\nI not happy, overjoyed in this muthafucka\nNo indo under my tree so Santa be a sucka\nNo shit on the roof, cough up Rudolph's nuts\nWhen I was young I was the only kid\nWho had enough guts to be\nGood ole hearing on the East\nI'd stay awake just to let America know\nThat Santa was a fake\nI used to believe in Saint Dick when Elvis was alive\nBut all the fucking bullshit got played when I was five\nYears old, just stay young, bold writing\nSinging \"Silent Night\", caroling, reciting\nNow all I want for Christmas is my indo wreath\nI got my two front teeth\nUncle Eazy be the jeezy and just spread me a leaf\nLittle kids, don't cry\nWhen you find out the Santa Claus is just a fucking lie\n\n[Eazy-E]\nOn the third day of Christmas, my homeboys gave to me\nThree pounds of indo\nTwo birds of cocaine\nAnd a A muthafuckin' K, bitch\n\n[Hook]\nEazy-E oh Eazy-E\nShow us how you treat those bitches\n\n[Hook]\nI saw mommy fucking Eazy Claus\n\n[Eazy-E]\nClose the door, little bitch\nI'm getting these draws\n\n[Hook]\nI'm a tell my daddy if ya ass don't stop\n\n[Eazy-E]\nI don't give a fuck\nI'm getting Christmas cot\nHo ho ho and away I go\n\n[Hook]\nOh Saint Nick's got a dick like a pole\n\n[Woman 1]\nWell where's our shit?\n\n[Woman 2]\nThis motherfucker's cheap\n\n[Eazy-E]\nShut the fuck up, bitches\nAnd go back to sleep\n\n[Verse 3: Will 1X]\nYo black, what you want for Christmas?\n(Yo black, I want a job)\nFor my Christmas, all the fucked up people\nWant some corn-on-the-cob\nA Jew will eat some matzoh ball soup, but a nigga'll eat some\nChitlins, watermelon, corn bread and some Fruit Loops\nNow who's caroling in my window\nSmokin' up indo\nMechalecha hi, make a high note\n\n[apl.de.ap]\nGet out my fucking yard with your camel\nYou wanna get busy and Santa like a..\nI am a rhymer\nThe Atban Klann will make shit slam, it's Christmas time\nThe Simple Simon Christmas make me jam jam jam\n\n[Will1X]\nYo black, what you want for Christmas?\nYo black, I want some cash\nSo I can buy some indo, chronic and some hash\n\n[Atban Klann (Will1X & apl.de.ap)]\nYo, here comes the Atban Klann rough and rugged\nA rump pa bum bum\nA rump pa bum bum\n\n[All (x10)]\nMerry Muthafuckin' Christmas\nMerry Muthafuckin' Christmas\nMerry Muthafuckin' Christmas\nAnd have a fucked up new year\n\n[Eazy-E]\nYou Biiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiitch!!\n\n[Mother]\nAnd they all went to prison\nAnd lived fucked up lives ever after\nThe End", "year": "1992-12-10"}, {"artist": "Eazy-E", "album": null, "title": "Monsters", "lyrics": "[Chorus]\n[Meg & Dia]\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\n\n[Eazy E]\n1,2,3, and to the 4\nEazy muthafuckin' E\nWith the chrome to your dome\nCruisin' in my '64 rag top\nI got a lot of juice\nA lot of fuckin' block\nNow when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nKeep the gat in my lap\nCuz I'm fully strapped\nFor the car jackers\nFuck no hapsters\nI pack a Tech-9\nPlus a AK-47\nSend a one way ticket to my hell\nOr maybe heaven, peep\nNigga I don't sleep\nBurry muthafuckas in the concrete\nYou try creep kinda slow in a Astro\nBut I peep you niggas out in my left window\nSo I blast and I blast til I blast no mo\nYo, they call a muthafucka John Doe\n\n[Chorus]\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\n\n[2Pac]\nNow ever since a nigga was a seed\nOnly thing promised to me was the penitentiary, still ballin\nRidin on these niggas cause they lame\nIn a six-one Chevy, still heavy in this game, can you feel me?\nBlame it on my momma I'm a thug nigga\nUp befo' the sun rise, quicker than the drug dealers\nTell me if it's on, nigga then we first to bomb\nBust on these bitch-made niggas hit 'em up, WESTSIDE\nAin't nobody love me as a broke nigga\nFinger on the trigger Lord forgive me if I smoke niggas\nI love my females strapped, no fuckin from the back\nI get my currency in stacks, California's where I'm at - right?\nPassed by while these niggas wonder why\nI got shot but didn't die, let 'em see who's next to try\nDid I cry, hell nah, nigga tear I shed\nFor all my homies in the pen, many peers dead\nNiggas still ballin\n\n[Chorus]\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\n\n[Notorious BIG]\nSo you wanna be hardcore\nWith your hat to the back, talkin bout the gats in your raps\nBut I can't feel that hardcore appeal\nThat you're screamin, baby I'm dreamin\nThis ain't Christopher Williams, still some\nMC's got to feel one, caps I got to peel some\nTo let niggas know... that if you fuck with Big-and-Heavy\nI get up in that ass like a wedgie\nSays who? Says me, the lyrical\nNiggas sayin, \"Biggie off the street, it's a miracle\"\nLeft the drugs alone, took the thugs along with me\nJust for niggas actin shifty\nSticks and stones break bones, but the gat'll kill you quicker\nEspecially when I'm drunk off the liquor\nSmokin funk by the boxes, packin Glocks is\nNatural to eat you niggas like chocolates\nThe funk baby\n\n[Chorus]\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\nMonster\nHow should I feel?\nCreatures lie here\nLooking through the window...\n\nDJ Easy", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "My Baby'z Mama", "lyrics": "[Intro]\n[Baby:] \"What ya doing daddy, what ya doing daddy?\"\n[Eazy-E:] \"I'm sitting here writing this song about baby's mothers, who, uh, try to sue the daddys for child support, even though daddy's taking care of the baby. But the mother's just, you know, scandalous and I'd just like to say...\"\n\n[Verse 1]\nFuck my baby's mama, the bitch got drama\nFuck my baby's mama\nCause she's the type of bitch that wanna see me broke\nBroker than a joke, bitch stole my role\nAnd every time I see the bitch, she needs cash\nShe make me wanna slap her ass\nTrifling bitch, always got me in a fix\nThe low life Compton-shopping-swap-meet trick\nI wanna kill the ho\nThen slam her in the trunk of my six four\nCause yo, that ho made my dick grow\nAnd now her lawyer's at every show\nWaiting for me to kick in my dough\nBut before I go, I'm on death row\nCause the bitch had too much drama\nFuck my baby's mama\n\n[Hook x8]\nFuck my baby's mama (that bitch)\n\n[Verse 2]\nFuck my baby's mama, the bitch got drama\nAnd I'm not the one\nI should just knock her punk ass out\nWhile I'm in court paying child support\nBut then I gotta deal with the father and the steel\nAnd he's the type of nigga that a nigga's gotta kill\nMake me kick up a grip, I don't like her\nCause the bitch is buying skirts instead of diapers\nBegging so much to hold hands it startin' to look like cuffs\nI wish I never fucked\nBut that's too late. How much you laid?\nCause according to your income, you might have to spend some\nTime behind bars, now you find it hard\nI never thought a bitch would pull a stunt like this\nI can't do another day with Pamela\nSo I'mma pay ya', Anna\nBut I'd just like to say\n\n[Hook]\n\n[Verse 3]\nI think of all the money I spent on a lawyer, I used to be an employer\nBut now I'm just an employee, filing bankruptcy\nBut now the punk bitch can't touch me\nUh, I only call her to check up on my daughter\nSo now she got a restraining order\nPut me to the curb and had the nerve to ask to borrow a dime\nBitch, you must be out your rabid ass mind\nHuh, love for start will take much you see\nThe bitch broke me so now I need a crutch\nBut you gotta understand a judge don't give a fuck\nAbout a young nigga that's down on his luck\nSo I gotta put the P down and be down for the calls\nAnd give the bitch back her drawers\nSo if your driving by and you see her\nDo me a favor, give the bitch the finger\nFuck her\n\n[Hook]\n\n[Outro]\nYou biiiiiiiitch\n\n(Laughter), that's fucked up\nGo to hell (laughter)\nWe dedicate this number to you (laughter)\nThis one's for you\nThis evening's news report\nSee you 'round, buddy boy", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "Gangsta Memorial", "title": "Neighborhood Sniper", "lyrics": "[Eazy-E]\nPerched up high on a roof top\nLike a bird I'm havin' evil thoughts\nA black hood covers my face\nAnd death flows through my mind at it's own pace\nSometimes I feel like a super hero\nUrgin' to free my kind\nI'm so accurate\nI shoot ya heart with a dime\nNow I'm back to the moral of my tale\nI see a victim and then my thoughts fail\nMy minds still fumblin' with the present slavery\nI'm here to save you but who's to save me\nI hold my strap so long that my palms all wet\nI put my finger on the button then the sight I check\nI make the kill here's the deal\nAfter the trigger's pulled then the death is sealed\nSo it's the shots that sing out like a piper\nEveryones scared I'm the neighborhood sniper\n\n[Hook: Cold 187Um & Kokane]\nThey say that some of them bust them pieces and some of them run up to get that leak-leak\nEverybody else everybody else I'mma shoot to kill ya\nSome of them bust them pieces, some of them run up to get that leak-leak\nEverybody else everybody else I'mma shoot to kill ya\nBoom boom boom boom had to murda ‘em\nBoom boom had to murda em\nYaa boom boom boom boom\nBoom boom had to murda ‘em\nBoom boom had to murda 'em\n\n[Eazy-E]\nSo my boy is a snitch\nI put my gun up to his head\nAnd simply scared the bitch boo\nBeing the E ya know I'm thinkin' devious thoughts\nTake off ya clothes nigga and here comes a plot\nHis bitch was scared she made a move I pulled the trigger\nNow the room is red\nNow there's nothing left but a snitch\nHere's a four leaf clover punk make a wish\nOne [*Shot*] two [*Shot*] three strikes your out\nThis nigga is dead and now I'm lookin' for a window to get out\nI made my escape the cops chase\nDuckin' to an alley so they don't recognize my face\nThe boy had to pay the piper\nSo they all stayin' scared of the neighborhood sniper\n\n[Hook]\n\n[Eazy-E]\nI'm Doin' dirt as I continue my mission\nKillin' all fools as an addiction\nAs the E, lovin' the game leavin' a shame\nAnd in my heart I feel no motherfuckin' pain\nBecause my heart is cold as I was told\nAnd with my A.K. 47 I stand bold\nRippin' up shit with the fury of my gun shot\nPop pop pow, as I watch the motherfucker drop\nLovin' the site as the blood spill\nTake a photograph, To keep in my hall of thrills I’m stayin' calm\nAnd never hyper as I succeed in my mission\nI be a neighborhood sniper\n\n[Hook]", "year": "1992-12-15"}, {"artist": "Eazy-E", "album": "Gangsta Memorial", "title": "Niggaz My Height Don't Fight", "lyrics": "[Intro]\n\n[Eazy w/ normal voice]\n\"Gimmie this, gimmie that, gimmie this, gimmie that\nBitch, step back and stop tryna jack.\"\n\n[Eazy w/ female voice]\n\"But mister dopeman, dopeman, can I get a hit?\"\n\n[Eazy w/ normal voice]\n\"No, ho, but you can get my duck sick.\"\n\n[Verse 1]\nBut let me finish my story as I was sayin'\nI told you lil locs ain't playin'\nGotta roll with the punches\nCan't help the travellin' bunches\nNow, ain't that somethin'\nJust in case a few niggas try to trip\nBone-out, put on my ski-mask and come back blastin'\nCause niggas my height don't fight\nMy name is Eazy-E, you're motherfuckin' right\nThey must to thought I was a busta\nYou're wearin' your bullet-proof vest\nSo what's next?\nI got my nine filled up with teflon\nAnd don't let me hit the wetbomb\nSo what ya wanna do?\nThe red, white and blue\nI got some for you, too\nCause it gonna be on when I'm kickin' down doors\nSo say hello to my new 44\n\n[Hook]\nI'm the type of nigga\nThat smokes motherfuckers\nI'm the type of nigga\nThat smokes motherfuckers\nI don't give a fuck fuck\nSmoke motherfuckers\nI'mma smoke motherfuckers\nCause I'm the \"E\"\n\n[Verse 2]\nSo you can kiss my black ass\nFuck the White House, it ain't my house\nSo you can burn the motherfuckers down for all I care\nCause t-shirts and khakies is all I wear\nI'm from the city where they show no pity for a punk ass mark in the park\nBlow his brains out, stuff him in the bushes\nTake his gat, leave his ass for the rats\nAnd if he hit that Cisco\nI got a 187 on my pistol\nWanted by the L.A.P.D.K\nFor puttin' in work out my tray\nBecause the president never sent\nOne damn dime to my residence\nI'm goin' crazy like 1980\nI need my ends, fuck you, pay me\nOr I'mma have to get the strap\nMy Nutty O.G. buddy Big Black\nI make you shit in your pants and shake like Jell-O\nSo tell all my homies said hello\n\n[Hook]\nI'm the type of nigga\nThat smokes motherfuckers\nI'm the type of nigga\nThat smokes motherfuckers\nI don't give a fuck\nSmoke motherfuckers\nSmoke motherfuckers\nLike it ain't no thang\n\n[Verse 3]\nYou can't check a checker\nBut when you wanna try let me know\nI got the strecher on stand-by\nStarvin' for a nigga like you\nThat thinks his heart is much bigger than a trigger\nSo I can show how to put in work:\nThe Ruthless network drive-by experts\nStraight outta Compton, kickin' up dust\nThe place where guns don't get a chance to rust\nI warned them and they still approached me\nNow I got two more golf-hats for my trophy\nI got a brand new trend, it's killin' men\nWho is that?\nThat's my little friend\n\n[Outro]\nI don't give a fuck\nI don't give a fuck\nI don't give a fuck fuck fuck fuck fuck\nI don't give a fuck\nI don't give a fuck\nSmoke motherfuckers like it ain't no thang", "year": "1992-12-15"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Nobody Move", "lyrics": "[Intro]\nEazy-E: Yo Ren, you're ready to go get this money?\nMC Ren: Believe that, boy\nEazy-E: You're strapped?\nMC Ren: Yeah, you know it\nEazy-E: Let's go do this shit, man, I got it all planned out\nMC Ren: Yeah, shoot any motherfucker that moves\n\n[Sample]\nAlright everybody\n\n[Verse 1: Eazy-E]\nThis is a stick-up, everybody get face-down\nRen, gag their mouths so they can't make a sound\nTie em up for the fact that I'm kickin ass\nI got my hand on my gat, and I'm tempted to blast\nMy name is Eazy, but I go the hard way out\nThis ain't personal, but now I'm about\nTo commit a crime and go through with it\nYou know what, no need for shaking, because I'm used to it\nTake out the security guard with a slap of my hand\nYeah, he's wearing a badge, but he's a ol' ass man\nPop his ass in the head, and take his gun\nSo me and the punk can go one on one\nCover the lens on the TV screen\nYou know so me and my gang, just can't be seen\nLock the doors, and throw away the key\nClose the blinds, so no motherfuckers could see\nAnd smile, you know, cause I'm control of the shit\nAnd no sucker ass nigga's gonna stop the hit\nWardrobes and locs, and a Ruthless shirt\nThat means I'm ready to work, and rush a fool to the dirt, so\n\n[Hook]\nNobody move, nobody get hurt [gunshot]\nNobody move, nobody get hurt [gunshot]\nNobody move, nobody get hurt [gunshot]\nNobody move, nobody get hurt gunshot\n\n[MC Ren]\nAlright, anybody move and I'll blow your fucking head off\n\n[Verse 2: Eazy-E]\nAlright, empty your pockets, but do it slow\nTake everything you got and lay it on the fucking floor\nDon't make me have to set an example today\nAnd blow one of you crazy motherfuckers away\nI'm in a bank, and it's a little bit funny\nTaking all you stupid motherfuckers' money\nPeepin at a bitch cause my dick's on hard\nLaughing at the dumb ass security guard\nWho's tied up for the moment, not saying a word\nI should have known it before, the motherfucker's a nerd\nBut back to the bitches I'm peepin'\nAnd then untie the ho, so I can start creepin'\nTook her to the backroom, about to jack\nCold trailed the bitch, with a gun in the back\nI said: \"Lay down, and unbutton your bra!\"\nThere was the biggest titties that a nigga ever saw\nI said: \"Damn\", then the air got thinner\nOnly thought in my mind, was going up in her\nThe suspense was making me sick\nShe took her panties down and the bitch had a dick!\nI said: \"Damn\", dropped the gat from my hand\n(What I thought was a bitch, was nothing but a man)\nPut the gat to his legs, all the way up his skirt\nBecause this is one faggot that I had to hurt, so\n\n[Hook]\n\n(I said get down. I want you all face-down on the floor\nAnybody moves and I shoot)\n\n[Verse 3: Eazy-E +  MC Ren ]\nStacking up the money and there's more to collect\nCause I don't give a fuck, I take traveller's cheques\nYo, Ren, peep out the window, and tell me what you see\nThree motherfucking police staring at me; what to do now?\nHurry up and get armed\nAlright, tell me, who hit the motherfucking alarm?\nI'mma give ya a chance, and count to three\nOr else five of y'all bitches are comin with me\n(Alright, Alright, come on out niggas, or we're coming in\nThis is the only chance to turn yourself in)\nFuck you, we got hostages, and plenty of loot\nAnd don't give a damn and not afraid to shoot\nWe're sending out the hostages, all except five\nAnd if you don't meet our demands, they won't stay alive\nWe want a copter, so we can get away clean\nAnd take some pussy along, if you know what I mean\nOne hostage got brave, and got off the floor\nBut I smoked his ass before he got to the door\n(They shot a hostage, they shot a hostage)\nYou stupid motherfucker trying to run\nNow you're dead as fuck trying to race a gun\n(Alright, this is the last chance to get off your ass\nOr else the tear gas is about to blast)\nI ran to the back and Ren followed behind\nTo a hell of a spot that was hard to find\nThe bank was fucked up, the shit was smokin'\nWith screamin hostages, running and chokin'\nGettin away, but I was suddenly stopped\nAt point blank range, by a motherfucking cop\nAnd I hope they don't think that a lesson was taught\nCause a nigga like the E was finally caught\nMy gat wouldn't fire, the shit wouldn't work\nSo, y'all know what time it is\n\n[Hook]\n\n[Outro]\n([Police:] Well I'm giving you five seconds to let us through the gate or\nI'm gonna shoot two of your guards)\n\n(Hehe, they got me once, but they'll never get me again)", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "No More ?'s", "lyrics": "[Intro: Eazy-E & Female Interviewer]\nWe're sitting here with Eazy E\nBelieve that\nHow are you doing?\nAlright\nSo, Eazy, tell me, how was your life as a youngster?\n\n[Verse 1]\nRuthless, my style as a juvenile\nRan with a gang, slanged in the meanwhile\nBankin', I specialized in gankin'\nWhites, Mexicans, brothers and others\nDaily, it's all about comin' up\nMakin sure no punks are runnin' up\n(​Because I'm a gangsta havin' fun)​\nStrapped with a gat when I'm walkin through Compton\nTerrible, I never listened to my mother\nIt went in one ear, and out the other\nRan my gang, sold undercover\nCall a girl out a name, yo I ain't no lover\nI'm a pimp, mack daddy, lookin' for the dollar\nAt thirteen I bought a six-fo' Impala\nRollin', and runnin' from the police\nBrother don't you know you can't trust a thief\nOr thug, convict, hoodlum or criminal\nLeave your car open, gank for your stereo\nHard and raw, no regard for the law\n(Eazy E, were you ever caught slipping?)\nHell no! Just trippin' off 8-ball\nAnd girls ain't nothin' but female dogs to me\nBitches! I'm sorry for that verse\nIt's in my nature, I gotta curse\nOut anybody gettin' on my nerves\nYou get beat, ganked, broke and served\nSo... you know who I am\nAnd if you don't like it, I really don't give a damn\n\n[Interlude: Eazy-E & Female Interviewer]\nHmm, I see, so you're rather violent?\nSometimes\nOk, what would be the situation when you so-called \"gank\" someone?\n\n[Verse 2]\nWait... for some people to leave\nI got another trick up my sleeve\nStep with pep to the back of the house\nLooked in... all the lights are out\nGrabbed the door and it's locked, so\nEasily made my way to the window\nLift it up slow, 'cause it takes timing\nLooked around, and then I climbed in\nOnce inside, I start takin'\n'Cause you know it's no time for shakin'\nGet what you gonna get, front and center\nOr get five years for breakin' and enter\nMove quickly, but no runnin'\nShh, I think somebody's comin'\nHear the front door key, and I flee\nOut the back with a fist full of jewelry\nOver the wall... don't fall\nWipe my sweat 'cause that was a close call\nGettin' ganked by the E is a lesson\nSo... is there any more questions?\n\n[Interlude: Eazy-E & Female Interviewer]\nYes, as a matter of fact, there is...\nHave you ever been involved in, like, an armed robbery or a hold-up?\nYou mean a 211?\nYeah\n\n[Verse 3]\nThere's a store, but don't point\nWalk inside, case the joint\nOne man behind the counter, another in the back\nGo out to the car and load the gat\nGrabbed the ski mask, here's the task\nGo in broke, come out with cash\n(Were you slick?)\nYeah, you gotta be cunnin'\nTold Ice Cube to leave the car runnin'\nWalked in, said: \"This is a robbery\"\nDidn't need the money, it's just a hobby\nFill the bag, homeboy, don't lag\nI want money, beer, and a pack of zig-zags\nThe man in the back had a camera\nSo he came out to test his stamina\nAgainst Eazy E, but he took one\nFell to the floor, so I run\nBack to the bucket, then I said: \"Punch it\"\nTook the gun, and then dumped it\nI'm not like Robin Hood, 'cause I want more\nSteal from the rich, hang with the poor\nMy pockets are fat, you see, it don't matter to me\nI feel like nobody is badder than me\n(Is all that true?)\nI don't lie\nYou see... I'm not mister nice guy\n\n[Interlude: Eazy-E & Female Interviewer]\nOh, so you're not exactly a role model?\nNot exactly\nAnd for your listeners, what does Eazy think of himself?\n\n[Outro: Eazy-E & Female Interviewer]\nBad and bold, you can't get with this\nThose that tried, you're on my shit list\nCan't be caught, sought or fought\nThought, and damn so what?\nDown and dirty from the C-P-T\nN.W.A and Eazy-E\nOne more, before we end this session\nWhat's your real name?\nNo more questions!", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "No More Tears", "lyrics": "[Intro]\nEah, you know how it is\nBorn and change, dying in pain\nPraising the devils hands so we compriscate your body like contravene hahah\nOh you don't know, a Grim Reaper is a gangsta\nAnd when the daddy want you, why the fuck you gone run ha?\n(laughs)\n\n[Hook]\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin back, getting blasted\nReminiscin' how she looked in the casket\n\n[Verse 1: Eazy-E]\nDamn, another bitch dead\nIt's a shame that she is gone took two the head\nGot caught in the mix\nIt's sad, I'm gonna miss this bitch\nShe was all this\nShe was all that\nPoint black, baby was all fat\nNow we lay her down to sleep\nMade my nigga rest in peace\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nPaid my respect and didn't shed a tear\nEazy muthafucking E CPT and I am outta here\n\n[Verse 2: Phalos Mode ]\nIt's like pay me stories in a cold cruel world\nI'ma share story 'bout a gangster girl\nFrom the plane to the train\nFall of from a groupie, a down bitch\nPut a key up in her coochie\nAnd she only fucking with ballers, living the live\nSo fine but never thought she be smoking the pipe\nAnd when her boyfriend is away, she doing her damn thing\nComing up show nigga misses some cocaine\nBut It ain't a shame anyway\nSo you know, we yo, getting guns\nPut on a nigga cuz of a ho\nYeah the bitch gots to go\nStep to the house, looked to the shower\nThe Bitch looking like a Tina Howard\nMake sure the ghost was clear\nCock the gat, shit is certain\nWent to the door put 5 in her cunt and\nThat's the way love goes when you fucking with scandalous hoes\nSemi-automatic my folks peep the scenario\n\n[bridge]\nHer name was Tina, Ooh you should've seen her\nFace like a dog\nBody like a ballerina (like a ballerina)\nCaught a case everyday in the past of pasedane\nFelony possession but it changed to a misdemeanor (changed to a misdemeanor)\nShe was selling that ass to make beer\nBody fly jewels And fancy wear\nHanging with pimps, Killers and dopefiends (dopefiends)\nGot hooked on Crack, and won't ever get clean (get clean)\nEvery night she with a different trick (a different trick)\nIn dark back alleys garglin' on dick\nOh shit (oh shit) what a wasted bitch\nCallin' coroner quick\nA dead body in a ditch (body in a ditch)\nIs it her? Ooh I hope not hope not (I hope not)\nI just seen her last week at the dope spot (at the dope spot)\nBut they made a positive ID\nTina was dead, and what a tragedy (what a tragedy)\nMomma yellin' out somebody pray for me\nBut she abandoned her at the age of 3\nBut just that's the way life goes in these scandalous streets\nSo I'll write hardcore lyrics with these gangsta beats\n\n[talking]\nSo choose now, life or death\nLongs with breath\nOr no air in your fucking chest\nEither way, whether you decide to evade\nOr decide to stay\nThat muthafucka death\nAlways, I said always collect jacks made of flesh\nYeah, yeah?\n\n[Hook]\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\nNow we kickin' back, getting blasted\nReminiscin' how she looked in the casket\n\n\nFuck me up man\nKeep it real\nI remember..  yeah I remember exactly how she looked\nWhen i want in her I will..\nI just finish smoking\nThen i she didn't look the same tha bitch was trip\nI don't mean to call her bitch but she didn't look the same\nBut she looked like (she did now)\nBut she looked she had just smoked the joint (done deal)\nI mean..I know death I know death ain't didn't play with it\nThe bitch didn't looked dead (we all gotta go)\nShe looked high\nThere's difference between being dead and being high....\nDead don't feel like being high", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Nutz On Ya Chin", "lyrics": "[Verse 1: Eazy-E]\nOne and then comes the two to the motherfuckin' three\nThen comes the Eazy to the other fuckin' E\nPlayin' niggas life like a puppet\nAnd can't dance\nBut could touch it, so fuck it\nRappers want to diss I'm glad to see `em\nCause I rip your fuckin' face outta a magazine\nO.G. gangsta lean\nNow after I shit your face wipes that ass clean\nTime to get tipsy\nAnd don't want a bitch if she can't rub the balls like a gypsy\nWho's all in?\nSince you put yourself on my dick I put my nuts on your chin\n\n[Hook: Eazy-E]\nNuts on your chin\nSince you put yourself on my dick I put my nuts on your chin\nNuts on your chin\nSince you put yourself on my dick I put my nuts on your chin\n\n[Verse 2: Eazy-E]\nMotherfuck what ya heard I'm more than that\nA real nigga from the hood and I'm all of that\nThick as a hicky\nA picky nigga fittin' dickies with bitches strictly dickly\nMany sets I rolled on\nAnd killed squeals that told on, my homies they sold on\nDon't ask Eazy shit\nIt's still a hit is a hit, and a bitch is a bitch\nHangin' on my nuts like a hair strand\nHangin' there with n'ear heart, and n'ear plan\nAss out like an asshole\nRunnin' to my dick with a rhyme and a lasso\nAgain and again\nFrom beginning to end it's my nuts on your\nChin\n\n[Hook]\n\n[Verse 3: Eazy-E]\nYou couldn't beat a minute of my ass, if I gave you sixty seconds\nTick tock, shit starts, I start a steppin'\nE to the motherfuckin' A to the motherfuckin' Z, here's the Y, here's the E\nHere to stay\nAfter you when I'm through\nCheck me and Rodney King Fuck Tha Police part 2\nNow back to my friends\nNuts to ya nose to ya lips to ya chin\nReal niggas love us, hussies never fuck us\nThe roughest ruckas fingers couldn't touch us\nEazy E's back again\nFuck waitin' For a pay day get an A.K\nEveryday is a blast, yeah, blast a nigga fast knock his ass get all the cash\nWho's all in?\nSince you put yourself on my dick I put my nuts on your chin\n\n[Hook x2]\n\n[Outro: Eazy-E talking]\n\"N.W.A. - Niggas With Attitude. We're underground reporters we tell about, you know, the streets and everything that goes on, you know, around in Compton, in our area, what's going around around us, we don't know what the fuck's going around by you. But frankly we don't give a fuck, you know. Most kids in Compton don't give a fuck who the mayor or the president is. You know they're not even interested in votin'. And the police, you know what I'm sayin'? I say fuck em.\"", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "Gangsta Memorial", "title": "Ole School Shit", "lyrics": "[Intro: Eazy-E]\nHey Yella\nKick that shit\n19-9-muthaphukkin-E\nThe muthaphukkin year of the real muthaphuckkin G's\nAnd we gonna do this shit like this:\n\n[Verse 1: Dresta]\nNigga evidently, ya just don't know who ya fucking with\nSo I suggest get in ya shit and keep truckin', bitch\nBefore I get my gat ya pressure case\nBlast, blast I leave my gang bang layin' on ya face\nI tattoo Dre name on my chest\nCross it out just another nigga that I X-ed, huh\nAnd you won't see R.I.P., you'll see P.N.D\nA Punk nigga deceased, yeah\nAnd the bitch that was yours will be mine, buddy\nAll because ya woofed on a nigga that was nutty\nAnd I had to make an example\nNigga thinks I'm crazy now but that was just a sample\nOf a nigga with street wise reality\nThat don't give a fuck type Compton mentality\nI stare back death right in the face\nContemplate my last day on and everyday base\nCause a nigga never know when he go\nI hope it only takes one shot\nCause I don't wanna die slow\nMy funeral will be full of my peers\nPeople that never gave a fuck about me droppin' phony tears\nI hope I'm in the casket face down\nSo all you motherfuckers can kiss my black ass now\nAnd fuck all that cryin' all night\nJust be happy that I'm rid of this fucked up life, yeah\nAnd now you see you can't handle me\nI give a shout to Tonel and the Ruthless fuckin' family\n\n[Interlude: Eazy-E]\nYeah, out with the old, in with the motherfuckin' new\nBut check this shit out\nI got somebody for ya, bitch\nMotherfucker\n\n[Verse 2: Sylk]\nNow it's about time for the Sylk to speak\nCheck dat ass last weak\nYou off the chronic and you tweak\nSpeak when I feel\nCause I'm as real as they come\nI'm a bitch with a gun\nNever run ain't for none\nSo step, step up\nIf ya wanna test ya luck, trick\nSister like Sylk\nReally don't give a fuck, bitch\nPunk bitches wanna step phony speak howdy doody\nI make ya self break ya self bitch you never knew me\nYours truly no longer layin' in the cut\nSteady fuckin' shit up\nNever see me shakin' my butt, I strut\nLike a gangsta bitch, no, not a pranksta bitch\nI'm quick to gank a bitch, trick\nPeep game at this bitch as I shoot this\nGangsta bitch steppin' rollin' with the Ruthless\n\n[Verse 3: B.G. Knocc Out]\nThe R-U-T-H-L-E double S, yo, it's the nigga Knocc Out\nClaim the Blocc so nigga whats next\nTry to step and flex and get wrecked like a mack truck\nI'm kickin', tah spittin' this funky shit to make a quick fat buck\nI'm doggin' a dog you suckers can't talk about tip flip I rip shit\nI'm stressin'\n\"Damn cuz\", \"Pick it back up\"\nChillin' up in the studio\nWith the Ruthless Family\nFuck the Death Row posse\nYo, them fools can not handle me\nSnoop and Andre ya come and try to fade the\nLoc'ed out, Compton, original baby gangsta\n1-8-7's how we do it on the west\nYa say ya shit is chronic but to me it's more like stress\nOr should I say make my shit the stronic\nTha Dogg Pound don't wanna step to the atomic dog\nD-O-T-K-N-O-Double-C-O-U-T so motherfucker come and fuck with me\n\n[Transition]\nCome on, come on\n\nThis is just a little something to keep ya ass in check\nRuthless motherfuckin' family ya still in effect [x3]\n\nThis is just a little something to keep ya ass in check\nRuthless motherfuckin' family ... kick that shit\n\n[Eazy-E]\nJealousy is a motherfucker when your the man\nWith the upper hand I don't give a shit\nClock a grip like no other can\nWanna be like me be a G like me\nBut I'm the nigga that made a G\nOutta the bitch D-R Eazy\nI was the captain\nDre was my sidekick\nEverything was cool\nTil he wanted to get what I get\nAny other real G, Eazy-Muthaphukkin-E\nNow claimin' you a G\nHow does it feel to be me", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "Gangsta Memorial", "title": "Only If You Want It", "lyrics": "[Hook: Treach]\nOnly if you want it\nYes I really want it\nOnly if you want it\nYes I really want it\nOnly if you want it\nYes I really want it\nOnly if you want it\nYes I really want it\n\n[Verse 1: Eazy-E]\nCan I get an eye open up\nEazy locin' up, Smokin' up\nMuch dust like a nut what\nGive it up for the real stuff\nShut the what up\nBack that shit up, what?\nHustler from the hood ho\nHopping in my trunk\nThe finishing touches\nWould show what rough is\nComing in bunches\nCould serve like lunches\nHold ya horses here's where the source is\nNot very tall but never took a short kid\nWith a clip to claw\nWouldn't draw Mcgraw\nI trick a law before all and all I'm raw\nA naughty shorty, sporty with a forty\nA lordy taking tours, just to plan a orgy\nA nasty critter, any ho hitter\nHated my babysitter cause she wouldn't let me hit her\nNow get up on it, on and on get on it\nAnd I will pump it, only if you want it\n\n[Hook]\n\n[Verse 2: Eazy-E]\nHere's something from the ding dong cause\nI really care how long ya been strong grown\nHere comes permastoned cone\nCouldn't hang with the king of the records\nBut I call for a yes y'all toots\nMy style is just as fresh as a dusch bush\nI push a record through a heifer like a woody wooder\nAnd if I left then that means that I should've booger\nHere's a new track, for all the new jacks\nI'm kicking it the hardest so gimme my shoes back\nSo I limp when I step it's the pimp\nAnd I rep so make a right and get left quick\nSo try to play strong and long gone\nThe flow is kinda funky but far from Armstrong\nGet up on it, on and on get on it\nAnd I will pump it, only if you want it\n\n[Hook]\n\n[Verse 3: Eazy-E, Treach]\n[Treach:] Ooooooh a new jack! a new jack!\n[Eazy-E:] Kid I swear I saw a puddy cat\nBack back smack, here comes a witty black\nEnemies go hide I'm bout to show why\nEazy's peeling caps cause my gats in the low ride\nBang when the gat speaks, two in the back seat\nMy homie rides shotgun waiting to spot one\nDuz is a fool who don't run, duck, dive and slide to a ride\nI'm shudder shaking the place when I start hey\nSo don't butter me, Eazy-E but a park hey\nThe only thing the flow needs now to be fly is a feather\nI see the smiling faces in wilding places\nYa know me better, hard rotty kid\nKilled Cali kid, now ya know it boy\nLeft up in the alley dead\nNow get up on it, on and on get on it\nAnd I will pump it, only if you want it\n\n[Hook]", "year": "1992-12-01"}, {"artist": "Eazy-E", "album": null, "title": "Payback", "lyrics": "[Verse 1: 2Pac]\nThey'll never take me alive, I'm gettin' high with my four-five\nCocked on these suckas, time to die\nEven as a youngster causin' ruckus on the back of the bus\nI was a fool all through high school kickin' up dust\nBut now I'm labelled as a troublemaker who can you blame?\nSmokin' weed helped me take away the pain\nSo I'm hopeless rollin' down the freeway swervin', don't worry\nI'm about to crash up on the curb cause my vision's blurry\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do\nBut be a thug - out slangin' with the homies\nFuck hangin' with them phonies in the club\nGot my mind on danger\nNever been a stranger to homicide\nMy city's full of gang bangers and drive bys\nWhy do we die at an early age\nHe was so young\nBut still a victim of the 12 gauge\nMy memories of a corpse\nMind full of sick thoughts\nAnd I ain't goin back to court\nSo fuck what you thought, I'm drinkin' Hennessey\nRunnin' from my enemies will I live to be 23\nThere's so much pain\n\n[Hook]\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\n\n[Verse 2: Eazy-E]\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born\nGonna pay back niggas who did me wrong in the past\nMy days ain't long\nI'm comin' strong and fast\nLock up 8 niggs..kill up 10 pigs\nInnocent and fuckers are also dyin, too\nNow what else can I do?\nFuck, fuck, fuck and plant my seeds\nLeavin' kids in this world like me\nThe lunatic psycho mutherfucka Eazy-E\n\n[Chorus]\n24 hours to live\nBut I don't wanna die\n24 hours to live\nOh why, oh why?\nMust die\n\n[Hook]\nSky diving, scuba diving\nTo Evel Knievel stunt car drivin'\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\n\n[Verse 3: 2Pac]\nThey got me mobbin' like I'm\nLoc'ed and ready to get my slug on\nAnd I load my clip and slip my motherfuckin' gloves on\nI ain't scared to blast on these suckas if they test me\nTrust, I got my Glock cocked playa if they press me\nBust on motherfuckers with a - paaassion\nBetter duck cause I ain't lookin when I'm - b-b-blaaastin\nI'm a nut an' drinkin Hennessey and gettin' high\nOn the lookout for my enemies, don't wanna die\nTell me why cause this stress is gettin' major\nA buck-fifty across the face with my razor\nWhat can I do but be a thug until I'm dead and gone\nKeep my brain on the game and stay head strong\n\n[Verse 4: Eazy-E]\nI'm starting to sweat\nCause I don't really wanna die yet\nDizzy spells, flashbacks in my head\nNiggas ain't want me to bein' happy when I'm dead\nBut I ain't goin' out unless 30 niggas die\nI'm dying anyway so I'm thinking suicide\n\n[Hook]\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nGonna pay back niggas who did me wrong in the past\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up", "year": null}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Radio", "lyrics": "[Intro]\nGreg Mack: This is radio station K-EAZY-E\nHi, this is Greg Mack, Mack Attack, and we're gonna go to the phones right now and find out what's goin' on. Hello, who is this ?\nMC Ren: Yo, what's up? This is Lorenzo Patterson\nGreg Mack: Yo man, where you calling from ?\nMC Ren: I'm calling from Compton and I wanna hear Eazy E's new record\nGreg Mack: What's it called man?\nMC Ren: Yo, it's called \"Radio\"\nGreg Mack: We got it, you called the right station. And here it is\n\n[Verse 1]\nEazy E rockin' non stop on the radio\nWith the funky fresh hip hop in stereo\nRelease some rhymes that you will find demandin'\nWith Dre's beats that are so outstandin'\nI'm gettin' busy if you know what I mean\nAlways settin' me a mark in the hip hop scene\nOn the radio the greatest of all times\nLike Muhammad Ali cause I punch rhymes\nSo tune your station, and clear all the static\nAnd tell the truth: you didn't know that I had it\nIn me, to be easy about the situation\nSo just kick it and listen to the station\nPlayin' my music, it's hard to lose it\nIt's constantly on request cause you choose it\nI'm Eazy E, my rap is strong\nAnd your radio's def when my record's on\n\n[Hook]\n[You wanna know why...because...]\nI'm on the...\n[Radio (echo)]\n\n[Interlude]\nDr.Dre: Yeah, ruthless radio is in effect, Dr. Dre and Yella boy is in ya system, and right about now we got Eazy E and MC Ren in the studio taking calls. So give'em a call and ask'em how they're doin'\n*Ring*\nEazy-E: Hello, this is Eazy E. What's your name ?\nJoyce: Hi, this is Joyce, I'd like to know if I can have your phone number?\nEazy-E: Yes, it's 9-7-6...\n*Click*\n\n[Verse 2]\nNow I wanna turn up my box, and make much noise\nAnd rock the party and shock all the B-boys\nTake on my radio from phono to tuner\nI wouldn't have did it, later but sooner\nNow I move my antenna to the center\nThen grab a hold of the handle and enter\nThen bust a rhyme, you know I won't quit it\nAm I lyin', Ren ? (Man, you know you're with it)\nYour request is clear, that you're givin'\nWithout Eazy E you wouldn't be livin'\nWith me on a top 10, or a mix show\nSo hit your power button, and let's go\nOn vacation, with your station\nThat's playin' live in every location\nBlowin' out ya speaker\nIt won't get weaker\nI'll keep rockin' till I hit the peek\nAnd your station is dope E-A-Z-Y\nIt's on the air, but you axe why\nI took out the cursin', and took rehearsin'\nI feel dry, you know that I'm thirstin'\nTo get busy; I don't quit it\nAnd once you hear my cut, I know you're gonna get it\nThen bust a rhyme, while you're clappin' your hands\nIt's Eazy E on the air (rockin' without a band)\n\n[Hook]\n\n[DJ]: You're on the radio, on K-EAZY-E, with Greg Mac. Don't forget to\nJoin us this friday night live, we'll be jammin' it uptown with my\nHomeboys Eazy E, of course, N.W.A. and the whole Compton posse\nCan't make it out but, hey, stay eazy, and stay it on K-EAZY-E...\nWith more...radio\n\n[Verse 3]\nNow disc jockeys are playin' me in rotation\nHittin' number one spots across the nation\nI'm on the charts, you can go list'em\nBut now listen, I'm on your system\nAM or FM, I'm in power\nYou hear my music once every hour\nSo listen up to the rhyme and percussion\nBut do this with no discussion\nEazy's easin' fans I'm pleasin'\nWhy, I'm on top yo, I got reason\nWith no profanity, but what can I say\nYo Dre (What up ?) Do it your way\nOn the radio you get more looser\nTake my word you're a dope producer\nWe combine to put out hits\nBut jealous people, they just have fits\nCause we get airplay, but we're not thru\nDre, am I serious ? (Cold word) Well thank you !\nPeople that hear me, they know what I'm sayin'\nOn the air, I don't be playin'\nJust gettin' my point across to the public\nRhymin' on the radio, that's my subject\nI can play (rock), but I prefer (hip hop)\nIt's Eazy E on your radio non stop !\n\n[Hook]\n\n[MC Ren]: Yo, this is MC Ren, can you comprehend ? We're for bite just like TNT. Yo, what's the time?\n[Girl 2]: Hi, my name is Tushie and I'd like to know when your 12\" record is coming out\n[MC Ren]: Yo, it ought to be out real soon, so just keep looking in your local record store!\n[Stan the Guitar Man:] Yo, can I speak to Dre?\n[Dr. Dre]: Yo what's up? This is Dre\n[Stan the Guitar Man:] Hey Dre, this is Stan. Remember me?\n[Dr. Dre]: Yeah man, I remember you! What's up, homeboy?\n[Stan the Guitar Man]: Yeah man, I play guitar on this record! I wanna know when I get Paid, motha...?\n{Plop}\n[Dr. Dre]: You got ganked...\nHello, you're on the air. What's up?\n[Girls]: Hello, we'd like to speak to that cutie pie DJ Speed\n[DJ Speed]: Yo, this is DJ Speed. What's up?\n[Girls]: The joke's on you, Jack! Hahaha!\n[Dr. Dre]: Hello, you're on the air\n[Guy 3]: Hey, what's up ? This is Nasty Naz callin' from Seattle\n[Dr. Dre]: Hey, what's happenin', homeboy?\n[Guy 3]: I'm callin' to be on Eazy E's new record, \"Radio\"\n[Dr.Dre]: Man, you're late. The record is already o...", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Real Compton City G's", "lyrics": "[Intro]\nCompton, Compton, Compton\nAhh, real Compton city G's\nAhh, real Compton city G's\nAhh, real Compton city G's\nAhh, real Compton city G's\n\n[Verse 1: Eazy-E]\nHey yo, Doctor, here's another proper track\nAnd it's phat, watch the sniper, time to pay the piper\nAnd let that real stuff provoke\nSee, you's a wannabe 'loc, and you'll get smoked, and I hope\nThat the fans understand when you talk about sprayin' me\nThe same records that you makin' is payin' me\nM--f-- Dre! M--f-- Snoop! M--f-- Death Row!\nYo, and here comes my left blow\n'Cause I'm the E-A-Z-Y-E and this is the season\nTo let the real Compton city G's in\nYou're like a kid, you found a pup, and now you're dapper\nBut tell me, where the hell you found that anorexic rapper?\nTalkin' about who you gon' squabble with and who you shoot\nYou're only sixty pounds when you're wet and wearin' boots\n(Damn, E, they tried to fade you on Dre Day)\nBut Dre Day only meant Eazy's payday\nAll of a sudden Dr. Dre is the G Thang\nBut on his old album cover he was a she-thang\nSo, sucka please, suck please\nDon't step to these real Compton city G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\n\n[Verse 2: Dresta]\nEvery day it's a new rapper claimin' to be dapper than the Dresta\nSofter than a girl but portray the role of gangsta\nAin't broke a law in your life\nYet every time you rap you yap about the guns and knife\nJust take a good look at the brother and you'll capture\nThe fact that the bastard is simply just an actor\nWho mastered the bang and the slang and the mental\nOf homies in Compton, Watts, and South Central\nNever ever once have you ran with the turf\nBut yet in every verse claim you used to do the dirt\nBut tell me, who's a witness to your damn work?\nSo you never had no bid'ness, so save the drama, jerk!\nBrothers straight kill me, knowin' that they pranksters\nThis is goin' out to you studio gangstas\nSee, I did dirt, put in work, and many brotherss can vouch that\nAnd since I got stripes, I got the right to rap about that\nBut brother like you, I gotta hate ya\n'Cause I'm just tired of suburbia brothers\nTalkin' about they come from projects\nKnowin' you ain't seen no parts of the streets, G\nI think you started tryna bang around the time of the peace treaty\nWearin' khakis and mob while you rhyme\nLittle --- tried to sag, but you're floodin' at the same time\nAnd your set don't accept ya; scared to kick it with your homies\n'Cause you know they don't respect ya\nSo, brother please, brother please\nDon't step to these real Compton city G's\n\n[Verse 3: B.G. Knocc Out]\nWell, it's the Knocc Out, definition \"Original baby gangsta\"\nApproach me like you hard, little busta, I'ma bank ya\nShank ya, with my damn shank, if I have to\nDr. Dre and Snoop Doggy Dogg are really actors\nPranksters, studio gangstas, busters\nBut this time you're dealin' with some real ass brothers\nG's, fools please, don't try to step\nSee if you do, then a pealed cap is all that would be left\nSee, young brotherss like me will break you off somethin'\nClaimin' my city — but Dre, you ain't from Compton\nSuckers like y'all is what I call wannabes\nAnd ain't shit compared to real Compton city' G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\n\n[Verse 4: Eazy-E]\nI never met a O.G. who never did nothing wrong\nYou tried to diss the Eazy-E, so now, sucka, it's on\nYou and your Doggy Dogg think that y'all hoggin' it\nBoth of you bitches can come and suck my doggy's --\nBeatin' up a bitch don't make you it, but then again\nSome niggas think it makes a man\nDamn, it's a trip how Dre could switch so quick\nFrom wearin' lipstick to smokin' on -- at picnics\nAnd now you think you're bigger\nBut to me you ain't nothin' but a track-ass busta\nThat ain't worth a food stamp\nAnd at Death Row, I hear you gettin' treated like boot camp\nGotta follow your sergeant's directions\nOr get your ass popped with the Smith & Wesson\nLearn a lesson from the Eaze\nStay in your place and don't step to real Compton city G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now: Eazy Duz It", "year": "1993-08-26"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Real Muthaphuckkin G's", "lyrics": "[Intro]\nCompton, Compton, Compton\nAhh, real muthaphuckkin G's\nAhh, real muthaphuckkin G's\nAhh, real muthaphuckkin G's\nAhh, real muthaphuckkin G's\n\n[Verse 1: Eazy-E]\nHey yo, Doctor, here's another proper track\nAnd it's phat, watch the sniper, time to pay the piper\nAnd let that real shit provoke\nSee, you's a wannabe 'loc, and you'll get smoked, and I hope\nThat your fans understand when you talk about sprayin' me\nThe same records that you makin' is payin' me\nMotherfuck Dre! Motherfuck Snoop! Motherfuck Death Row!\nYo, and here comes my left blow\n'Cause I'm the E-A-Z-Y-E and this is the season\nTo let the real motherfuckin' G's in\nYou're like a kid, you found a pup, and now you're dapper\nBut tell me, where the fuck you found an anorexic rapper?\nTalkin' 'bout who you gon' squabble with and who you shoot\nYou're only sixty pounds when you're wet and wearin' boots\n(Damn, E, they tried to fade you on Dre Day)\nBut Dre Day only meant Eazy's payday\nAll of a sudden Dr. Dre is the G Thang\nBut on his old album cover he was a she-thang\nSo, nigga please, nigga please\nDon't step to these muthaphuckkin' real G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\n\n[Verse 2: Dresta]\nEvery day it's a new rapper claimin' to be dapper than the Dresta\nSofter than a bitch but portray the role of gangsta\nAin't broke a law in your life\nYet every time you rap you yap about the guns and knife\nJust take a good look at the nigga and you'll capture\nThe fact that the bastard is simply just an actor\nWho mastered the bang and the slang and the mental\nOf niggas in Compton, Watts, and South Central\nNever ever once have you ran with the turf\nBut yet in every verse claim you used to do the dirt\nBut tell me, who's a witness to your fuckin' work?\nSo you never had no bid'ness, so save the drama, jerk!\nNiggas straight kill me, knowin' that they pranksters\nThis is goin' out to you studio gangstas\nSee, I did dirt, put in work, and many niggas can vouch that\nSo since I got stripes, I got the right to rap about that\nBut niggas like you, I gotta hate ya\n'Cause I'm just tired of suburbia niggas\nTalkin' about they come from projects\nKnowin' you ain't seen the parts of the streets, G\nThink you started tryna bang around the time of the peace treaty\nWearin' khakis and mob while you rhyme\nLittle fag tried to sag, but you're floodin' at the same time\nAnd your set don't accept ya; scared to kick it with your homies\n'Cause you know they don't respect ya\nSo, nigga please, check nuts\nBefore you step to these muthaphuckkin' real G's\n\n[Verse 3: B.G. Knocc Out]\nWell, it's the Knocc Out, definition \"Original baby gangsta\"\nApproach me like you hard, motherfucker, I'ma bank ya\nShank ya, with my fuckin' shank, if I have to\nDr. Dre and Snoop Doggy Dogg are fuckin' actors\nPranksters, studio gangstas, busters\nBut this time you're dealin' with some real motherfuckers\nG's, nigga please, don't try to step\n'Cause if you do, then a pealed cap is all that would be left\nSee, young niggas like me will break you off somethin'\nClaimin' my city — but Dre, you ain't from Compton\nNiggas like y'all is what I call wannabes\nAnd ain't shit compared to real muthaphuckkin' G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\n\n[Verse 4: Eazy-E]\nI never met a O.G. who never did shit wrong\nYou tried to diss the Eazy-E, so now, nigga, it's on\nYou and your Doggy Dogg think that y'all hoggin' shit\nBoth of you bitches can come and suck my Doggy dick\nBeatin' up a bitch don't make you shit, but then again\nSome niggas think it makes a man\nDamn, it's a trip how a nigga could switch so quick\nFrom wearin' lipstick to smokin' on chronic at picnics\nAnd now you think you're bigger\nBut to me you ain't nothin' but a bitch-ass nigga\nThat ain't worth a food stamp\nAnd at Death Row, I hear you gettin' treated like boot camp\nGotta follow your sergeant's directions\nOr get your ass pumped with the Smith & Wesson\nLearn a lesson from the Eaze\nStay in your place and don't step to real muthaphuckkin' G's\n\n[Hook]\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now\nStop him in his tracks, show him that I am Ruthless\nYo, Dre! (What's up?)\nBoy, you should've known by now: Eazy Duz It", "year": "1993-08-26"}, {"artist": "Eazy-E", "album": null, "title": "Real Muthaphuckkin' G's (Edited) (2002 Remastered)", "lyrics": "[Intro]\nCompton\nCompton\nCompton\nCompton\nCompton\nAhh...Real Compton City G's...\nAhh...Real Compton City G's...\nAhh...Real Compton City G's...\nAhh Real Muthaphuckkin G's\n\n[Verse One: Eazy-E]\nHey Yo doctor, here's another proper track\nAnd it's phat, watch the sniper, time to pay the piper\nAnd let that real stuff provoke, so you's a wanna be 'loc\nAnd you'll get smoked and I hope that the fans understand\nWhen ya talk about playin' me\nThe same records that you making' is paying me\n********* Dre\n********* Snoop\n********* Death Row\nYo and here comes me left blow\nCause I'm the E-A-Z-Y-E, and this is the season\nTo let the Real Compton City G's in\nYour like a kid, you found it bumping down the dapper\nBut tell me where the hell you found that  anorexic rapper\nTalking about who you gone squabble with and who you shoot\nYou're only 60 pounds when your wet and wearing boots\n(Damn E, they tried to fade you on Dre Day)\nBut Dre Day only met Eazy's pay day\nAll of a sudden Dr Dre is a G thang\nBut on his old album cover he was a she thing\nSo sucker please, sucker please don't step to these Real Compton City G's\n\n[Chorus]\nStomp him in his track\nShow him that i'm ruthless\n\n[Verse 2: Gangsta Dresta]\nEveryday it a new rapper, claiming to be dapper then the Dresta\nSofter than a girl but portray the role of gangsta\nAin't broke a law in your life\nYet every time you rap about the guns and knifes\nJust take a good look at the brother and you'll capture the fact, that the bastard is\nSimply just an actor\nWho mastered the bang and the slang and the Mental\nOf homies in Compton, Wattz, and South Central\nNever ever once have you ran with the turf\nBut yet in every verse you claim to do the dirt\nBut tell me who's a witness to your fucking work\nSee you never had no buiness, so save the drama jerk\nBrothers straight kill me knowing that they pranksters\nThis is going out to you studio gangsters\nSee I did dirt, put in work, and many brothers can vouch that\nSo since I got stripes, I got the right to rap about that\nBut brothers like you,I gotta hate you\nI'm jus tired of suburbian brothers talking about they come from projects\nKnowign you ain't seen no parts of the streets G\nI think you start trying to bang around the time of the peace treaty\nWearin khackis and mob while you ryhme, little ***\nTried to sag, but you fronting at the same time\nAnd your set don't accecpt you\nScared to kick it witcha homies cause ya know they don't respect you\nSo brother pleae, brother please, don't step to these Real Compton City G's\n\n[Verse Three: BG Knocc Out]\nWell, its the Knock Out, definition orginal baby gangster\nApproach me like you hard, little buster\nI'm bank ya\nShank ya, with my damn shank, if i have ta\nDr Dre an Snoop Doggy Dogg are really actors\nPranksters, studio gangsters, busters\nBut this time your dealing with some real last brothers\nG's, fool please, don't try to step\nSee if you do, then a peeled cap is all that would be left\nSee, young brothers like me will break ya off somthing\nClaimin my city, but Dre you ain't from Compton\nNiggas like Dogg is what I call wanna be's and ain't nothing compared to Real Compton City G's\n[Chorus]\nStomp him in his track and\nShow him that i'm ruthless\n\n[Verse 4: Eazy-E]\nI never met an OG who never did nothing wrong\nYou tried to dis the Eazy-E so now sucker it's on you\nAnd your Doggy Dogg, think that yall hogging it\nBoth of you tricks can come and suck my doggy ****\nBeating up a woman don't make you it\nBut then again some brothers think it makes a man\nDamn it's a trip how Dre can switch so quick\nFrom wearing lipstick to smoking on ******* at picnics\nAnd now you think your bigger\nBut to me you ain't nothing but trick ass buster\nThat ain't worth a food stamp\nAnd at Death Row, I hear your gettin gtreated like boot camp\nGotta follow your sergeant's directions\nOr get yo ass popped with a Smith and Wesson\nLearn a lesson from the E\nStay in your place and don't step to Real Compton City G's\n\n[Outro Chorus]\nYo Dre, What's up? *bang*\nBoy ya should have known by now..\nYo Dre (what's up?) *Bang*\nBoy ya should have known by now...\nYo Dre (what's up?) *bang*\nBoy you should have known by now\nEazy-Duz-It", "year": null}, {"artist": "Eazy-E", "album": null, "title": "Real Muthaphuckkin G's/Hit 'Em Up (Remix)", "lyrics": "(Verse 1): Eazy-E\nHey yo, Doctor, here's another proper track\nAnd it's phat, watch the sniper, time to pay the piper\nAnd let that real stuff provoke\nSee, you's a wannabe 'loc, and you'll get smoked, and I hope\nThat your fans understand when you talk about sprayin' me\nThe same records that you makin' is payin' me\nDre!  Snoop!  Death Row!\nYo, and here comes my left blow\n'Cause I'm the E-A-Z-Y-E and this is the season\nTo let the real compton city G's in\nYou're like a kid, you found a pup, and now you're dapper\nBut tell me, where the hell you found an anorexic rapper?\nTalkin' 'bout who you gon' squabble with and who you shoot\nYou're only sixty pounds when you're wet and wearin' boots\n(Damn, E, they tried to fade you on Dre Day)\nBut Dre Day only meant Eazy's payday\nAll of a sudden Dr. Dre is the G Thang\nBut on his old album cover he was a she-thang\nSo, sucka please, sucka please\nDon't step to these real compton city G's\n\n(Verse 2): 2Pac\nFirst off, touch your chick and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I bust your wife\nWe bust on Bad Boys, brothers touch for life\nPlus Puffy trying to see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. some mark-ass tricks\nWe keep on coming while we running for your jewels\nSteady gunning, keep on busting at them fools\nYou know the rules\nLil' Caesar go ask your homie how I'll leave you\nCut your trick ass up, leave you in pieces, now be deceased\nLittle Kim, don't compensate for real G's\nQuick to snatch your ugly hair off the streets\nYou Little weave! I'll let them suckas know it's on for life\nDon't let the Westside ride the night haha\nBad Boy murdered on wax and killed\nMess with me and get your caps peeled\nYou know\n\n[Hook: 2Pac]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, oh\nWho shot me, but your punks didn't finish\nNow you about to feel the wrath of a menace\nBusta, I hit 'em up\n\n\n(Verse 3): 2Pac\nPeep how we do it, keep it real, it's penintentiary steel\nThis ain't no freestyle battle, all you suckers gettin' killed with your\nMouths open\nTryin' to come up off of me you and the clouds hopin', smokin' dope\nIt's like a Shermine brothers think they learned to fly\nBut they burn little suckers you deserve to die\nTalkin' about you gettin' money but it's funny to me\nAll you suckers livin' bummy while you messin' with me\nI'm a self made millionaire\nThug livin', out of prison, pistols in the air\nBiggie remember when I use to let you sleep on the couch\nAnd beg the trick that I let you sleep in the house\nNow it's all about versace, you copied my style\nFive shots couldn't drop me, I took it and smiled\nNow I'm back to set the record straight, with my A-K\nI'm still the thug that you love to hate\nLittle busta I'll Hit 'Em Up\n\n(Verse 4): Eazy-E\nI never met a O.G. who never did nothing wrong\nYou tried to diss the Eazy-E, so now, sucka, it's on\nYou and your Doggy Dogg think that y'all hoggin' it\nBoth of you trickes can come and suck my Doggy\nBeatin' up a girl don't make you stuff but then again\nSome brothas think it makes a man\nDamn, it's a trip how a brotha could switch so quick\nFrom wearin' lipstick to smokin' on chronic at picnics\nAnd now you think you're bigger\nBut to me you ain't nothin' but a quick-damn Busta!\nThat ain't worth a food stamp\nAnd at Death Row, I hear you gettin' treated like boot camp\nGotta follow your sergeant's directions\nOr get your ass pumped with the Smith & Wesson\nLearn a lesson from the Eaze\nStay in your place and don't step to real compton city G's", "year": "2017-12-31"}, {"artist": "Eazy-E", "album": null, "title": "Real Thugs", "lyrics": "[Verse 1: Eazy-E]\nYeah, let's take a trip\nJust sit back and light a spliff with this and don't slip\nOn a funky-dope track, jump back\nStrapped with a fat buddah sack in a 7-8 'Lac\nGo clean, gangsta lean, I got green\nBud, I serve dubs like it ain't no thing\nIt's so sweet, when you got money to spend\nI got a proper big tilt and a fabec Benz\nI make ends, spend my dough on no ho\nThat's how it is, and that's how it goes\nAct like you know when I creep real slow\nGivin' love to them playas that I know is real G's\n\n[Verse 2: 2Pac]\nMobbin' like a motherfucker, stuck\nCan you put your middle finger out the window?\nGettin' fucked off liquor\nGet loaded, can't control it\nNigga, pass me the blunt and let me roll it\nYou get the bones act to the whole stack\nKeep your dough fat\n\n[Verse 3: Eazy-E]\nOr you might get what we call the rat pack\nI gives a damn 'bout a skanless trick\nLet me hit it one time and trick that sick\nI don't trip, gives my dough to no ho\nThat's how it is, I got no love for you\n\n[Verse 4: 2Pac]\nAnd jealous mothafuckas can't see\nThat it's the fame that caught these stupid bitches\nPass the pussy free\nSo, tell me, why you sweatin' a mothafucka like me?\nA young nigga tryin' to a hustle up some G's\nYou pussy-ass, playa-hatin' hoes\nSpeakin' down on niggas, jumpin' around at the shows\nAnd you're the first mothafucka to jump\nTo the trunk when it's time for funk, little trick-ass punk\n\n[Verse 5: Eazy-E]\nDump dump on fools with a quickness\nAnd they got no cure for this sickness\nI get paid for the way that I kick this\nLike a G-ster, an OG-ster\n(Who's that?) A real playa named Eazy\nAnd I live my life straight crazy\nDon't need no punk fools payin' me\nAnd broke groupies and hootchies don't faze me\nI take two steps back and release myself\nTo put platinum and gold on the record shelf\nI don't brag, but I do it like a straight up is\nBefore you do a record, partna, handle your business\n\n[Verse 6: 2Pac]\nAnd tell me, what does it take to be a G?\nI started with a quarter ounce and bounced to a key\nYou gotta watch your back, stay strapped, be alert\nStarted as a young mothafucka doin' dirt\nAnd now I'm in the rap game\nLike the crack game, I got enemies\nCan't pretend to see my friends are not my enemies\nAnd even thug mothafuckas wanna have fun\nStuck it, buckin' my mothafuckin' Magnum\nWhat does it take to be a G?\nSilence is a must, violence is a plus\nPlus, shots at my adversaries\nThem niggas scary, best it's time to be buried\n‘Cause I'll be buckin' in a fuckin' hurry\n\n[Hook: Ice Cube]\nThey give us guns and drugs\nThen wonder why you don't fuck with thugs\nYou wanna count the slugs\nThen come around here and fuck with us (You know)\nThey give us guns and drugs\nThen wonder why you don't fuck with thugs\nYou wanna count the slugs\nThen come around here and fuck with us\n\n[Outro: Ice Cube]\nEvery hood's the same, every hood's the same\nEvery hood's the same, every hood's the same\nEvery hood's the same, every hood's the same\nStop trippin' on me!\nEvery hood's the same, every hood's the same\nEvery hood's the same, every hood's the same\nEvery hood's the same, every hood's the same", "year": "2009-01-02"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Ruthless Life", "lyrics": "[Intro]\nCruel gangsta shit\nYes, just another chapter in ruthless chronicles scene\nEazy, Cashish, Loesta, lick up\nBuck, buck, buck!\n\n[Verse 1: Eazy-E]\nOne, and then comes the two to the motherfuckin' three\nThen comes the Eazy to the other fuckin' E\nPlayin' niggas life like a puppet\nAnd can't dance, sucka touch it, so fuck it\nRappers want to diss I'm glad to see 'em\nCause I rip your fuckin' face outta a magazine\nO.G. gangsta lean\nNow after I shit your face swap that ass clean\nTime to get tipsy\nAnd don't want a bitch if she can't rub the balls like a gypsy\nWho's all in?\n(Eazy, Cashish & Loesta we on the muthafuckin' screen)\nMotherfuck what ya heard I'm more than that\nA real nigga from the hood and I'm all of that\nThick as a hicky\nA picky nigga fittin' dickies with bitches strictly dickly\nMany sets I rolled on\nAnd killed squeals that told on, my homies that so on\nDon't ask Eazy shit\nIt's still a hit is a hit, and a bitch is a biitch!\nHangin' on my nuts like a hair strand\nHangin' there with their heart, and their plan\nAss out like an asshole\nRunnin' to my dick with a rhyme and a lasso\nAgain and again\nFrom beginning to end it's my nuts on your chin\n\n[Hook]\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit\nGimme that gangsta shit, that gangsta shit!\n\n[Verse 2: Cashish]\nLike shots to your dome\nKillin' off hella coppers, get dropped in the home\nWith the bangers and drug slangers that cocked on the chrome\nHangin' out of the Caprices in S.C. streets with\nCurb servin' head, jerkin' legs, squirtin' out your back\nFeds hurt without the strap\nThrow up the fleet, snap your limbs in a heat\nHelicopter toppler dropping the breeze\nPoppin' the thieves for my knots in the streets\nAnd the blocks and the priest\nEager to pump and leave ya\nWhat you need is a real heat seeker\nDig in the bass, up in the state, dick in your face\nIf you tripping get banged by them black plate\nCracked the safe, I'm comin' out of your space\nLike an atom bomb rippin' your steak\nRunnin' your lips, they got sniff for your pain\nBy these L-E-Gs, nailin' the fleas\nTryna escape cause you feel the gauge, pump and the squeeze\n\n[Hook]\nThat ruthless life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit\nGimme that gangsta shit, that gangsta shit!\n\n[Verse 3: Loesta]\nThis for the scene, for the hot four money getters\nFor the dope dealers, for the big hitters\nFor my datin' diners, for the regal bidness\nMy instrumental killers are real niggas\nMy no talent niggas, hands on your triggers\nThis where the peace meet the fatal realistical\nAnd where the hard shit meet the radio\nNiggas tastin' the chrome, niggas taste the flow\nThe street game is so motherfuckin' heinous\nGangsta, my head rest, L-E-G vest\nIt's a city of its own in the projects\nStreet life end in cocaine, what's next?\nHopping with the hotters, killing with the best\nLeaving the scene wet, crime elements\nTake his money, clips, his dogs and his ribs\nEntertainers, where all this damn entertainment?\nGagging the fool on the day [?] Raymond\nGangsta shit, legends in the mix\nFrom S.C. to the CPT\nComing to take mine, he just took nine\nScratch material, we came for the dough\nI'm out truly get mine watch the chrome\nThe primal zone, my motherfuckin' home\nBrutal city, shot silly, gag Jimmy nigga, nigga\n\n[Hook]\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!\nThat ruthless life, life is what we live\nThat's how we live, nigga!\nGimmie that gangsta shit, that gangsta shit, that gangsta shit!", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": null, "title": "Ruthless Radio Show Theme", "lyrics": "[Dirty Red]\nStraight up and down\nAnd those that's not knowing, it's 6'o clock\nAnd the Ruthless Radio Show is in high gear\nSo strap up fools and let's ride the yellow brick road to Compton\nMy mellow E is in the house\nMy city G's is in the house\nMy I.E's is in the house\nAnd I'm Dirty Red. Yeah- I'm in the house\n\n[Eazy-E]\nCome on, come one, let's take that ride\nEazy-E, CPT, OG from the other side\nRolling my 6-double O 92. Trey on my radio\nOh, got heat under my seat\nWatch my back as I bump the beat\nDouble law, ese\nNow, want to hit some corners\nJump up, jump in, rag on top of toners\nTalking about staying true to the street\nWell, now you got it, Eazy-E on the beat\n\n[Slow Pain]\nI biggie bounce on the west coast\nFlavor for the 9-4, 6-4 Impala, the suicide dose\nHopping and jumping, kangarooing around the streets\nRuthless Radio, 92, the beat\nThe Compton bang, Eazy-E's in the house\nThe Free o School DJ is in the house\nTony G, can I get a little cut\nJulio G, can I get a fat cut\nYella got the freak of the weekend in the backseat\nReady or not here, I come\nIt's the baldy show and I'm on the run\nThree deep, click, click, bang, bang\nStick them up, it's a Ruthless thing\n\n[JV]\nWell, it's the firme hyna\nCreeping up behind ya\nThe neighborhood queen gets me when I find ya\nA.L.T., 92-3\nWhat you be doing on the Boulevard with me\n\n[A.L.T.]\nI'mm be bouncing, flossing, riding, gliding\nYelling out Ruthless driving my side in\nLife it back up with the draulics, you call it\nTwo for one, is the two alcoholics\nWhat do you know, hardcore went radio\nYeah, I'm Mexican and you still can't fade me though\nA.L.T'en., Slow Pain straight G'en, Eazy-E'en, 92. 3'en\n\n[Kid Frost]\nIt's like two for the trouble, one for the time\nThree for the Glock and four for the nine\nFive for the shells, six for the clip\nSeven for the fools that trip\nNow listen 92. east side 3 is the beat\nOG Frost rolling down the street\nA cutie by a couple of freaks that we meet\nSo let me here you say \"oh\" if your down with the show\nI like to bounce and rock, staid, then roll\nBut when I bootlift, it's like Ruthless Radio\n\n[Eazy-E]\nHit'em up, hit'em up 92. Trey\nRuthless Radio Show okay?\nWe got the bigger the week and Tony G\nDJ Yella and Jesse\nAnd everybody in the house say \"Oh\"\nAnd for the ladies, another G, Julio\nYo, this is Eazy-E\nYou're listening to 92.3, The Beat\nYo Yella, kick it, kick it, kick it, kick it", "year": null}, {"artist": "Eazy-E", "album": "Straight Outta Compton", "title": "Ruthless Records Discography", "lyrics": "1987:\nN.W.A And The Posse\n\n1988:\nStraight Outta Compton\nEazy-Duz-It\nSupersonic - The Album\n\n1989:\nNo One Can Do It Better\nMichel'le\n\n1990:\nLivin' Like Hustlers\n100 Miles And Runnin'\nNot Just A Fad\nLivin' in a Hoe House\n\n1991:\nEFIL4ZAGGIN\nAddictive Hip Hop Muzick\nVocally Pimpin'\nAre U Xperienced?\nMuzical Madness\n\n1992:\nKizz My Black Azz\n5150: Home 4 Tha Sick\nPaid Tha Cost\nFunky Vibe\n\n1993:\nBlack Mafia Life\nIt's On (Dr. Dre) 187um Killa\nShock Of The Hour\nFuture Profits\n\n1994:\nAz Much Ass Azz U Want\nFunk Upon A Rhyme\nHittin' Like A Bullet\nCreepin On Ah Come Up\nUncle Sam's Curse\nTrippin Wit No Luggage\nCha-licious\nGang Related\nPuddles Of H2O\n\n1995:\nSmile Now, Die Later\nE. 1999 Eternal\nDo Or Die\nFree\n\n1996:\nThe Villain In Black\n\n1997:\nWhen HELL.A. Freezes Over", "year": null}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Ruthless Villain", "lyrics": "[Intro]\nMC Ren: Yo Dre, how much time we got left on ths tape?\nDr. Dre: About a couple of minutes\nMC Ren: Well let me bust a freestyle then\nDr. Dre: Awright, go ahead\n\n[MC Ren]\nRuthless gangsta, definition villain\nLeave your shit unlocked and he's stealin'\nSo call tha police cause that's all you could do but\nHe'll get away without leavin' a clue\n\nDr. Dre: Wait a minute, wait a minute, cut this shit\nEh yo Yella boy why don't you rewind it\nHey, man you gotta get more hyped up than that\nMC Ren: Damn, why don't you pump this shit up so it could fuck up my eardrums a little bit!\nDr. Dre: Allright bet\n\n[Verse 1: MC Ren]\nRuthless gangsta, definition villain\nLeave your shit unlocked and it's stealin'\nSo call tha police cause that's all you could do but\nHe'll get away without leavin' a clue\nKeepin' shit in control like the neighboorhood chief but\nReferred to as a walking thief\nThey say he's a bad influence for the kids on the block\nWhy the fuck they blamin' him he's the one that they jock\nKeepin' niggas in line, whoever fucks with his rhyme\nAnd before you fuck with him you gotta fuck with his nine\nNot scared to pull the trigger on a punk ass nigga\nHe could whoop his ass cause he's bigger\nSize don't mean shit he's from the old school fool\nHe's a villain from the streets and he's supposed to rule\nNot sayin' he's in shit but he's down for mine\nHe was put on the streets to keep niggas in line\nNever givin' a fuck, cause you jealous of E\nBecause I know that he's a nigga that you want to be\nHe can't help it he's in shit but he don't hold shit back\nHe's a gangsta in black and he's about to attack\n\n[Hook: Eazy-E]\nCause I'm a ruthless villain, cold tearin' shit up\nDon't come on my face, pumpin' no kind of junk\nEazy-E's in control and if you press your luck\nI'll smoke you like that and won't give a fuck\n\n[Sample]\n\"Nickname Eazy-E...Ol' 8-Ball junkie!\"\n\n[Verse 2: MC Ren]\nRuthless gangsta, definition villain\nYou can lock up yo' shit, he's still stealin'\nGettin' respect cause the boy kicks butt\nBut the real meaning is he don't give a fuck\nIt's Eazy-E in the crowd but he's not in the 4\nI tell his money flow as he collects from his ho'\nAll expenses paid for the rhymes that he made\nGold trophies in the house for the girls that he laid\nNot a wimp he's a pimp, now of course he's the boss\nSo keep your bitch out his face or else she's gonna get tossed\nThe hard to be fucked with, the boy got heart\nWanna fuck with him, he'll rip your head apart\nGangsta Gangsta, that's what they yellin'\nBut him with his gangsta stroll he keeps bailin'\nWherever he goes there's no discussion but silence\nThey say that he's the one promotin' gang violence\nThat's a lie just a critic all that whack bullshit\nSo let me tell you motherfuckers who you fuckin' with\n\n[Hook: Eazy-E]\nCause I'm a ruthless villain, cold tearin' shit up\nDon't come on my face, pumpin' no kind of junk\nEazy-E's in control and if you press your luck\nI'll smoke you like that and won't give a fuck\n\nEazy-E: Yo Ren?\nMC Ren: What's up?\nEazy-E: Let's get the fuck outta here!", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Sippin On A 40", "lyrics": "[Intro]\nSippin' on a 40\nAnd smoking endo\nSippin' on a 40\nAnd smoking endo\n\n[Verse 1]\n[Dresta]\nAyo, let's roll to the store, Eazy-E\nSo we can buy us some O.E. 40oz\nGettin' a buzz with the thugs in the neighborhood's back\nBut buy you a couple of extra one's for the neighborhood rats\n\n[Eazy-E]\nNigga, you be drinkin' out my bottle, bitch, that's bullshit\nStill got semen on ya lips from the homies dick\nTrick yo the home girl\nBut sit you like a loose goose\nSo gimmie a couple of dollars, so I can bring you back a duece duece\n\n[B.G. Knocc Out]\nWell, bring B.G. Knocc Out back a motherfuckin' 40o'\nSo me and my nigga Big Boy can go and cop some endo\nAnd well be right back at you niggas with a quick fast\nDresta, don't forget to buy a couple of packs of Zig-Zags\n\n[Hook]\nSippin' on a 40\n(8-ball rollin')\nAnd smoking endo\n(nick name Eazy-E)\nSippin' on a 40\n(8-ball rollin')\nAnd smoking endo\n(Drinkin' like a mad man yes I do)\n\n[Verse 2]\n[Eazy-E]\nBack to the store all the 40 o's were kinda hot\n\n[Dresta]\nGet the shit or not\n\n[Eazy-E]\nNaw, lets roll to another spot\nBack in the '4 to another store\n\n[Dresta]\nI told you the store on 124th keep the cold brew\n*Speakin' Spanish*\nMake a right\n\n[Eazy-E]\nThe Store ain't in sight\n\n[Dresta]\nNigga, it's right pass, the next light\nPass across the light\nNow, here's what you gotta do\nGet in ya left lane and make a motherfuckin' U\n\n[Eazy-E]\nLet's get at least 10 40's and at least 10 22's\nThat should be enough for the whole motherfuckin' crew\nPlus they got endo a nigga's gonna be double blitz\n\n[Dresta]\nOh, give me some Zig-Zags and two packs of Doublemint\n\n[Hook]\n\n[Verse 3]\n[B.G. Knocc Out]\nYo Dresta\n\n[Dresta]\nWhat's up\n\n[B.G. Knocc Out]\nDid you bring back some gum?\n\n[Dresta]\nHell yeah\n\n[B.G. Knocc Out]\nGood, now a nigga breath won't be yo hum\nNow pass me a stick\nSo I can spit game at this trick\nCause beer breath and tricks don't mix\n\n[Eazy-E]\nY'all don't give a fuck what a punk bitch stank\nCause my breath always stank every time I take a drank\n40's I be downin', I'm drownin' myself\nLet me hit the joint and I'll be clownin' everybody else\n\n[Dresta]\nYou won't be clownin' me, cause I got jokes for your trick ass\nOh bitch you tryin' tah bag, I got jokes for your bitch ass\nWell, let me hit the joint once again and we can go, G\nBut, oh, let me take another sip off the O.E\n\n[Hook]", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Sorry Louie", "lyrics": "[Intro]\n\"Hi, Claude again. You remember I told you about my cousin when I was 15? Well, the year after that, I killed this kid, Louie. Bashed his head in with my Louisville Slugger, hahaha! I got away with it, haha! But erm, I wanna apologize to Louie. I'm sorry Louie, hahaha!\"\n\n[Hook (x5)]\nBashed his head in with my Louisville Slugger\n\n[Verse 1]\nI knew this motherfucker named Louie\nEvery day the nigga talked shit but today he tried to do me\nHe rolled down my block with a pistol and a stare\nA black khaki suit and dooky braids in his hair\nThe motherfucker thinks I'm slippin'\nBut I got my gat and a bat and a 40 and I'm sippin'\nWaitin' for the fool to get out the car\nThe stupid motherfucker thinks I'm a star\nBut I'm not\nI'm the type that'll kick the nigga's ass\nFast\nEazy E's a nigga that'll blast\nHold up, wait, the nigga started to load his gat\nI grabbed my bat and ran around the back, yo\nHe's at my window, thinkin' I play Nintendo\nBut the stupid nigga don't know I'm behind him so\nHe dropped the gat like a stupid motherfucker\nSo I bashed his head in with my Louisville Slugger\n\n[Hook]\n\n[Verse 2]\nI knew this bitch named Peaches\nShe often wanted me to fuck her trampy ass on the beaches\nBut bust it, yo, Peaches\nBe fuckin' around with me, instead of fuckin' her man\nShe's butt-naked with my dick in her hand, yo\nAs soon as Peaches started suckin'\nI saw this motherfuckin'\nNigga behind my car, and he was duckin'\nSo I told the bitch to hold on\nYou stupid bitch, put your motherfuckin' clothes on\nI wonder if this nigga's tryna jack me\nCause I ain't got my gat with me, shit\nThe nigga started runnin' up fast\nI thought he was gonna blast, so I hid behind her ass\nShe started howlin' out \"wait\"\nI banked her in the face\nBut the punk nigga pulled out mace\nHe asked the stupid ass bitch did I mug her\nSo I bashed his head in with my Louisville Slugger\n\n[Hook]\n\n[Verse 3]\nI'm a motherfuckin' psycho and I don't give a fuck about 'em\nI kill the nigga, cut off his dick, so you know I got 'em\nCut his vein, ate his brain, left the nigga for dead\nNow it's a gallon of blood, drippin' from under his bed\n(\"Oh, no! What happened to my lover?\")\nBitch, I bashed his head in with my Louisville Slugger\nBitch tried to call the cops, fuck that\nI gotta take the girl out with my motherfuckin' bat\nCause I ain't doin' ten in the pen\nFor a bitch and her dead-ass boyfriend\nSo I gotta kill the ho\nI'm reachin' for my weapon slow\nThat's when I notice some nigga standin' by the door\nThe little nigga said \"don't kill my mother\"\nSo I bashed his head in with my Louisville Slugger\n\n[Hook]\n\nSorry, Jimmy\n*evil laughing*\nHe's dead\n*evil laughing*\nI'm sorry, Billy\n*evil laughing*", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": "It's On (D̶r̶.̶ ̶D̶r̶e̶) 187ᵘᵐ Killa", "title": "Still A Nigga", "lyrics": "[Intro; spoken word]\nStraight off the streets of Compton\nDedicated and by most suckers hated\nBut I got something I want you motherfuckers to know\nI really don't give a fuck\n*laughing*\n\n[Verse 1]\nNiggas ain't shit in the 90's, I don't trust 'em\nAnd bitches on my dick but they ain't shit, so motherfuck 'em\nEazy know's what's up, 'cause see he really don't give a fuck\n'Cause it don't concern me if don't pertain to money or a nut\nBut then again I talk to a few of my friends\nNine times out of ten 'bout some ends or some skins\n'Cause I'm the type of nigga that gotta have it like a rabbit\nRappin' is my hustle bustin' ho's is a habbit\nI stab it like a true no good nigga should\nI do it the way a down O.G. nigga would\nAnd now niggas know Eric Wright ain't no busta\nAnother platinum cut from the Compton thugsta\nMy name is\n\n\"Eazy-E\"\n\n[Hook; spoken word]\nEazy muthaphukkin E\nA real nigga\nBorn and raised in motherfuckin' Compton\nThis one's dedicated to you busta-ass niggas\nYou know who you are\nSmoke a fat ass joint to this, bitch\n*laughing*\n\n[Verse 2]\nI don't think I'm all this or that, but I'm all me\nOriginal gangsta E-A-Z-Y-E\nDown from the jump now I'm endin' with the biz and\nStill rollin' in my 6-4 on them thizangs\nDo wicked shit, 'cause shit is wicked on the streets\nAnd from what my eyes see the wickedness will never cease\nBitches on my dick and you know I'm runnin' y'all\nSo you just sold your soul to the motherfuckin' devil's son-in-law\nWicked as could be Eazy-E got the flow\nLeavin' a smell of death on the Row for sure\nAnd a ho can't make me or break me\nBut she can take me to a motel\nAnd work a nigga swell\n'Cause I'm Eazy-E\n\n[Hook; spoken word]\nYeah, suck on these nuts, motherfuckers\nGet with the real and quit faking the funk\nAnd oh yeah, stay off my dick, haha\nReally doe\n*laughing*\n\n[Verse 3]\nI let my demons lose when I hit the 8 juice\nAnd I leave a trail of stiffs when I'm high of a spliff\nNiggas talk shit so I talk a lot of shit, too\nNiggas wanna diss, fuck them and their whole crew\nIn fact niggas thank ya for stockin' a niggas bank up\nYeah, I'm livin' swell but I'm a gangsta like Dresta\nNo not the doctor, physician or the MD\nDresta's an O.G., Doc is a phony\nOnly the real real still can chill with me\nAnd the rest can't fuck with E\n'Cause I'm the O.G. that'll bring you down\nThe devil's son in law, king of the underground\nGood to go with the flow that I throw\nGivin' ya mo' to let a motherfucker know\nThat I can get wreck on the set and make ya small\n'Cause you know I ain't a joke\nI'm a motherfuckin' loc, and my name is Eazy-E\n\n[Outro; spoken word]\nEazy muthaphukkin E\nBut you bitches can just call me E\nA real nigga from the C-P-T\nKickin' ass and asking questions later\nOh yeah, don't get smoked, loc\nAnd I'm out, motherfuckers", "year": "1993-10-19"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Still Fuckem", "lyrics": "[Intro: Paperboy]\nAye E,aye E,check this out man\nYou,you,you really need to let these niggas\nYou know,I mean,what,what really went down\nYou know I mean,with all this shit junked off nigga\nThis yo' nigga Paperboy nigga,you know,know\nCome on nigga it's me nigga\nDon't hold shit back,let 'em mothafuckas know\n\n\n[Verse 1: Eazy-E]\nIt's 95 and shit won't stop (Won't stop!)\nNo justice,no peace,so mothafuck 'em cops (Fuck 'em cops!)\nFuckin' with niggas for no God damn reason\nSo the 187 on all pigs all season\nYou ain't no mothafuckin' role book cop\nI got bullets that your mothafuckin' vest won't stop (Won't stop!)\nSo check me if you mothafuckin' can\nI said fuck the police in '89\nDid ya' understand?\nAnd shit ain't changed,shit still the same\nBlowin' out brains\nWhipped set identified or I'll be slaved\nLivin' in the case,3 strikes and I'm out\nShit y'all could say\nNow I'm offering the Liquor store\nMothafuckas layin' on it on the mothafuckin' flow\nFuck it,add 2 more!\n(Aye cray,aye E,let these niggas down man\n\n[Paperboy]\nAye cray,aye E,let these niggas down man\nTo know what time it is!\n\n[Verse 2: The Genie]\nThese niggas don't wanna picture me\nThe 50 birds,the half mill,the hotel got the flew\nThat's where they sick of me niggas\nDon't want to pick of me\nWatch out for deliver\nThese haters,they can't owe me\nDon't wanna know me\nThey like for,for freedom\nPick it up\nWatch these stacks slowly\nIn the house underground\nAnd live like Stevie Wonder now nigga\nI want that cash that they don't see\nForever bar,fuck yo' bitch leave my worry\nShe poppin' out cause she want me,nigga\nJust hold on bit,I'll take it up\nI got enough cash\n\n[Hook]\n(Still fuck 'em)\nThese niggas wanna G like me,nigga\nAin't be a G like me,but\n(Still fuck 'em)\nThese niggas wanna throw like me\nOr the G who rules the world like me,but\n(Still fuck 'em)\nThese niggas wanna floss like mine\nThey want roll it that it costs like mine,but\n(Still fuck 'em)\nThese niggas wanna blow my trees\nDrop the rag on the rollin' like Eaz,but nigga\n(Still fuck 'em)\n\n[Verse 3: Eazy-E]", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Still Talkin'", "lyrics": "[Intro/Prelude]\nGood evening, and welcome to Eazy's playhouse\nYou stupid muthafucka!\nNow that you got the album\nWhat the fuck are you gonna do with it, bitch?\n\n[Ice Cube + Dr. Dre + Eazy-E]\nI knew this nigga back in, uh, uh—back since a nigga was little\n(You lying, you lying man)\nThe nigga come from Compton, Michigan, nigga\n(Compton what? You ain't never met no Eazy-E)\nWell, I'ma introduce him (You a damn liar!)\nThis is the craziest motherfucka you done seen (You a damn liar!)\nThis nigga's crazy—just listen!\n\n[Verse 1]\nEasily I approach\nThe microphone because I ain't no joke\nTell your momma to get off of my tip\nI have no time to give her my dick\nI'm gonna hold it, and walk around the stage and\nIf you fuck up I'm goin' to get my gauge and\nUnload the barrel and laugh\n'Cause I'm puttin' lead in your mothafuckin' ass\nPsychopathic, but the hoes are attracted\nBecause when I'm on hard, my dick's at least a yard\nIn the days of old, I was a nut\nNow I'll need at least 3 hoes when I fuck\n'Cause I do a check—nut 1, nut 2\nThen I save a nut for when there's nothin' else to do\nGet used to the crew, bitch, 'cause I would never quit\nAs soon as you think that's it, I'm still talkin' shit\n\n[Interlude: Ice Cube + Dr. Dre]\nHa ha, I told you that nigga was crazy\nEazy Eric, that's my boy, ha ha, godamnit\nGo on, boy, wit' yo' bad self\nStep up to the mic, nigga (Ay bitch, pass me my Ripple)\n\n[Verse 2]\nI got a fable that you need to listen to\nIt's a funky little rhyme about a bitch or a two\nOne's Sharon, the other one Shaun\nI wanted to nut, but which one do I want?\nShaun said, \"Eazy, let me fuck you blind\"\nAnd Sharon said, \"E, I want to blow your mind\"\nI said fuck it, I know what should be done\nJust pull your panties down and I'll fuck the biggest one\nAnd then I get the other pussy, put it in the freezer\nSo I can always have a on-hold skeezer\nYeah, that's the ticket, I'll do it like that\nSo I told the hoes to take a big step back\nTook the zipper down, eyes wide, and said\n\"Here's what I'm gonna put inside\"\nGrab it like a rabbit (grab it), let's work it (work it)\nBut I won't love you—when I'm done, I'll still be talkin' shit ...\n\n[Interlude: Ice Cube + Dr. Dre + Eazy-E]\nHa ha, that boy good (Yeah, that boy's good)\n(That muthafucka be talkin' all kinds of shit)\nI used to get pussy like Eazy Eric every day\n(You ain't no motherfucker) How you know, muthafucka?\n(You're lyin', your dick can't get hard)\nOh, suck my dick, muthafucka (Nigga, you lyin')\nWho you talkin' to? Well, get up then, nigga, shit...\n\n[Interlude: Dr. Dre]\nWait a minute, wait a minute, cut this shit\nAyo Yella boy, why don't you rewind it\n\n[Verse 3: Eazy-E ]\nNiggas don't see I'm a 100 percent legit\nAnd you know it ain't about all that bullshit\nIt's about fuckin' this bitch and that bitch\nBut not the bitch with the 7 day itch, like that ho'\nJust throwin' me the pussy\nShe says she wants to do it like a doggy\nShe's bad, nobody is badder\nBut she got more crabs than a seafood platter\nBitch on the gank move, to skeaze me\nJust to say \"I got fucked by Eazy\"\nSo I slapped the ho' like a pimp\nI might be a woman-beater but I'm not a pussy-eater\nSo when the shit hits the fan, it's outta my mouth\nYou don't like what I'm talkin' about?\nAll of y'all can just suck my dick\nYou could quote me now 'cause I'm still talkin' shit\n\n[Interlude: Ice Cube + Dr. Dre]\nThe boy's good—I told you, boy\n(Ay, I knew him when he was knee-high)\nThe nigga got talent—you don't know a damn thing\n(I knew him when he was knee-high)\nHe still is knee-high, muthafucka\n(Yeah, I like that part—bring that shit back one more time, Maestro)\nThat's that old Z.Z. Hill, huh? Ha ha ha\nI tell ya, boy, I can do the Mashed Potato, nigga, what can you do?\n(Muthafucka, I can do the bugaloo, I can do the bugaloo)\nBugaloo!? That old shit been played out back in 1967\n(Man, fuck you; fuck you)", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "Still Talkin' (Remix)", "lyrics": "Ahhhhh!\nThe bad guys are coming\n[?]\nWe're all talkin' shit now\n[?]\nI ain't gonna miss this\n\n[Intro: Ice Cube +(Dr.Dre)]\nRemix my black ass\n(Heh heh heh heh, hey man, that little nigga gettin' his ass whipped)\nWait...this shit sound familiar\n(Hey, hey wait a minute goddammit it that the only thing y'all motherfuckers know how to play?)\nFlip it on the B-side motherfuckers!\n(Been playin' that shit all night)\n[?]\n\n[Verse 1]\nEasily I approach\nThe microphone because I ain't no joke\nTell your momma to get off of my tip\nI have no time to give her my dick\nI'm gonna hold it, and walk around the stage and\nIf you fuck up I'm goin' to get my gauge and\nUnload the barrel and laugh\n'Cause I'm puttin' lead in your mothafuckin' ass\nPsychopathic, but the hoes are attracted\nBecause when I'm on hard, my dick's at least a yard\nIn the days of old, I was a nut\nNow I'll need at least 3 hoes when I fuck\n'Cause I do a check—nut 1, nut 2\nThen I save a nut for when there's nothin' else to do\nGet used to the crew, bitch, 'cause I would never quit\nAs soon as you think that's it, I'm still talkin' shit\n\n[Interlude: Ice Cube + (Dr. Dre)]\nAin't that a bitch\n(Ain't that a bitch)\nMotherfucker you need yo little ass whooped\n(Quit blowin' smoke in my damn face motherfucker)\nBoy, boy, say something I won't listen to\n\n[Bridge]\nEazy (Eazy), The E-A-Z-Y-E\nIf it sounds complicated then read the marquee\nRuthless (Ruthless), label me or label my label\nA cable for the bitches and niggas I throw in ditches\nSmoke 'em (Smoke 'em), it ain't nothing for me to kill 'em\nAnd carry 'em, to the grave, recite and then I bury 'em\nMaking sure I create enough space\nTo drop his ass in while I'm dropping this motherfuckin' bass\n\n[Interlude: Ice Cube + (Dr. Dre)]\nI still can do the Mashed Potato motherfucker!\nWhat can you do?\n(I thought you said you were from Compton, Michigan\nAin't no such thing as Compton, Michigan motherfucker you lied to me)\nNigga Compton, California motherfucker\n\n[Verse 2]\nI got a fable that you need to listen to\nIt's a funky little rhyme about a bitch or a two\nOne's Sharon, the other one Shaun\nI wanted to nut, but which one do I want?\nShaun said, \"Eazy, let me fuck you blind\"\nAnd Sharon said, \"E, I want to blow your mind\"\nI said fuck it, I know what should be done\nJust pull your panties down and I'll fuck the biggest one\nAnd then I get the other pussy, put it in the freezer (freezer)\nSo I can always have a on-hold skeezer (skeezer)\nYeah, that's the ticket, I'll do it like that\nSo I told the hoes to take a big step back\nTook the zipper down, eyes wide, and said\n\"Here's what I'm gonna put inside\"\nGrab it like a rabbit (grab it), let's work it (work it)\nBut I won't love you—when I'm done, I'll still be talkin' shit ...\n\n[Interlude: Ice Cube + (Dr. Dre)]\nThis remind me of that old [?] joint Miss Mabel had, you could have all the fat bitches you want, and I have a goddamn [?]\n\n[Bridge]\nFuck it (fuck it), the new, the old, the ordinary\nObviously, you can't hang with my commentary\nI don't give a fuck what's up, you wanna get up?\nNope, cause you a sucker motherfucker\nDre kicks the bass, and I talk shit\nThat's it, that's all\nBecause to call a bitch a bitch, you gotta have balls\nSlap a hoe across the face, and talk shit to the motherfuckin' kick, of the motherfuckin' bass\n\n[Interlude: Ice Cube + (Dr. Dre)]\nDidn't I tell you that nigga was crazy\nRemind me of that [?] motherfucker\nY'know he sayin' howdy, howdy, howdy, howdy, howw\n(Get yo motherfucker hands off me motherfucker)\nYou back off you ugly motherfucker\n(Suck my dick)\nLick my balls motherfucker!\n(Wait a minute, wait a minute, cut this dumb shit\nAyo Yella Boy, why don't you rewind it)\n\n[Verse 3: Eazy-E]\nNiggas don't see I'm a 100 percent legit\nAnd you know it ain't about all that bullshit\nIt's about fuckin' this bitch and that bitch\nBut not the bitch with the 7 day itch, like that ho' (that ho')\nJust throwin' me the pussy (pussy)\nShe says she wants to do it like a doggy (doggy)\nShe's bad, nobody is badder\nBut she got more crabs than a seafood platter (platter)\nBitch on the gank move (gank move), to skeaze me\nJust to say \"I got fucked by Eazy\" (Eazy)\nSo I slapped the ho' like a pimp\nI might be a woman-beater but I'm not a pussy-eater\nSo when the shit hits the fan, it's outta my mouth (my mouth)\nYou don't like what I'm talkin' about? (about)\nAll of y'all can just suck my dick\nYou could quote me now 'cause I'm still talkin' shit\n\n[Outro: Ice Cube + (Dr. Dre) + Eazy-E]\nThis ain't no CP Hill, motherfucker\nThis sound like that Parliament Funk [?]\nYo yo, watch me do this\n*piano notes*\n{?}\nEster, I'm coming to see ya honey\n[?]\nThat boy Eazy, and the nigga on the side, you know, that right around the corner from him\n(Damn lie)\nThe nigga be livin' around the corner\n(You be talkin' too much shit)\nNigga, I was in 3 World Wars, nigga\n(Motherfucker I knew the nigga when he was knee high)\nI'm still talkin shit!\nI used to court the motherfucker, I used to change his shitty ass diapers\n(That's a damn lie)\nHe ain't lyin'\nPut 'em up motherfucker, put 'em up\n(Put 'em up)\nC'mon motherfucker\nYou better cut that old shit out, or I'll come over and pee on one y'all motherfuckers\nYeah, ain't nothing but a goddamn thang on my slang, I can rap, look\nRabba dabba slabba, ey, and if you want something else, buy the album bitch", "year": null}, {"artist": "Eazy-E", "album": null, "title": "Street Thug", "lyrics": "(Eazy-E)\n1,2,3, and to the 4\nEazy muthafuckin' E\nWith the chrome to your dome\nCruisin' in my '64 rag top\nI got a lot of juice\nA lot of fuckin' block\nNow when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nKeep the gat in my lap\nCuz I'm fully strapped\nFor the car jackers\nFuck no hapsters\nI pack a Tech-9\nPlus a AK-47\nSend a one way ticket to my hell\nOr maybe heaven, peep\nNigga I don't sleep\nBurry muthafuckas in the concrete\nYou try creep kinda slow in a Astro\nBut I peep you niggas out in my left window\nSo I blast and I blast til I blast no mo\nYo, they call a muthafucka John Doe\nPussy nigga had beef knocked out of his teeth\nThe muthafucka should have stayed his ass home\nHey yo peep them bitchez in the Honda\n4 deep with the proper ass sounds\n\n(2Pac)\nJust wait until rain turn to sunshine\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost Souls\n\n(2Pac)\nJust wait until rain turn to sunshine\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost Souls\n\n(Eminem)\nWhen me and Fif' got together to do this music\nThe more we became enveloped we just developed a fellowship through it\nIt's no pretend shit, it's friendship, me nemesis is su nemesis\nAin't for him, it's just media, see to them it's just images\nBut this shit is no gimmicks, this is blood in and blood out\nWhen there's beef you just gotta know when to butt in and butt out\nIf there's a problem we solve it, if we don't resolve it\nIt usually just evolves into one big brawl and we all get involved in it\nWe should all get a merit, this much beef we inherit\nAnd wear it like a badge of honor, pass it around and share it\nAnd let it go to whoever's holdin' the most current people on their shoulders\nAnd their soldiers got their backs till it's over\nBut tonight, we ain't comin' here to beef with nobody\nWe came to party, Banks, Ca$his and Mr. Ferrari\nSo it's Shady Aftermizat back in that ass, you wizzass\nCome hizzon what kinda fuzukin' quizition is that\n\n(2Pac)\nJust wait until rain turn to sunshine\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost Souls\n\n(2Pac)\nJust wait until rain turn to sunshine\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost Souls\n\n(2Pac)\nI'm barely standin, and plus my secondhand say it's midnight\nSome Alize and Cristal guaranteed to get right\nLike misdemeanors is a small thang\nWith DJ Quik in this bitch, I let my balls hang\nRunnin through the street lights, cause we like, yo nigga\nGet your mobb on show em what a G like\nAround the corner it's like Vegas, or better yet like Reno\nNiggas poppin, welcome to our casino, cause you and me know", "year": "2016-12-12"}, {"artist": "Eazy-E", "album": "Impact Of A Legend", "title": "Switchez", "lyrics": "[Eazy-E]\n1,2,3, and to the 4\nEazy muthafuckin' E\nWith the chrome to your dome\nCruisin' in my '64 rag top\nI got a lot of juice\nA lot of fuckin' block\nNow when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nKeep the gat in my lap\nCuz I'm fully strapped\nFor the car jackers\nFuck no hapsters\nI pack a Tech-9\nPlus a AK-47\nSend a one way ticket to my hell\nOr maybe heaven, peep\nNigga I don't sleep\nBury muthafuckas in the concrete\nYou try creep kinda slow in a Astro\nBut I peep you niggas out in my left window\nSo I blast and I blast til I blast no mo\nYo, they call a muthafucka John Doe\n\n[Hook]\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\n\n[Verse 2: Roc Slanga]\nBe a witness to murda\nNiggas bustin' out of a '64 Chevy\nStraight callin' my city\nNiggas be winnin' and gettin' busy\nWit a tizy\nThrough my city\nChalk lines hang\nNiggas bang\nChevy's swang like it ain't no thang\nThe gangs bang\nSo nigga tuck your chain\nAnd try to duck this thang\nEnd up puffin' one stuck in you brain\nTo refrain from this game of stressin'\nSmokin' on water\nAnd fin to bang your daughter\nAll up in the Best Western\nShe like the way that my '64 hop\nDrop the top\nGrab a rock\nNow she's givin' me top\nNon stop on the R-O-C\nLike the way she made me scream\nSo I two-wayed my nigga Eazy-E\n\n[Hook]\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\n\n[Verse 3: Eazy-E]\nOld nigga E still cruisin'\nPunk stay up on the nuts and the bone\nPussy nigga had beef knocked out of his teeth\nThe muthafucka should have stayed his ass home\nHey yo peep them bitchez in the Honda\n4 deep with the proper ass sounds\nNow every time that I meet a fine cute bitch\nShe got a friend from the fuckin' Dog Pound\nHey yo bitch\nHere's the seven digits\nCall me if you can\nOnly if you want it\nLet a nigga know\nCan I dig like a miner, 49er\nDiggin' for gold from behind her\nWatch this nigga do some diggin'\nPop that pussy on a platter\nWatch this nigga do some diggin'\nLoose or tight it doesn't matter\nYO!\n\n[Hook]\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\n\n[bridge]\nHit them swithez [hit them swithez]\nHit them swithez [come on nigga]\nHit the swithez [make that shit bounce man]\nMake it bounce [make it bounce homie]\nHit them swithez [man come on homie]\nHit them swithez [make that shit bounce homie]\nHit the swithez [three wheel motion]\nMake it bounce [say what]\n\n[Hook]\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nCuz when I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\nWhen I hit that switch I'm bouncin'\nMore bounce to the ounce\nAnd I'm clownin'\n\n[Outro: Roc Slanga]\nThat's right nigga\nWe back\nThat real gangsta shit\nFrom one of the realest niggas in this game\nYou know his name nigga\n[Laughs]", "year": "2002-03-26"}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Tha Muthaphukkin Real", "lyrics": "[Verse 1: MC Ren]\nWell, it be the real niggas back with that hard street shit\nBitch niggas be pissin' a fit but I say fuck 'em, when I buck 'em\nIt's that nigga with the cool and mellow shit for your ass\nTakin' niggas back through the past\nAll up on my nuts shit be swingin' like a fist\nCan't even take a piss, if I did niggas would cut they wrist\nIn a motherfuckin' candy 4, beat that ass with the switch\nThen blast on the bitch who was all in my shit\nIt's that nigga Ren back for the '9-5\nThey say real niggas was dead but this nigga be alive\nSo I'm puttin' it down with that nigga E\nFor all of my niggas in the C-P-T\nSo here we go again with part 3 of the script\nMaking bitch made niggas bite their lip, when we dip\nSo tell me how the fuck do it feel\nTo get hit with the motherfuckin' real\n\n[Hook]\nThe motherfuckin' real\n(Shouts goin' out to the hardcore hip hop)\nThe motherfuckin' real\n(Buckin' these niggas til they drop)\n\n[Verse 2: Eazy-E]\nNow everything's good in my hood, and it's on and poppin'\nEazy-muthaphukkin'-E from east side south Compton\nStraight givin' up the real\nOn how a nigga feel talk that shit, mothafuckers' caps get peeled\nLayin' low in the cut\nGettin' high than a motherfucker - Niggas know what's up\nI'm that gangsta-gangsta, is that what they're still yellin'?\nNigga G to a T saggin' and bailin'\nLive by the gun, you know what I'm sayin', Ren? (Yeah)\nSo I guess I'll die by that motherfucker then\nSo when I die, niggas bury me\nMake sure my shit reads Eazy-muthaphukkin'-E\nAnd it's a fact, to be exact, my tombstone should read\n'He put Compton on that map'\nAnd that's how a nigga feel\nWhen I'm givin' up the motherfuckin' real\n\n[Hook]\nThe motherfuckin' real\n(Shouts goin' out to the hardcore hip hop)\nThe motherfuckin' real\n(Buckin' these niggas til they drop)\n\n[Verse 3: MC Ren]\nNiggas be pissin' on they self when the real niggas drop\nWhile they rollin' in they shit, hittin' corners on the block\nNiggas fresh out the pen with two strikes\nBe bumpin' this real shit every fuckin' night, it's alright niggas\nIt's two hard motherfuckers on the streets\nIt's the nigga MC Ren and the nigga Eazy...\n\n[Verse 4: Eazy-E]\n...does it ya wish the fuck that you could do it\nGot a nine millimeter don't make me have to shoot it\nWho gives a fuck about the police\nCause them the main mothafucka that break the peace\nNow let me know how the fuck do you feel\nGettin' hit with the motherfuckin' real\n\n[Hook]\nThe motherfuckin' real\n(Shouts goin' out to the hardcore hip hop)\nThe motherfuckin' real\n(Buckin' these niggas til they drop)\n\n[Outro: Eazy-E]\nYeah, keepin' it real for the '9-5\nFor all you niggas out there that's true to the motherfuckin' game\nN.W.A.'s back in this, bitch\nAnd busta-ass niggas don't even understand it\nYo, Yella kick that shit", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "Tha real", "lyrics": "[M.C. Ren]\nWell it be the real niggas back\nWith that hard street shit\nBitch niggas be pissin a fit\nBut I say fuck 'em, when I buck 'em\nIts that nigga with the cool and mellow shit\nFor your ass takin' niggas back through the past\nAll up on my nutz shit be swingin' like a fist\nCan't even take a piss\nIf I did niggas would cut they wrist\nIn a muthaphukkin candy 4\nBeat that ass with the switch\nThen blast on the bitch\nWho was all in my shit\nIts that nigga Ren back for the 9-5\nThey say real niggas was dead\nBut this nigga be alive\nSo I'm puttin' it down wit that nigga E uh-huh\nFor all of my niggas in the C-P-T\nSo here we go again with part 3 of the script\nMakin bitch made niggas bite they lip, when we dip\nSo tell me how the phuck do it feel\nTah get hit wit Tha Muthaphukkin Real\n\n[Chorus]\nTha Muthaphukkin Real\nShouts going out to the hardcore hip-hop\nTha Muthaphukkin Real\nBuckin' these niggas till they drop\n\n[Eazy-E]\nNow everythings good in my hood\nAnd its on and pop and Eazy-Muthaphukkin-E\nFrom East Side South Compton\nStr8 givin' up the real\nOn how a nigga feel talk that shit\nMuthaphukkaz caps get peeled\nLayin' low in the cut\nGettin how than a muthaphuka niggas knows whats up\nI'm that gangsta, gangsta is that what there still yellin'\nNigga G to a T saggin' and bailin'\nLive by the gun you know what I'm sayin' Ren\n\"Yea\"\nSo I guess I'll die by that muthaphukka then\nSo when I die niggas bury me\nMake sure my shit reads Eazy-Muthaphukkin-E\nAnd it's a fact to be exact my tombstone should read:\nHe Put Compton On That Map\nAnd thats how a nigga feel\nWhen I'm givin' up Tha Muthaphukkin Real\n\n[Chorus]\nTha Muthaphukkin Real\nShouts going out to the hardcore hip-hop\nTha Muthaphukkin Real\nBuckin' these niggas till they drop\nTha Muthaphukkin Real\n\n[M.C. Ren]\nNiggas be pissin' on they self\nWhen the real niggas drop\nWhile they rollin' in they shit\nHittin' corners on the block\nNiggas fresh out the Pen with 2 strikes\nBe bumpin' this real shit every phukkin night\nIt's alright niggas\nIt's 2 hard muthphukkaz on tha streetz\nIt's the nigga M.C. Ren and the Nigga Eazy\n\n[Eazy-E]\nDoes it ya wish the fuck that you could do it\nGot a Nine Millameter don't make me have to shoot it\nWho gives a fuck about the police\nCause I'm the main muthphukka that break the peace\nNow let me know how the phuck do you feel\nGettin' hit wit Tha Muthaphukkin Real\n\n[Chorus]\nTha Muthaphukkin Real\nShouts going out to the hardcore hip-hop\nTha Muthaphukkin Real\nBuckin' these niggas till they drop (x2)\n\n[Eazy-E]\nYeah Keepin' it real for the 9-5\nFor all you niggas out there\nThats true to the muthaphukkin game\nN.W.A.'s back in this bitch\nAnd busta ass niggas don't even understand it\nYo yella kick that shit", "year": null}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "We Want Eazy", "lyrics": "[Michel'le]\n\"We want Eazy!\"\n\n[Dr. Dre]\nYea, yea! Can yall hear that?\nCan yall hear that?\nWell, clap ya hands then-come on\nClap ya hands everybody\nClap ya hands, come on, come on\nPut ya hands together and clap 'em\nNow can y'all say Eazy!\nCome on, say it\n\nEAZY!\nEverybody come on!\nEAZY!\nWho yall came to see?\nEazy!\nA little louder come on!\nEAZY!\nGet those hands in the air!\nEazy!\nCome on, come on say it!\nEazy!\nA little louder come on!\nEAZY!\nCome on make some noise!\nEAZY!\nAyo Ren lets do this\n\n[MC Ren]\nPeople from everywhere gather around\nCheckin' out the sound that Eazy is throwin' down\nWith some help from Ren and Dre\nMakin' a way with dope style\nYo Eazy, what ya gotta say\n\n[Verse 1: Eazy-E]\nA miracle of modern creation\nEazy E's on the set, hyped up with the bass\nAnd a little bit of what ya love\nFrom a brother who's smooth like a criminal\nI mean subliminal - Otherwise known as a villain\nBecause I'm ruthless, when I spot a sucka, I kill 'em\nBut most I think know not to deal with me\nYo, it's obvious, tell 'em who you came to see\n\nEAZ-Y...\n\n[Michel'le]\n(Michel'le)Eazy\nHey eazy\n(Eazy)Wassup??\n(Michel'le)Why you wear your pants like that?\n(Eazy)I wear my pants like this, fo' easy access baby\nYeah thats right\n\n(Ice Cube)\nYo homeboy, where we takin' this jam to?\nCOMPTON\nWhere?\nCOMPTON\nAlright\n\n[Verse 2: Eazy-E]\nYeah 'cuz this is the way I know you like it\nSo you won't strike it\nI took it and I hyped it\nAnd now that it's done, I know ya pleased\nAt how the E just duz it with ease\nJust imagine a crowd screamin', a girl dreamin'\nJust to get a picture of me 'n' my B-O-Y-Z\nFrom the H-double-O-D\nN.W.A., down with me\nStrong 'n' I'm ragin'\nTurn the page 'n'\nSee I'm not a son of a gun\nI'm a gauge 'n'\nNuthin' can avoid this shot cause it's hittin'\nIt's so cool when you touch it, wear a mitten\nI'm comin' off raw into ya speaker\nMakin' the suckas on the street feel weaker\nBut most I think know not to deal with me\nYo, it's obvious, tell 'em who you came to see\n\nEAZ-Y...\n\nYo man, you weren't born in no '73\nWhy you be lyin' bout your age?\n(Eazy-E)\nMan, why you gotta bring that up?\nYo, get this fool outta here!\n\nHey Eazy why you always cussin' on your records?\n(Eazy-E)\nWho are you, Gene Autry or somethin'?\nI just do that to get my point across\nNow I wanna know who you came to see\n\nEAZ-Y...\n\n[Verse 3: Eazy-E]\nAw, never, I'm just too clever\nSo, in fact, that no one can sever\nA blow from a maniac and yo, I make it clear\nSo a register is all I hear\nMoney overturned, then I jet\nTo make another hit, for you to go and get\nRecord stores sold out because you love it\nAnother example of how Eazy duz it\n\nEAZ-Y\nWe want Eazy...", "year": "1988-09-13"}, {"artist": "Eazy-E", "album": "Eazy-Duz-It", "title": "We Want Eazy (Remix)", "lyrics": "[Intro: Dr. Dre + Eazy-E]\n(We're ready?)\nEazy!\nWe want Eazy!\nWho'd y'all come to see?\nEazy!\nTell 'em who you came-, Tell 'em who you came-, Tell 'em who you came to see\n(We want Eazy)\nYeah, yeah!\nCan I get down one time?\nYeah, you know what time it is\nAyo yo yo, let's make it funky right here\nPut yo hands-, put yo hands-, pu-, pu-, pu-. pu-, put you hands together\nAw, yeah\nPut yo hands-, Put yo hands together\n(And clap your hands to what he's doing)\n\nEazy!\nEverybody come on!\nEazy!\nWho'd y'all came to see?\nEazy!\nCome on, come on say it!\nEazy!\nA little louder, come on!\nEazy!\nGet those hands up in the air!\nEazy!\nA little louder, come on say it!\nEazy!\nAll of me\nWhy not take all of me?\nEazy!\nYeah, yeah, yeah!\nEazy!\nWho y'all want?\nWe want Eazy!\nTell em who you came to see\nEazy!\nAyo Ren lets do this\nWe want Eazy!\n\n[MC Ren]\nPeople from everywhere gather around\nCheckin' out the sound that Eazy is throwin' down\nWith some help from Ren and Dre\nMakin' a way with dope style\nYo Eazy, what ya gotta say\n\n[Verse 1: Eazy-E + Dr. Dre]\nA miracle of modern creation\nEazy E's on the set, hyped up with the bass\nAnd a little bit of what ya love\nFrom a brother who's smooth like a criminal\nI mean subliminal - Otherwise known as a villain\nBecause I'm ruthless, when I spot a sucka, I kill 'em\nBut most I think know not to deal with me\nYo, it's obvious, tell 'em who you came to see\n\n(Eazy!)\nEverybody, come on!\n(Eazy!)\nA little louder say it!\n(Eazy!)\nCome on, say it, say it, say it!\n(Eazy!)\nCome on, everybody, come on!\n(Eazy!)\nWho'd y'all come to see?\n(Eazy!)\nA little louder, come on, say it!\n(Eazy!)\nCome on, come on, come on, come on, come on\n(We want Eazy!)\nAyo Yella boy, take me to the bridge\n\n[Bridge: Dr.Dre]\n(Get funky with it)\n(Get funky with it)\n(Get funky with it)\n(Get funky with it)\n\n(Eazy!)\nEverybody in the house!\n(Eazy!)\nCome on, say Eazy, Come on!\n(Eazy!)\nCome on, say it, say it, say it!\n(We want Eazy!)\nAyo Eazy, kick me another verse\n\n[Verse 2: Eazy-E + Dr. Dre]\nYeah 'cuz this is the way I know you like it\nSo you won't strike it\nI took it and I hyped it\nAnd now that it's done, I know ya pleased\nAt how the E just duz it with ease\nJust imagine a crowd screamin', a girl dreamin'\nJust to get a picture of me 'n' my B-O-Y-Z\nFrom the H-double-O-D\nN.W.A., down with me\nStrong 'n' I'm ragin'\nTurn the page 'n'\nSee I'm not a son of a gun\nI'm a gauge 'n'\nNuthin' can avoid this shot cause it's hittin'\nIt's so cool when you touch it, wear a mitten\nI'm comin' off raw into ya speaker\nMakin' the suckas on the street feel weaker\nBut most I think know not to deal with me\nYo, it's obvious, tell 'em who you came to see\n\n(Eazy!)\nEverybody come on!\n(Eazy!)\nGet those hands back in the air!\n(Eazy!)\nCome on, say it, say it, say it\n(Eazy!)\nCome on, everybody, come on!\n(Eazy!)\nI can't hear you\n(Eazy!)\nA little louder, come on, say it!\n(Eazy!)\nCome on, say it, say it, say it\n(Eazy!)\nAyo Yella boy, you know what time it is\n\n[Bridge: Eazy-E + Dr. Dre]\n(Eazy, hey Eazy!)\nWassup?\n(Why do you wear your pants like that?)\nI wear my pants like this for easy access, baby\nYeah, that's right\n(Ey homeboy, where we taking this jam to?)\n(COMPTON)\n(Where?)\n(COMPTON)\n(Aw yeah)\nNow I wanna know who ya came to see\n\n(Eazy!)\nAyo, this record's almost over\n(Eazy!)\n...so that means y'all gotta get hyped up!\n(Eazy!)\nCome on, say it, say it, say it!\n(Eazy!)\nDo it, do it, do it, do it!\n(Eazy!)\nEverybody in the house!\n(Eazy!)\nCome on, say Eazy, come on!\n(Eazy!)\nAyo, who y'all want?\n(We want Eazy!)\nAyo Ren, let's kick another verse\n\n[MC Ren & Dr. Dre]\nRen and Dre, the Villian and the Doctor together\nYo we can rock by ourselves, but we're together whenever\nA funky track is included, it's getting better, not worse\nEspecially when Eazy's here to kick another verse\n\n[Verse 3]\nAw, never, I'm just too clever\nSo, in fact, that no one can sever\nA blow from a maniac and yo, I make it clear\nSo a register is all I hear\nMoney overturned, then I jet\nTo make another hit, for you to go and get\nRecord stores sold out because you love it\nAnother example of how Eazy duz it\n\n[Bridge: Eazy-E + Dr.Dre]\n(Eazy!)\nHa ha ha ha!\nWho y'all want?\n(We want Eazy!)\nAw yeah\n(Eazy!)\nAll of me\nWhy not take all of me?\n(We want Eazy!)\nWho'd y'all come to see\n(Eazy!)\nYeah\nYeah\n(We want Eazy!)\nCan I get down one time?\n(Eazy!)\nYeah, you know what time it is\n(We want Eazy!)\nYo stag, give me a funky solo homeboy\n\n(Eazy!)\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\nAll of me\nWhy not take all of me?\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\n(We want Eazy!)\nTurn this mother out!\n(Eazy!)\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\nAll of me\nWhy not take all of me?\n(We want Eazy!)\n(Get funky with it)\n(Eazy!)\n(We want Eazy!)\nAlright\nHave a break right here\n(Eazy!)\n(We want Eazy!)\nCheck this out\n(Eazy!)\n*scatting*\n(We want Eazy!)\n(Eazy!)\nYo we just dropped a bomb on you\n(We want Eazy!)\nCheck it out\n(Eazy!)\n(We want Eazy!)\n\n[Verse 4]\nSaid it before, a miracle, a lyrical, and ever\nSomething that suckers can never sever\nSit for a second and check what jockeys are brazing\nPure dope, figure it out like amazing\nCome to grips with the fact, Eazy-E ain't a lightweight\nNervous never, you could get broke with your brake\nSo if you're smart, take me from the start\nThe boyz 'n the hood are always hard\nTime for a show, the stage I hit, and it's legit\n'Cuz the crowd be like tripping and the girls be having a fit\nIt's like a riot, someone said I'm at the high\nEverybody wants to scream and I try to get 'em quiet\nTo continue, never the less, they're on a mission to perditious\nAnd to be in company with my permission\nExceptional, speaking of the E in Eazy-E\nI gotta hear it, tell 'em who you came to see\n\n(Eazy!)\n(We want Eazy!)", "year": null}, {"artist": "Eazy-E", "album": "Str8 Off Tha Streetz of Muthaphukkin Compton", "title": "Wut Would You Do", "lyrics": "[Intro: Eazy-E]\nInside the minds of real G's\nDeath Row is looked upon as the studio gangstas of the 90's\nA joke *laughing* in a game called 5 minutes of fame\nYou wasted 4 minutes\nNow you got seconds left, kick it\n*laughing*\n\n[Verse 1: Eazy-E]\nCome on, come all, and let me ride, nigga\nEazy-E, C-P-T, how the hell you figure\nTo be the best on the west, huh yeah\nFool, I doubt it, this is east side, nigga\nSouth Compton\nAnd I put it on the map\nSo what up Dogg Pound Crip\nYou wanna scrap\nAnd that's comin' straight from the ruthless gangsta Eazy-E\nNow what would I do, haha, let's see\nNow I would take out Suge and stomp down the row\nSince Dre is a bitch pimp slap the ho (ba-by)\nNow I'm seein' doubles, aw man\nTwo dogs in a huddle, aw goddamn\nNow, diggidi diggidi Daz I biggidi biggidi blast\nDon’t run or i’ll smoke that ass\nNow Kurupt, don't even set trip\nYellin' Long Beach 6-0 blood and puppy pound Crip\nReally doe\nGot my nuts on your chin\nWhile I'm all in your philly ho\nSo come with it fool and test your luck and I'll beat that ass\nNow call me Kurupt\nNow I'm creepin' through the fog, yeah, big dog blue\nGot my 9 milla-killa huntin' dog named Snoop\nYou can run nigga but you can't hide\nEazy-E straight creepin' on the east side\n7-10 Long Beach South\nFound Snoop freebasin' in a rock house\nI kicks in the door, I said it before\nI never let no bustas test me no more\n(Murder was the case that they gave me)\n(Murder was the case that they gave me)\nI'll smoke all you fools even you boo-boo and your baby\n(Murder was the case that they gave me)\nWatch out buddy boy\nWatch your back\nYeah, what would you do?\nWhat would you do, if we rolled on you?\n\n[Hook]\n(Yeah...)\nWhat would you do\n(...so don't even think about...)\nWhat would you do, if we rolled on you\n(...stepping in the goddamn house)\nWhat would you do\nWhat would you do, if we rolled on you\n(Yeah...)\nWhat would you do\n(...so don't even think about...)\nWhat would you do, Dirty Red\n(...stepping in the goddamn house)\n\n[Verse 2: Dirty Red]\nDirty Red, I comes on the sneak\nHittin' niggas low with the cappy ass flow\nAs I creep through the street, peepin' niggas from Death Row\nBet you I know, which one of y'all make the best ho\nSo let me break it down as I'm lost in the mist\nTake word of advice and don't come fuckin' with this\nIt ain't a joke niggas choke from the smoke that I blaze\nPurple haze you be dazed in a stun\nI'll put you on your back nigga, what\nI am the guts\nIn a Doggy Dogg World\nI never run with mutts\nOnly nuts in their click\nAnd dick in your mouth\nThe year is '95 and I'm runnin' the house\nNow tell me, what can you do\nNigga, what can you do\nNigga, what could you do\nIf me and a few of my homies came through\nDumpin' real on you trick made bitch-made niggas\nWut could you do\nWut could you do, if we rolled on you\n\n[Hook]\n\n[Outro]\nDr. Dre\nStraight busta\nNever broke a law in his life\nBesides beatin' up Ricky Harris' wife\nHaha\nSnoop Dogg\nFrom a high top fade to sportin' braids\nNow he's laid\nFame no fortune\nAnd gettin' played, not payed, played\nTreated like a prostitute\nAnd we all know who's doin' the pimpin'\nDaz, don't be a follower, be a leader\nAnd stay off the next man's nuts\nKurupt, the Kingpin, sticks with the 6-0's\nCause you don't need those other hoes\nCause they're about to go up in you\nBut only if you let 'em\n*laughing*\nDeath Row, really doe, ba-by\n*bang*\n*cries*", "year": "1996-01-30"}, {"artist": "Eazy-E", "album": null, "title": "You ain't seen shit", "lyrics": "Seven-thousand, four hundred, twenty three grains\nOf sand drop from the hourglass\nIt's how much time I got left on this planet\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born\nToo late, big mistake in '72\nIt's '92, now the year of code blue\n15 hours..11 minutes..30 seconds\nI'm a motherfuckin' wreck\nGonna pay back niggas who did me wrong in the past\nMy days ain't long\nI'm comin' strong and fast\nLock up 8 niggs..kill up 10 pigs\nInnocent and fuckers are also dyin, too\nNow what else can I do?\nFuck, fuck, fuck and plant my seeds\nLeavin' kids in this world like me\nThe lunatic psycho mutherfucka Eazy-E\n\nShut the fuck up nigga\nCause you ain't seen shit\nYou ain't seen shit\nYou ain't seen shit\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born(x5)\n\n24 hours to live\nOh why, oh why?\nMust die\n\nSky diving, scuba diving\nTo Evel Knievel stunt car drivin'\nBungee cord jumpin' off a bridge\nIt's hard to breathe with a fractured rib\nI can't take this shit\nLet me see how much more time I got to spend\nHit more skins\nBack up in her pussy\nUp in the butt\nI gotta let off\nA few more nuts\nI'm starting to panic\nI'm starting to sweat\nCause I don't really wanna die yet\nDizzy spells, flashbacks in my head\nNiggas ain't want me to bein' happy when I'm dead\nBut I ain't goin' out unless 30 niggas die\nI'm dying anyway so I'm thinking suicide\nRun into a crowd of niggas dyin' by the pistol\n24 hours to live\nTook the motheruckin' whistle\nBut I don't wanna die\n24 hours to live\nOh why, oh why?\nMust die\n\n\nTo sweep with the feet when he hit the concrete\nChop him up, dice him up and sacrifice his meat\nDrag him by his ankles to the cemetary\n\nShut the fuck up nigga\nCause you ain't seen shit\nYou ain't seen shit\nYou ain't seen shit\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born(x4)\n\n\nShut the fuck up nigga\nCause you ain't seen shit\nI'm 'bout to take this blade and staight up grip\nI'm holdin' the neck of the devil and drink his blood\nAllowing my soul to be polluted by his evil root\nAnd now I'm mad insane, red as rose as I strain for my hearbeat\nTo thumpety-thump to pump, it might burst\nFalse alarms, and no harm that will commit to the E\n\nNow you choose\nHow will you spend your last 24 hours?\nC'mon..talk to me\n\nBut now I'm down to an hour 23\nTime is moving fast, but not that slow\nI thought I had an hour, but it's seconds left the go\nI ran into the office\nNo more time is left\nI ran up to the doctor with a bomb to my...\n\nShut the fuck up nigga\nCause you ain't seen shit\nYou ain't seen shit\nYou ain't seen shit\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born(x4)", "year": "2011-07-31"}]